RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/*
 * @note     Generated by SVDConv V3.3.35 on Tuesday, 01.09.2020 17:58:39
 *           from File 'GD32VF103.svd',
 */

#ifndef GD32VF103_PERIPH_H
#define GD32VF103_PERIPH_H

#include "stdint.h"

#ifdef __cplusplus
extern "C" {
#endif

/* =========================================================================================================================== */
/* ================                                           ADC0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog to digital converter (ADC0)
  */

typedef struct {                                /*!< (@ 0x40012400) ADC0 Structure                                             */

  union {
    __IO uint32_t STAT;                        /*!< (@ 0x00000000) status register                                            */

    struct {
      __IO uint32_t WDE        : 1;            /*!< [0..0] Analog watchdog event flag                                         */
      __IO uint32_t EOC        : 1;            /*!< [1..1] End of group conversion flag                                       */
      __IO uint32_t EOIC       : 1;            /*!< [2..2] End of inserted group conversion flag                              */
      __IO uint32_t STIC       : 1;            /*!< [3..3] Start flag of inserted channel group                               */
      __IO uint32_t STRC       : 1;            /*!< [4..4] Start flag of regular channel group                                */
            uint32_t            : 27;
    } STAT_b;
  } ;

  union {
    __IO uint32_t CTL0;                        /*!< (@ 0x00000004) control register 0                                         */

    struct {
      __IO uint32_t WDCHSEL    : 5;            /*!< [4..0] Analog watchdog channel select                                     */
      __IO uint32_t EOCIE      : 1;            /*!< [5..5] Interrupt enable for EOC                                           */
      __IO uint32_t WDEIE      : 1;            /*!< [6..6] Interrupt enable for WDE                                           */
      __IO uint32_t EOICIE     : 1;            /*!< [7..7] Interrupt enable for EOIC                                          */
      __IO uint32_t SM         : 1;            /*!< [8..8] Scan mode                                                          */
      __IO uint32_t WDSC       : 1;            /*!< [9..9] When in scan mode, analog watchdog is effective on a
                                                     single channel                                                            */
      __IO uint32_t ICA        : 1;            /*!< [10..10] Inserted channel group convert  automatically                    */
      __IO uint32_t DISRC      : 1;            /*!< [11..11] Discontinuous mode on regular channels                           */
      __IO uint32_t DISIC      : 1;            /*!< [12..12] Discontinuous mode on  inserted channels                         */
      __IO uint32_t DISNUM     : 3;            /*!< [15..13] Number of conversions in  discontinuous mode                     */
      __IO uint32_t SYNCM      : 4;            /*!< [19..16] sync mode selection                                              */
            uint32_t            : 2;
      __IO uint32_t IWDEN      : 1;            /*!< [22..22] Inserted channel analog watchdog  enable                         */
      __IO uint32_t RWDEN      : 1;            /*!< [23..23] Regular channel analog watchdog enable                           */
            uint32_t            : 8;
    } CTL0_b;
  } ;

  union {
    __IO uint32_t CTL1;                        /*!< (@ 0x00000008) control register 1                                         */

    struct {
      __IO uint32_t ADCON      : 1;            /*!< [0..0] ADC on                                                             */
      __IO uint32_t CTN        : 1;            /*!< [1..1] Continuous mode                                                    */
      __IO uint32_t CLB        : 1;            /*!< [2..2] ADC calibration                                                    */
      __IO uint32_t RSTCLB     : 1;            /*!< [3..3] Reset calibration                                                  */
            uint32_t            : 4;
      __IO uint32_t DMA        : 1;            /*!< [8..8] DMA request enable                                                 */
            uint32_t            : 2;
      __IO uint32_t DAL        : 1;            /*!< [11..11] Data alignment                                                   */
      __IO uint32_t ETSIC      : 3;            /*!< [14..12] External trigger select for inserted channel                     */
      __IO uint32_t ETEIC      : 1;            /*!< [15..15] External trigger select for inserted channel                     */
            uint32_t            : 1;
      __IO uint32_t ETSRC      : 3;            /*!< [19..17] External trigger select for regular channel                      */
      __IO uint32_t ETERC      : 1;            /*!< [20..20] External trigger enable for regular channel                      */
      __IO uint32_t SWICST     : 1;            /*!< [21..21] Start on inserted channel                                        */
      __IO uint32_t SWRCST     : 1;            /*!< [22..22] Start on regular channel                                         */
      __IO uint32_t TSVREN     : 1;            /*!< [23..23] Channel 16 and 17 enable of ADC0                                 */
            uint32_t            : 8;
    } CTL1_b;
  } ;

  union {
    __IO uint32_t SAMPT0;                      /*!< (@ 0x0000000C) Sample time register 0                                     */

    struct {
      __IO uint32_t SPT10      : 3;            /*!< [2..0] Channel 10 sample time selection                                   */
      __IO uint32_t SPT11      : 3;            /*!< [5..3] Channel 11 sample time selection                                   */
      __IO uint32_t SPT12      : 3;            /*!< [8..6] Channel 12 sample time selection                                   */
      __IO uint32_t SPT13      : 3;            /*!< [11..9] Channel 13 sample time selection                                  */
      __IO uint32_t SPT14      : 3;            /*!< [14..12] Channel 14 sample time selection                                 */
      __IO uint32_t SPT15      : 3;            /*!< [17..15] Channel 15 sample time selection                                 */
      __IO uint32_t SPT16      : 3;            /*!< [20..18] Channel 16 sample time selection                                 */
      __IO uint32_t SPT17      : 3;            /*!< [23..21] Channel 17 sample time selection                                 */
            uint32_t            : 8;
    } SAMPT0_b;
  } ;

  union {
    __IO uint32_t SAMPT1;                      /*!< (@ 0x00000010) Sample time register 1                                     */

