RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t SPT0       : 3;            /*!< [2..0] Channel 0 sample time selection                                    */
      __IO uint32_t SPT1       : 3;            /*!< [5..3] Channel 1 sample time selection                                    */
      __IO uint32_t SPT2       : 3;            /*!< [8..6] Channel 2 sample time selection                                    */
      __IO uint32_t SPT3       : 3;            /*!< [11..9] Channel 3 sample time selection                                   */
      __IO uint32_t SPT4       : 3;            /*!< [14..12] Channel 4 sample time selection                                  */
      __IO uint32_t SPT5       : 3;            /*!< [17..15] Channel 5 sample time selection                                  */
      __IO uint32_t SPT6       : 3;            /*!< [20..18] Channel 6 sample time selection                                  */
      __IO uint32_t SPT7       : 3;            /*!< [23..21] Channel 7 sample time selection                                  */
      __IO uint32_t SPT8       : 3;            /*!< [26..24] Channel 8 sample time selection                                  */
      __IO uint32_t SPT9       : 3;            /*!< [29..27] Channel 9 sample time selection                                  */
            uint32_t            : 2;
    } SAMPT1_b;
  } ;

  union {
    __IO uint32_t IOFF0;                       /*!< (@ 0x00000014) Inserted channel data offset register 0                    */

    struct {
      __IO uint32_t IOFF       : 12;           /*!< [11..0] Data offset for inserted channel 0                                */
            uint32_t            : 20;
    } IOFF0_b;
  } ;

  union {
    __IO uint32_t IOFF1;                       /*!< (@ 0x00000018) Inserted channel data offset register 1                    */

    struct {
      __IO uint32_t IOFF       : 12;           /*!< [11..0] Data offset for inserted channel 1                                */
            uint32_t            : 20;
    } IOFF1_b;
  } ;

  union {
    __IO uint32_t IOFF2;                       /*!< (@ 0x0000001C) Inserted channel data offset register 2                    */

    struct {
      __IO uint32_t IOFF       : 12;           /*!< [11..0] Data offset for inserted channel 2                                */
            uint32_t            : 20;
    } IOFF2_b;
  } ;

  union {
    __IO uint32_t IOFF3;                       /*!< (@ 0x00000020) Inserted channel data offset register 3                    */

    struct {
      __IO uint32_t IOFF       : 12;           /*!< [11..0] Data offset for inserted channel 3                                */
            uint32_t            : 20;
    } IOFF3_b;
  } ;

  union {
    __IO uint32_t WDHT;                        /*!< (@ 0x00000024) watchdog higher threshold register                         */

    struct {
      __IO uint32_t WDHT       : 12;           /*!< [11..0] Analog watchdog higher threshold                                  */
            uint32_t            : 20;
    } WDHT_b;
  } ;

  union {
    __IO uint32_t WDLT;                        /*!< (@ 0x00000028) watchdog lower threshold register                          */

    struct {
      __IO uint32_t WDLT       : 12;           /*!< [11..0] Analog watchdog lower threshold                                   */
            uint32_t            : 20;
    } WDLT_b;
  } ;

  union {
    __IO uint32_t RSQ0;                        /*!< (@ 0x0000002C) regular sequence register 0                                */

    struct {
      __IO uint32_t RSQ12      : 5;            /*!< [4..0] 13th conversion in regular sequence                                */
      __IO uint32_t RSQ13      : 5;            /*!< [9..5] 14th conversion in regular sequence                                */
      __IO uint32_t RSQ14      : 5;            /*!< [14..10] 15th conversion in regular sequence                              */
      __IO uint32_t RSQ15      : 5;            /*!< [19..15] 16th conversion in regular sequence                              */
      __IO uint32_t RL         : 4;            /*!< [23..20] Regular channel group length                                     */
            uint32_t            : 8;
    } RSQ0_b;
  } ;

  union {
    __IO uint32_t RSQ1;                        /*!< (@ 0x00000030) regular sequence register 1                                */

    struct {
      __IO uint32_t RSQ6       : 5;            /*!< [4..0] 7th conversion in regular sequence                                 */
      __IO uint32_t RSQ7       : 5;            /*!< [9..5] 8th conversion in regular sequence                                 */
      __IO uint32_t RSQ8       : 5;            /*!< [14..10] 9th conversion in regular sequence                               */
      __IO uint32_t RSQ9       : 5;            /*!< [19..15] 10th conversion in regular sequence                              */
      __IO uint32_t RSQ10      : 5;            /*!< [24..20] 11th conversion in regular sequence                              */
      __IO uint32_t RSQ11      : 5;            /*!< [29..25] 12th conversion in regular sequence                              */
            uint32_t            : 2;
    } RSQ1_b;
  } ;

  union {
    __IO uint32_t RSQ2;                        /*!< (@ 0x00000034) regular sequence register 2                                */

    struct {
      __IO uint32_t RSQ0       : 5;            /*!< [4..0] 1st conversion in regular sequence                                 */
      __IO uint32_t RSQ1       : 5;            /*!< [9..5] 2nd conversion in regular sequence                                 */
      __IO uint32_t RSQ2       : 5;            /*!< [14..10] 3rd conversion in regular sequence                               */
      __IO uint32_t RSQ3       : 5;            /*!< [19..15] 4th conversion in regular sequence                               */
      __IO uint32_t RSQ4       : 5;            /*!< [24..20] 5th conversion in regular sequence                               */
      __IO uint32_t RSQ5       : 5;            /*!< [29..25] 6th conversion in regular sequence                               */
            uint32_t            : 2;
    } RSQ2_b;
  } ;

  union {
    __IO uint32_t ISQ;                         /*!< (@ 0x00000038) Inserted sequence register                                 */

