RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t ISQ0       : 5;            /*!< [4..0] 1st conversion in inserted sequence                                */
      __IO uint32_t ISQ1       : 5;            /*!< [9..5] 2nd conversion in inserted sequence                                */
      __IO uint32_t ISQ2       : 5;            /*!< [14..10] 3rd conversion in inserted sequence                              */
      __IO uint32_t ISQ3       : 5;            /*!< [19..15] 4th conversion in inserted sequence                              */
      __IO uint32_t IL         : 2;            /*!< [21..20] Inserted channel group length                                    */
            uint32_t            : 10;
    } ISQ_b;
  } ;

  union {
    __I  uint32_t IDATA0;                      /*!< (@ 0x0000003C) Inserted data register 0                                   */

    struct {
      __I  uint32_t IDATAn     : 16;           /*!< [15..0] Inserted number n conversion data                                 */
            uint32_t            : 16;
    } IDATA0_b;
  } ;

  union {
    __I  uint32_t IDATA1;                      /*!< (@ 0x00000040) Inserted data register 1                                   */

    struct {
      __I  uint32_t IDATAn     : 16;           /*!< [15..0] Inserted number n conversion data                                 */
            uint32_t            : 16;
    } IDATA1_b;
  } ;

  union {
    __I  uint32_t IDATA2;                      /*!< (@ 0x00000044) Inserted data register 2                                   */

    struct {
      __I  uint32_t IDATAn     : 16;           /*!< [15..0] Inserted number n conversion data                                 */
            uint32_t            : 16;
    } IDATA2_b;
  } ;

  union {
    __I  uint32_t IDATA3;                      /*!< (@ 0x00000048) Inserted data register 3                                   */

    struct {
      __I  uint32_t IDATAn     : 16;           /*!< [15..0] Inserted number n conversion data                                 */
            uint32_t            : 16;
    } IDATA3_b;
  } ;

  union {
    __I  uint32_t RDATA;                       /*!< (@ 0x0000004C) regular data register                                      */

    struct {
      __I  uint32_t RDATA      : 16;           /*!< [15..0] Regular channel data                                              */
      __I  uint32_t ADC1RDTR   : 16;           /*!< [31..16] ADC regular channel data                                         */
    } RDATA_b;
  } ;
  __I  uint32_t  RESERVED[12];

  union {
    __IO uint32_t OVSAMPCTL;                   /*!< (@ 0x00000080) Oversample control register                                */

    struct {
      __IO uint32_t OVSEN      : 1;            /*!< [0..0] Oversampler Enable                                                 */
            uint32_t            : 1;
      __IO uint32_t OVSR       : 3;            /*!< [4..2] Oversampling ratio                                                 */
      __IO uint32_t OVSS       : 4;            /*!< [8..5] Oversampling shift                                                 */
      __IO uint32_t TOVS       : 1;            /*!< [9..9] Triggered Oversampling                                             */
            uint32_t            : 2;
      __IO uint32_t DRES       : 2;            /*!< [13..12] ADC resolution                                                   */
            uint32_t            : 18;
    } OVSAMPCTL_b;
  } ;
} ADC0_Type;                                    /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                           ADC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog to digital converter (ADC1)
  */

typedef struct {                                /*!< (@ 0x40012800) ADC1 Structure                                             */

  union {
    __IO uint32_t STAT;                        /*!< (@ 0x00000000) status register                                            */

    struct {
      __IO uint32_t WDE        : 1;            /*!< [0..0] Analog watchdog event flag                                         */
      __IO uint32_t EOC        : 1;            /*!< [1..1] End of group conversion flag                                       */
      __IO uint32_t EOIC       : 1;            /*!< [2..2] End of inserted group conversion flag                              */
      __IO uint32_t STIC       : 1;            /*!< [3..3] Start flag of inserted channel group                               */
      __IO uint32_t STRC       : 1;            /*!< [4..4] Start flag of regular channel group                                */
            uint32_t            : 27;
    } STAT_b;
  } ;

  union {
    __IO uint32_t CTL0;                        /*!< (@ 0x00000004) control register 0                                         */

    struct {
      __IO uint32_t WDCHSEL    : 5;            /*!< [4..0] Analog watchdog channel select                                     */
      __IO uint32_t EOCIE      : 1;            /*!< [5..5] Interrupt enable for EOC                                           */
      __IO uint32_t WDEIE      : 1;            /*!< [6..6] Interrupt enable for WDE                                           */
      __IO uint32_t EOICIE     : 1;            /*!< [7..7] Interrupt enable for EOIC                                          */
      __IO uint32_t SM         : 1;            /*!< [8..8] Scan mode                                                          */
      __IO uint32_t WDSC       : 1;            /*!< [9..9] When in scan mode, analog watchdog is effective on a
                                                     single channel                                                            */
      __IO uint32_t ICA        : 1;            /*!< [10..10] Inserted channel group convert  automatically                    */
      __IO uint32_t DISRC      : 1;            /*!< [11..11] Discontinuous mode on regular channels                           */
      __IO uint32_t DISIC      : 1;            /*!< [12..12] Discontinuous mode on  inserted channels                         */
      __IO uint32_t DISNUM     : 3;            /*!< [15..13] Number of conversions in  discontinuous mode                     */
            uint32_t            : 6;
      __IO uint32_t IWDEN      : 1;            /*!< [22..22] Inserted channel analog watchdog  enable                         */
      __IO uint32_t RWDEN      : 1;            /*!< [23..23] Regular channel analog watchdog  enable                          */
            uint32_t            : 8;
    } CTL0_b;
  } ;

  union {
    __IO uint32_t CTL1;                        /*!< (@ 0x00000008) control register 1                                         */

