RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t ADCON      : 1;            /*!< [0..0] ADC on                                                             */
      __IO uint32_t CTN        : 1;            /*!< [1..1] Continuous mode                                                    */
      __IO uint32_t CLB        : 1;            /*!< [2..2] ADC calibration                                                    */
      __IO uint32_t RSTCLB     : 1;            /*!< [3..3] Reset calibration                                                  */
            uint32_t            : 4;
      __IO uint32_t DMA        : 1;            /*!< [8..8] DMA request enable                                                 */
            uint32_t            : 2;
      __IO uint32_t DAL        : 1;            /*!< [11..11] Data alignment                                                   */
      __IO uint32_t ETSIC      : 3;            /*!< [14..12] External trigger select for inserted channel                     */
      __IO uint32_t ETEIC      : 1;            /*!< [15..15] External trigger enable for inserted channel                     */
            uint32_t            : 1;
      __IO uint32_t ETSRC      : 3;            /*!< [19..17] External trigger select for regular channel                      */
      __IO uint32_t ETERC      : 1;            /*!< [20..20] External trigger enable for regular channel                      */
      __IO uint32_t SWICST     : 1;            /*!< [21..21] Start on inserted channel                                        */
      __IO uint32_t SWRCST     : 1;            /*!< [22..22] Start on regular channel                                         */
            uint32_t            : 9;
    } CTL1_b;
  } ;

  union {
    __IO uint32_t SAMPT0;                      /*!< (@ 0x0000000C) Sample time register 0                                     */

    struct {
      __IO uint32_t SPT10      : 3;            /*!< [2..0] Channel 10 sample time selection                                   */
      __IO uint32_t SPT11      : 3;            /*!< [5..3] Channel 11 sample time selection                                   */
      __IO uint32_t SPT12      : 3;            /*!< [8..6] Channel 12 sample time selection                                   */
      __IO uint32_t SPT13      : 3;            /*!< [11..9] Channel 13 sample time selection                                  */
      __IO uint32_t SPT14      : 3;            /*!< [14..12] Channel 14 sample time selection                                 */
      __IO uint32_t SPT15      : 3;            /*!< [17..15] Channel 15 sample time selection                                 */
      __IO uint32_t SPT16      : 3;            /*!< [20..18] Channel 16 sample time selection                                 */
      __IO uint32_t SPT17      : 3;            /*!< [23..21] Channel 17 sample time selection                                 */
            uint32_t            : 8;
    } SAMPT0_b;
  } ;

  union {
    __IO uint32_t SAMPT1;                      /*!< (@ 0x00000010) Sample time register 1                                     */

    struct {
      __IO uint32_t SPT0       : 3;            /*!< [2..0] Channel 0 sample time selection                                    */
      __IO uint32_t SPT1       : 3;            /*!< [5..3] Channel 1 sample time selection                                    */
      __IO uint32_t SPT2       : 3;            /*!< [8..6] Channel 2 sample time selection                                    */
      __IO uint32_t SPT3       : 3;            /*!< [11..9] Channel 3 sample time selection                                   */
      __IO uint32_t SPT4       : 3;            /*!< [14..12] Channel 4 sample time selection                                  */
      __IO uint32_t SPT5       : 3;            /*!< [17..15] Channel 5 sample time selection                                  */
      __IO uint32_t SPT6       : 3;            /*!< [20..18] Channel 6 sample time selection                                  */
      __IO uint32_t SPT7       : 3;            /*!< [23..21] Channel 7 sample time selection                                  */
      __IO uint32_t SPT8       : 3;            /*!< [26..24] Channel 8 sample time selection                                  */
      __IO uint32_t SPT9       : 3;            /*!< [29..27] Channel 9 sample time selection                                  */
            uint32_t            : 2;
    } SAMPT1_b;
  } ;

  union {
    __IO uint32_t IOFF0;                       /*!< (@ 0x00000014) Inserted channel data offset register 0                    */

    struct {
      __IO uint32_t IOFF       : 12;           /*!< [11..0] Data offset for inserted channel 0                                */
            uint32_t            : 20;
    } IOFF0_b;
  } ;

  union {
    __IO uint32_t IOFF1;                       /*!< (@ 0x00000018) Inserted channel data offset register 1                    */

    struct {
      __IO uint32_t IOFF       : 12;           /*!< [11..0] Data offset for inserted channel 1                                */
            uint32_t            : 20;
    } IOFF1_b;
  } ;

  union {
    __IO uint32_t IOFF2;                       /*!< (@ 0x0000001C) Inserted channel data offset register 2                    */

    struct {
      __IO uint32_t IOFF       : 12;           /*!< [11..0] Data offset for inserted channel 2                                */
            uint32_t            : 20;
    } IOFF2_b;
  } ;

  union {
    __IO uint32_t IOFF3;                       /*!< (@ 0x00000020) Inserted channel data offset register 3                    */

    struct {
      __IO uint32_t IOFF       : 12;           /*!< [11..0] Data offset for inserted channel 3                                */
            uint32_t            : 20;
    } IOFF3_b;
  } ;

  union {
    __IO uint32_t WDHT;                        /*!< (@ 0x00000024) watchdog higher threshold register                         */

    struct {
      __IO uint32_t WDHT       : 12;           /*!< [11..0] Analog watchdog higher threshold                                  */
            uint32_t            : 20;
    } WDHT_b;
  } ;

  union {
    __IO uint32_t WDLT;                        /*!< (@ 0x00000028) watchdog lower threshold register                          */

