RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t WDLT       : 12;           /*!< [11..0] Analog watchdog lower threshold                                   */
            uint32_t            : 20;
    } WDLT_b;
  } ;

  union {
    __IO uint32_t RSQ0;                        /*!< (@ 0x0000002C) regular sequence register 0                                */

    struct {
      __IO uint32_t RSQ12      : 5;            /*!< [4..0] 13th conversion in regular sequence                                */
      __IO uint32_t RSQ13      : 5;            /*!< [9..5] 14th conversion in regular sequence                                */
      __IO uint32_t RSQ14      : 5;            /*!< [14..10] 15th conversion in regular sequence                              */
      __IO uint32_t RSQ15      : 5;            /*!< [19..15] 16th conversion in regular sequence                              */
      __IO uint32_t RL         : 4;            /*!< [23..20] Regular channel group length                                     */
            uint32_t            : 8;
    } RSQ0_b;
  } ;

  union {
    __IO uint32_t RSQ1;                        /*!< (@ 0x00000030) regular sequence register 1                                */

    struct {
      __IO uint32_t RSQ6       : 5;            /*!< [4..0] 7th conversion in regular sequence                                 */
      __IO uint32_t RSQ7       : 5;            /*!< [9..5] 8th conversion in regular sequence                                 */
      __IO uint32_t RSQ8       : 5;            /*!< [14..10] 9th conversion in regular sequence                               */
      __IO uint32_t RSQ9       : 5;            /*!< [19..15] 10th conversion in regular sequence                              */
      __IO uint32_t RSQ10      : 5;            /*!< [24..20] 11th conversion in regular sequence                              */
      __IO uint32_t RSQ11      : 5;            /*!< [29..25] 12th conversion in regular sequence                              */
            uint32_t            : 2;
    } RSQ1_b;
  } ;

  union {
    __IO uint32_t RSQ2;                        /*!< (@ 0x00000034) regular sequence register 2                                */

    struct {
      __IO uint32_t RSQ0       : 5;            /*!< [4..0] 1st conversion in regular sequence                                 */
      __IO uint32_t RSQ1       : 5;            /*!< [9..5] 2nd conversion in regular sequence                                 */
      __IO uint32_t RSQ2       : 5;            /*!< [14..10] 3rd conversion in regular sequence                               */
      __IO uint32_t RSQ3       : 5;            /*!< [19..15] 4th conversion in regular sequence                               */
      __IO uint32_t RSQ4       : 5;            /*!< [24..20] 5th conversion in regular sequence                               */
      __IO uint32_t RSQ5       : 5;            /*!< [29..25] 6th conversion in regular sequence                               */
            uint32_t            : 2;
    } RSQ2_b;
  } ;

  union {
    __IO uint32_t ISQ;                         /*!< (@ 0x00000038) Inserted sequence register                                 */

    struct {
      __IO uint32_t ISQ0       : 5;            /*!< [4..0] 1st conversion in inserted sequence                                */
      __IO uint32_t ISQ1       : 5;            /*!< [9..5] 2nd conversion in inserted sequence                                */
      __IO uint32_t ISQ2       : 5;            /*!< [14..10] 3rd conversion in inserted sequence                              */
      __IO uint32_t ISQ3       : 5;            /*!< [19..15] 4th conversion in inserted sequence                              */
      __IO uint32_t IL         : 2;            /*!< [21..20] Inserted channel group length                                    */
            uint32_t            : 10;
    } ISQ_b;
  } ;

  union {
    __I  uint32_t IDATA0;                      /*!< (@ 0x0000003C) Inserted data register 0                                   */

    struct {
      __I  uint32_t IDATAn     : 16;           /*!< [15..0] Inserted number n conversion data                                 */
            uint32_t            : 16;
    } IDATA0_b;
  } ;

  union {
    __I  uint32_t IDATA1;                      /*!< (@ 0x00000040) Inserted data register 1                                   */

    struct {
      __I  uint32_t IDATAn     : 16;           /*!< [15..0] Inserted number n conversion data                                 */
            uint32_t            : 16;
    } IDATA1_b;
  } ;

  union {
    __I  uint32_t IDATA2;                      /*!< (@ 0x00000044) Inserted data register 2                                   */

    struct {
      __I  uint32_t IDATAn     : 16;           /*!< [15..0] Inserted number n conversion data                                 */
            uint32_t            : 16;
    } IDATA2_b;
  } ;

  union {
    __I  uint32_t IDATA3;                      /*!< (@ 0x00000048) Inserted data register 3                                   */

    struct {
      __I  uint32_t IDATAn     : 16;           /*!< [15..0] Inserted number n conversion data                                 */
            uint32_t            : 16;
    } IDATA3_b;
  } ;

  union {
    __I  uint32_t RDATA;                       /*!< (@ 0x0000004C) regular data register                                      */

    struct {
      __I  uint32_t RDATA      : 16;           /*!< [15..0] Regular channel data                                              */
            uint32_t            : 16;
    } RDATA_b;
  } ;
} ADC1_Type;                                    /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                           AFIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Alternate-function I/Os (AFIO)
  */

typedef struct {                                /*!< (@ 0x40010000) AFIO Structure                                             */

  union {
    __IO uint32_t EC;                          /*!< (@ 0x00000000) Event control register                                     */

