RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t PIN        : 4;            /*!< [3..0] Event output pin selection                                         */
      __IO uint32_t PORT       : 3;            /*!< [6..4] Event output port selection                                        */
      __IO uint32_t EOE        : 1;            /*!< [7..7] Event output enable                                                */
            uint32_t            : 24;
    } EC_b;
  } ;

  union {
    __IO uint32_t PCF0;                        /*!< (@ 0x00000004) AFIO port configuration register 0                         */

    struct {
      __IO uint32_t SPI0_REMAP : 1;            /*!< [0..0] SPI0 remapping                                                     */
      __IO uint32_t I2C0_REMAP : 1;            /*!< [1..1] I2C0 remapping                                                     */
      __IO uint32_t USART0_REMAP : 1;          /*!< [2..2] USART0 remapping                                                   */
      __IO uint32_t USART1_REMAP : 1;          /*!< [3..3] USART1 remapping                                                   */
      __IO uint32_t USART2_REMAP : 2;          /*!< [5..4] USART2 remapping                                                   */
      __IO uint32_t TIMER0_REMAP : 2;          /*!< [7..6] TIMER0 remapping                                                   */
      __IO uint32_t TIMER1_REMAP : 2;          /*!< [9..8] TIMER1 remapping                                                   */
      __IO uint32_t TIMER2_REMAP : 2;          /*!< [11..10] TIMER2 remapping                                                 */
      __IO uint32_t TIMER3_REMAP : 1;          /*!< [12..12] TIMER3 remapping                                                 */
      __IO uint32_t CAN0_REMAP : 2;            /*!< [14..13] CAN0 alternate interface remapping                               */
      __IO uint32_t PD01_REMAP : 1;            /*!< [15..15] Port D0/Port D1 mapping on OSC_IN/OSC_OUT                        */
      __IO uint32_t TIMER4CH3_IREMAP : 1;      /*!< [16..16] TIMER4 channel3 internal remapping                               */
            uint32_t            : 5;
      __IO uint32_t CAN1_REMAP : 1;            /*!< [22..22] CAN1 I/O remapping                                               */
            uint32_t            : 1;
      __IO uint32_t SWJ_CFG    : 3;            /*!< [26..24] Serial wire JTAG configuration                                   */
            uint32_t            : 1;
      __IO uint32_t SPI2_REMAP : 1;            /*!< [28..28] SPI2/I2S2 remapping                                              */
      __IO uint32_t TIMER1ITI1_REMAP : 1;      /*!< [29..29] TIMER1 internal trigger 1 remapping                              */
            uint32_t            : 2;
    } PCF0_b;
  } ;

  union {
    __IO uint32_t EXTISS0;                     /*!< (@ 0x00000008) EXTI sources selection register 0                          */

    struct {
      __IO uint32_t EXTI0_SS   : 4;            /*!< [3..0] EXTI 0 sources selection                                           */
      __IO uint32_t EXTI1_SS   : 4;            /*!< [7..4] EXTI 1 sources selection                                           */
      __IO uint32_t EXTI2_SS   : 4;            /*!< [11..8] EXTI 2 sources selection                                          */
      __IO uint32_t EXTI3_SS   : 4;            /*!< [15..12] EXTI 3 sources selection                                         */
            uint32_t            : 16;
    } EXTISS0_b;
  } ;

  union {
    __IO uint32_t EXTISS1;                     /*!< (@ 0x0000000C) EXTI sources selection register 1                          */

    struct {
      __IO uint32_t EXTI4_SS   : 4;            /*!< [3..0] EXTI 4 sources selection                                           */
      __IO uint32_t EXTI5_SS   : 4;            /*!< [7..4] EXTI 5 sources selection                                           */
      __IO uint32_t EXTI6_SS   : 4;            /*!< [11..8] EXTI 6 sources selection                                          */
      __IO uint32_t EXTI7_SS   : 4;            /*!< [15..12] EXTI 7 sources selection                                         */
            uint32_t            : 16;
    } EXTISS1_b;
  } ;

  union {
    __IO uint32_t EXTISS2;                     /*!< (@ 0x00000010) EXTI sources selection register 2                          */

    struct {
      __IO uint32_t EXTI8_SS   : 4;            /*!< [3..0] EXTI 8 sources selection                                           */
      __IO uint32_t EXTI9_SS   : 4;            /*!< [7..4] EXTI 9 sources selection                                           */
      __IO uint32_t EXTI10_SS  : 4;            /*!< [11..8] EXTI 10 sources selection                                         */
      __IO uint32_t EXTI11_SS  : 4;            /*!< [15..12] EXTI 11 sources selection                                        */
            uint32_t            : 16;
    } EXTISS2_b;
  } ;

  union {
    __IO uint32_t EXTISS3;                     /*!< (@ 0x00000014) EXTI sources selection register 3                          */

    struct {
      __IO uint32_t EXTI12_SS  : 4;            /*!< [3..0] EXTI 12 sources selection                                          */
      __IO uint32_t EXTI13_SS  : 4;            /*!< [7..4] EXTI 13 sources selection                                          */
      __IO uint32_t EXTI14_SS  : 4;            /*!< [11..8] EXTI 14 sources selection                                         */
      __IO uint32_t EXTI15_SS  : 4;            /*!< [15..12] EXTI 15 sources selection                                        */
            uint32_t            : 16;
    } EXTISS3_b;
  } ;
  __I  uint32_t  RESERVED;

  union {
    __IO uint32_t PCF1;                        /*!< (@ 0x0000001C) AFIO port configuration register 1                         */

    struct {
            uint32_t            : 10;
      __IO uint32_t EXMC_NADV  : 1;            /*!< [10..10] EXMC_NADV connect/disconnect                                     */
            uint32_t            : 21;
    } PCF1_b;
  } ;
} AFIO_Type;                                    /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                            BKP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Backup registers (BKP)
  */

typedef struct {                                /*!< (@ 0x40006C00) BKP Structure                                              */
  __I  uint16_t  RESERVED[2];

  union {
    __IO uint16_t DATA0;                       /*!< (@ 0x00000004) Backup data register 0                                     */

