RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA0_b;
  } ;
  __I  uint16_t  RESERVED1;

  union {
    __IO uint16_t DATA1;                       /*!< (@ 0x00000008) Backup data register 1                                     */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA1_b;
  } ;
  __I  uint16_t  RESERVED2;

  union {
    __IO uint16_t DATA2;                       /*!< (@ 0x0000000C) Backup data register 2                                     */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA2_b;
  } ;
  __I  uint16_t  RESERVED3;

  union {
    __IO uint16_t DATA3;                       /*!< (@ 0x00000010) Backup data register 3                                     */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA3_b;
  } ;
  __I  uint16_t  RESERVED4;

  union {
    __IO uint16_t DATA4;                       /*!< (@ 0x00000014) Backup data register 4                                     */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA4_b;
  } ;
  __I  uint16_t  RESERVED5;

  union {
    __IO uint16_t DATA5;                       /*!< (@ 0x00000018) Backup data register 5                                     */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA5_b;
  } ;
  __I  uint16_t  RESERVED6;

  union {
    __IO uint16_t DATA6;                       /*!< (@ 0x0000001C) Backup data register 6                                     */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA6_b;
  } ;
  __I  uint16_t  RESERVED7;

  union {
    __IO uint16_t DATA7;                       /*!< (@ 0x00000020) Backup data register 7                                     */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA7_b;
  } ;
  __I  uint16_t  RESERVED8;

  union {
    __IO uint16_t DATA8;                       /*!< (@ 0x00000024) Backup data register 8                                     */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA8_b;
  } ;
  __I  uint16_t  RESERVED9;

  union {
    __IO uint16_t DATA9;                       /*!< (@ 0x00000028) Backup data register 9                                     */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA9_b;
  } ;
  __I  uint16_t  RESERVED10;

  union {
    __IO uint16_t OCTL;                        /*!< (@ 0x0000002C) RTC signal output control register                         */

    struct {
      __IO uint16_t RCCV       : 7;            /*!< [6..0] RTC clock calibration value                                        */
      __IO uint16_t COEN       : 1;            /*!< [7..7] RTC clock calibration output enable                                */
      __IO uint16_t ASOEN      : 1;            /*!< [8..8] RTC alarm or second signal output enable                           */
      __IO uint16_t ROSEL      : 1;            /*!< [9..9] RTC output selection                                               */
            uint16_t            : 6;
    } OCTL_b;
  } ;
  __I  uint16_t  RESERVED11;

  union {
    __IO uint16_t TPCTL;                       /*!< (@ 0x00000030) Tamper pin control register                                */

    struct {
      __IO uint16_t TPEN       : 1;            /*!< [0..0] TAMPER detection enable                                            */
      __IO uint16_t TPAL       : 1;            /*!< [1..1] TAMPER pin active level                                            */
            uint16_t            : 14;
    } TPCTL_b;
  } ;
  __I  uint16_t  RESERVED12;

  union {
    __IO uint16_t TPCS;                        /*!< (@ 0x00000034) Tamper control and status register                         */

    struct {
      __IO uint16_t TER        : 1;            /*!< [0..0] Tamper event reset                                                 */
      __IO uint16_t TIR        : 1;            /*!< [1..1] Tamper interrupt reset                                             */
      __IO uint16_t TPIE       : 1;            /*!< [2..2] Tamper interrupt enable                                            */
            uint16_t            : 5;
      __IO uint16_t TEF        : 1;            /*!< [8..8] Tamper event flag                                                  */
      __IO uint16_t TIF        : 1;            /*!< [9..9] Tamper interrupt flag                                              */
            uint16_t            : 6;
    } TPCS_b;
  } ;
  __I  uint16_t  RESERVED13[5];

  union {
    __IO uint16_t DATA10;                      /*!< (@ 0x00000040) Backup data register 10                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA10_b;
  } ;
  __I  uint16_t  RESERVED14;

  union {
    __IO uint16_t DATA11;                      /*!< (@ 0x00000044) Backup data register 11                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA11_b;
  } ;
  __I  uint16_t  RESERVED15;

  union {
    __IO uint16_t DATA12;                      /*!< (@ 0x00000048) Backup data register 12                                    */

