RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA12_b;
  } ;
  __I  uint16_t  RESERVED16;

  union {
    __IO uint16_t DATA13;                      /*!< (@ 0x0000004C) Backup data register 13                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA13_b;
  } ;
  __I  uint16_t  RESERVED17;

  union {
    __IO uint16_t DATA14;                      /*!< (@ 0x00000050) Backup data register 14                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA14_b;
  } ;
  __I  uint16_t  RESERVED18;

  union {
    __IO uint16_t DATA15;                      /*!< (@ 0x00000054) Backup data register 15                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA15_b;
  } ;
  __I  uint16_t  RESERVED19;

  union {
    __IO uint16_t DATA16;                      /*!< (@ 0x00000058) Backup data register 16                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA16_b;
  } ;
  __I  uint16_t  RESERVED20;

  union {
    __IO uint16_t DATA17;                      /*!< (@ 0x0000005C) Backup data register 17                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA17_b;
  } ;
  __I  uint16_t  RESERVED21;

  union {
    __IO uint16_t DATA18;                      /*!< (@ 0x00000060) Backup data register 18                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA18_b;
  } ;
  __I  uint16_t  RESERVED22;

  union {
    __IO uint16_t DATA19;                      /*!< (@ 0x00000064) Backup data register 19                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA19_b;
  } ;
  __I  uint16_t  RESERVED23;

  union {
    __IO uint16_t DATA20;                      /*!< (@ 0x00000068) Backup data register 20                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA20_b;
  } ;
  __I  uint16_t  RESERVED24;

  union {
    __IO uint16_t DATA21;                      /*!< (@ 0x0000006C) Backup data register 21                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA21_b;
  } ;
  __I  uint16_t  RESERVED25;

  union {
    __IO uint16_t DATA22;                      /*!< (@ 0x00000070) Backup data register 22                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA22_b;
  } ;
  __I  uint16_t  RESERVED26;

  union {
    __IO uint16_t DATA23;                      /*!< (@ 0x00000074) Backup data register 23                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA23_b;
  } ;
  __I  uint16_t  RESERVED27;

  union {
    __IO uint16_t DATA24;                      /*!< (@ 0x00000078) Backup data register 24                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA24_b;
  } ;
  __I  uint16_t  RESERVED28;

  union {
    __IO uint16_t DATA25;                      /*!< (@ 0x0000007C) Backup data register 25                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA25_b;
  } ;
  __I  uint16_t  RESERVED29;

  union {
    __IO uint16_t DATA26;                      /*!< (@ 0x00000080) Backup data register 26                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA26_b;
  } ;
  __I  uint16_t  RESERVED30;

  union {
    __IO uint16_t DATA27;                      /*!< (@ 0x00000084) Backup data register 27                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA27_b;
  } ;
  __I  uint16_t  RESERVED31;

  union {
    __IO uint16_t DATA28;                      /*!< (@ 0x00000088) Backup data register 28                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA28_b;
  } ;
  __I  uint16_t  RESERVED32;

  union {
    __IO uint16_t DATA29;                      /*!< (@ 0x0000008C) Backup data register 29                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA29_b;
  } ;
  __I  uint16_t  RESERVED33;

  union {
    __IO uint16_t DATA30;                      /*!< (@ 0x00000090) Backup data register 30                                    */

