RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA30_b;
  } ;
  __I  uint16_t  RESERVED34;

  union {
    __IO uint16_t DATA31;                      /*!< (@ 0x00000094) Backup data register 31                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA31_b;
  } ;
  __I  uint16_t  RESERVED35;

  union {
    __IO uint16_t DATA32;                      /*!< (@ 0x00000098) Backup data register 32                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA32_b;
  } ;
  __I  uint16_t  RESERVED36;

  union {
    __IO uint16_t DATA33;                      /*!< (@ 0x0000009C) Backup data register 33                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA33_b;
  } ;
  __I  uint16_t  RESERVED37;

  union {
    __IO uint16_t DATA34;                      /*!< (@ 0x000000A0) Backup data register 34                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA34_b;
  } ;
  __I  uint16_t  RESERVED38;

  union {
    __IO uint16_t DATA35;                      /*!< (@ 0x000000A4) Backup data register 35                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA35_b;
  } ;
  __I  uint16_t  RESERVED39;

  union {
    __IO uint16_t DATA36;                      /*!< (@ 0x000000A8) Backup data register 36                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA36_b;
  } ;
  __I  uint16_t  RESERVED40;

  union {
    __IO uint16_t DATA37;                      /*!< (@ 0x000000AC) Backup data register 37                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA37_b;
  } ;
  __I  uint16_t  RESERVED41;

  union {
    __IO uint16_t DATA38;                      /*!< (@ 0x000000B0) Backup data register 38                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA38_b;
  } ;
  __I  uint16_t  RESERVED42;

  union {
    __IO uint16_t DATA39;                      /*!< (@ 0x000000B4) Backup data register 39                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA39_b;
  } ;
  __I  uint16_t  RESERVED43;

  union {
    __IO uint16_t DATA40;                      /*!< (@ 0x000000B8) Backup data register 40                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA40_b;
  } ;
  __I  uint16_t  RESERVED44;

  union {
    __IO uint16_t DATA41;                      /*!< (@ 0x000000BC) Backup data register 41                                    */

    struct {
      __IO uint16_t DATA       : 16;           /*!< [15..0] Backup data                                                       */
    } DATA41_b;
  } ;
} BKP_Type;                                     /*!< Size = 190 (0xbe)                                                         */



/* =========================================================================================================================== */
/* ================                                           CAN0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Controller area network (CAN0)
  */

typedef struct {                                /*!< (@ 0x40006400) CAN0 Structure                                             */

  union {
    __IO uint32_t CTL;                         /*!< (@ 0x00000000) Control register                                           */

    struct {
      __IO uint32_t IWMOD      : 1;            /*!< [0..0] Initial working mode                                               */
      __IO uint32_t SLPWMOD    : 1;            /*!< [1..1] Sleep working mode                                                 */
      __IO uint32_t TFO        : 1;            /*!< [2..2] Transmit FIFO order                                                */
      __IO uint32_t RFOD       : 1;            /*!< [3..3] Receive FIFO overwrite disable                                     */
      __IO uint32_t ARD        : 1;            /*!< [4..4] Automatic retransmission disable                                   */
      __IO uint32_t AWU        : 1;            /*!< [5..5] Automatic wakeup                                                   */
      __IO uint32_t ABOR       : 1;            /*!< [6..6] Automatic bus-off recovery                                         */
      __IO uint32_t TTC        : 1;            /*!< [7..7] Time-triggered communication                                       */
            uint32_t            : 7;
      __IO uint32_t SWRST      : 1;            /*!< [15..15] Software reset                                                   */
      __IO uint32_t DFZ        : 1;            /*!< [16..16] Debug freeze                                                     */
            uint32_t            : 15;
    } CTL_b;
  } ;

  union {
    __IO uint32_t STAT;                        /*!< (@ 0x00000004) Status register                                            */

