RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __I  uint32_t IWS        : 1;            /*!< [0..0] Initial working state                                              */
      __I  uint32_t SLPWS      : 1;            /*!< [1..1] Sleep working state                                                */
      __IO uint32_t ERRIF      : 1;            /*!< [2..2] Error interrupt flag                                               */
      __IO uint32_t WUIF       : 1;            /*!< [3..3] Status change interrupt flag of wakeup  from sleep working
                                                     mode                                                                      */
      __IO uint32_t SLPIF      : 1;            /*!< [4..4] Status change interrupt flag of sleep  working mode entering       */
            uint32_t            : 3;
      __I  uint32_t TS         : 1;            /*!< [8..8] Transmitting state                                                 */
      __I  uint32_t RS         : 1;            /*!< [9..9] Receiving state                                                    */
      __I  uint32_t LASTRX     : 1;            /*!< [10..10] Last sample value of RX pin                                      */
      __I  uint32_t RXL        : 1;            /*!< [11..11] RX level                                                         */
            uint32_t            : 20;
    } STAT_b;
  } ;

  union {
    __IO uint32_t TSTAT;                       /*!< (@ 0x00000008) Transmit status register                                   */

    struct {
      __IO uint32_t MTF0       : 1;            /*!< [0..0] Mailbox 0 transmit finished                                        */
      __IO uint32_t MTFNERR0   : 1;            /*!< [1..1] Mailbox 0 transmit finished and no error                           */
      __IO uint32_t MAL0       : 1;            /*!< [2..2] Mailbox 0 arbitration lost                                         */
      __IO uint32_t MTE0       : 1;            /*!< [3..3] Mailbox 0 transmit error                                           */
            uint32_t            : 3;
      __IO uint32_t MST0       : 1;            /*!< [7..7] Mailbox 0 stop transmitting                                        */
      __IO uint32_t MTF1       : 1;            /*!< [8..8] Mailbox 1 transmit finished                                        */
      __IO uint32_t MTFNERR1   : 1;            /*!< [9..9] Mailbox 1 transmit finished and no error                           */
      __IO uint32_t MAL1       : 1;            /*!< [10..10] Mailbox 1 arbitration lost                                       */
      __IO uint32_t MTE1       : 1;            /*!< [11..11] Mailbox 1 transmit error                                         */
            uint32_t            : 3;
      __IO uint32_t MST1       : 1;            /*!< [15..15] Mailbox 1 stop transmitting                                      */
      __IO uint32_t MTF2       : 1;            /*!< [16..16] Mailbox 2 transmit finished                                      */
      __IO uint32_t MTFNERR2   : 1;            /*!< [17..17] Mailbox 2 transmit finished and no error                         */
      __IO uint32_t MAL2       : 1;            /*!< [18..18] Mailbox 2 arbitration lost                                       */
      __IO uint32_t MTE2       : 1;            /*!< [19..19] Mailbox 2 transmit error                                         */
            uint32_t            : 3;
      __IO uint32_t MST2       : 1;            /*!< [23..23] Mailbox 2 stop transmitting                                      */
      __I  uint32_t NUM        : 2;            /*!< [25..24] number of the transmit FIFO mailbox in  which the frame
                                                     will be transmitted if at least one mailbox is empty                      */
      __I  uint32_t TME0       : 1;            /*!< [26..26] Transmit mailbox 0 empty                                         */
      __I  uint32_t TME1       : 1;            /*!< [27..27] Transmit mailbox 1 empty                                         */
      __I  uint32_t TME2       : 1;            /*!< [28..28] Transmit mailbox 2 empty                                         */
      __I  uint32_t TMLS0      : 1;            /*!< [29..29] Transmit mailbox 0 last sending  in transmit FIFO                */
      __I  uint32_t TMLS1      : 1;            /*!< [30..30] Transmit mailbox 1 last sending  in transmit FIFO                */
      __I  uint32_t TMLS2      : 1;            /*!< [31..31] Transmit mailbox 2 last sending  in transmit FIFO                */
    } TSTAT_b;
  } ;

  union {
    __IO uint32_t RFIFO0;                      /*!< (@ 0x0000000C) Receive message FIFO0 register                             */

    struct {
      __I  uint32_t RFL0       : 2;            /*!< [1..0] Receive FIFO0 length                                               */
            uint32_t            : 1;
      __IO uint32_t RFF0       : 1;            /*!< [3..3] Receive FIFO0 full                                                 */
      __IO uint32_t RFO0       : 1;            /*!< [4..4] Receive FIFO0 overfull                                             */
      __IO uint32_t RFD0       : 1;            /*!< [5..5] Receive FIFO0 dequeue                                              */
            uint32_t            : 26;
    } RFIFO0_b;
  } ;

  union {
    __IO uint32_t RFIFO1;                      /*!< (@ 0x00000010) Receive message FIFO1 register                             */

    struct {
      __I  uint32_t RFL1       : 2;            /*!< [1..0] Receive FIFO1 length                                               */
            uint32_t            : 1;
      __IO uint32_t RFF1       : 1;            /*!< [3..3] Receive FIFO1 full                                                 */
      __IO uint32_t RFO1       : 1;            /*!< [4..4] Receive FIFO1 overfull                                             */
      __IO uint32_t RFD1       : 1;            /*!< [5..5] Receive FIFO1 dequeue                                              */
            uint32_t            : 26;
    } RFIFO1_b;
  } ;

  union {
    __IO uint32_t INTEN;                       /*!< (@ 0x00000014) Interrupt enable register                                  */

