RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t TMEIE      : 1;            /*!< [0..0] Transmit mailbox empty interrupt enable                            */
      __IO uint32_t RFNEIE0    : 1;            /*!< [1..1] Receive FIFO0 not empty interrupt enable                           */
      __IO uint32_t RFFIE0     : 1;            /*!< [2..2] Receive FIFO0 full interrupt enable                                */
      __IO uint32_t RFOIE0     : 1;            /*!< [3..3] Receive FIFO0 overfull interrupt enable                            */
      __IO uint32_t RFNEIE1    : 1;            /*!< [4..4] Receive FIFO1 not empty interrupt enable                           */
      __IO uint32_t RFFIE1     : 1;            /*!< [5..5] Receive FIFO1 full interrupt enable                                */
      __IO uint32_t RFOIE1     : 1;            /*!< [6..6] Receive FIFO1 overfull interrupt enable                            */
            uint32_t            : 1;
      __IO uint32_t WERRIE     : 1;            /*!< [8..8] Warning error interrupt enable                                     */
      __IO uint32_t PERRIE     : 1;            /*!< [9..9] Passive error interrupt enable                                     */
      __IO uint32_t BOIE       : 1;            /*!< [10..10] Bus-off interrupt enable                                         */
      __IO uint32_t ERRNIE     : 1;            /*!< [11..11] Error number interrupt enable                                    */
            uint32_t            : 3;
      __IO uint32_t ERRIE      : 1;            /*!< [15..15] Error interrupt enable                                           */
      __IO uint32_t WIE        : 1;            /*!< [16..16] Wakeup interrupt enable                                          */
      __IO uint32_t SLPWIE     : 1;            /*!< [17..17] Sleep working interrupt enable                                   */
            uint32_t            : 14;
    } INTEN_b;
  } ;

  union {
    __IO uint32_t ERR;                         /*!< (@ 0x00000018) Error register                                             */

    struct {
      __I  uint32_t WERR       : 1;            /*!< [0..0] Warning error                                                      */
      __I  uint32_t PERR       : 1;            /*!< [1..1] Passive error                                                      */
      __I  uint32_t BOERR      : 1;            /*!< [2..2] Bus-off error                                                      */
            uint32_t            : 1;
      __IO uint32_t ERRN       : 3;            /*!< [6..4] Error number                                                       */
            uint32_t            : 9;
      __I  uint32_t TECNT      : 8;            /*!< [23..16] Transmit Error Count defined  by the CAN standard                */
      __I  uint32_t RECNT      : 8;            /*!< [31..24] Receive Error Count defined  by the CAN standard                 */
    } ERR_b;
  } ;

  union {
    __IO uint32_t BT;                          /*!< (@ 0x0000001C) Bit timing register                                        */

    struct {
      __IO uint32_t BAUDPSC    : 10;           /*!< [9..0] Baud rate prescaler                                                */
            uint32_t            : 6;
      __IO uint32_t BS1        : 4;            /*!< [19..16] Bit segment 1                                                    */
      __IO uint32_t BS2        : 3;            /*!< [22..20] Bit segment 2                                                    */
            uint32_t            : 1;
      __IO uint32_t SJW        : 2;            /*!< [25..24] Resynchronization jump width                                     */
            uint32_t            : 4;
      __IO uint32_t LCMOD      : 1;            /*!< [30..30] Loopback communication mode                                      */
      __IO uint32_t SCMOD      : 1;            /*!< [31..31] Silent communication mode                                        */
    } BT_b;
  } ;
  __I  uint32_t  RESERVED[88];

  union {
    __IO uint32_t TMI0;                        /*!< (@ 0x00000180) Transmit mailbox identifier register 0                     */

    struct {
      __IO uint32_t TEN        : 1;            /*!< [0..0] Transmit enable                                                    */
      __IO uint32_t FT         : 1;            /*!< [1..1] Frame type                                                         */
      __IO uint32_t FF         : 1;            /*!< [2..2] Frame format                                                       */
      __IO uint32_t EFID       : 18;           /*!< [20..3] The frame identifier                                              */
      __IO uint32_t SFID_EFID  : 11;           /*!< [31..21] The frame identifier                                             */
    } TMI0_b;
  } ;

  union {
    __IO uint32_t TMP0;                        /*!< (@ 0x00000184) Transmit mailbox property register 0                       */

    struct {
      __IO uint32_t DLENC      : 4;            /*!< [3..0] Data length code                                                   */
            uint32_t            : 4;
      __IO uint32_t TSEN       : 1;            /*!< [8..8] Time stamp enable                                                  */
            uint32_t            : 7;
      __IO uint32_t TS         : 16;           /*!< [31..16] Time stamp                                                       */
    } TMP0_b;
  } ;

  union {
    __IO uint32_t TMDATA00;                    /*!< (@ 0x00000188) Transmit mailbox data0 register                            */

    struct {
      __IO uint32_t DB0        : 8;            /*!< [7..0] Data byte 0                                                        */
      __IO uint32_t DB1        : 8;            /*!< [15..8] Data byte 1                                                       */
      __IO uint32_t DB2        : 8;            /*!< [23..16] Data byte 2                                                      */
      __IO uint32_t DB3        : 8;            /*!< [31..24] Data byte 3                                                      */
    } TMDATA00_b;
  } ;

  union {
    __IO uint32_t TMDATA10;                    /*!< (@ 0x0000018C) Transmit mailbox data1 register                            */

