RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t DB4        : 8;            /*!< [7..0] Data byte 4                                                        */
      __IO uint32_t DB5        : 8;            /*!< [15..8] Data byte 5                                                       */
      __IO uint32_t DB6        : 8;            /*!< [23..16] Data byte 6                                                      */
      __IO uint32_t DB7        : 8;            /*!< [31..24] Data byte 7                                                      */
    } TMDATA10_b;
  } ;

  union {
    __IO uint32_t TMI1;                        /*!< (@ 0x00000190) Transmit mailbox identifier register 1                     */

    struct {
      __IO uint32_t TEN        : 1;            /*!< [0..0] Transmit enable                                                    */
      __IO uint32_t FT         : 1;            /*!< [1..1] Frame type                                                         */
      __IO uint32_t FF         : 1;            /*!< [2..2] Frame format                                                       */
      __IO uint32_t EFID       : 18;           /*!< [20..3] The frame identifier                                              */
      __IO uint32_t SFID_EFID  : 11;           /*!< [31..21] The frame identifier                                             */
    } TMI1_b;
  } ;

  union {
    __IO uint32_t TMP1;                        /*!< (@ 0x00000194) Transmit mailbox property register 1                       */

    struct {
      __IO uint32_t DLENC      : 4;            /*!< [3..0] Data length code                                                   */
            uint32_t            : 4;
      __IO uint32_t TSEN       : 1;            /*!< [8..8] Time stamp enable                                                  */
            uint32_t            : 7;
      __IO uint32_t TS         : 16;           /*!< [31..16] Time stamp                                                       */
    } TMP1_b;
  } ;

  union {
    __IO uint32_t TMDATA01;                    /*!< (@ 0x00000198) Transmit mailbox data0 register                            */

    struct {
      __IO uint32_t DB0        : 8;            /*!< [7..0] Data byte 0                                                        */
      __IO uint32_t DB1        : 8;            /*!< [15..8] Data byte 1                                                       */
      __IO uint32_t DB2        : 8;            /*!< [23..16] Data byte 2                                                      */
      __IO uint32_t DB3        : 8;            /*!< [31..24] Data byte 3                                                      */
    } TMDATA01_b;
  } ;

  union {
    __IO uint32_t TMDATA11;                    /*!< (@ 0x0000019C) Transmit mailbox data1 register                            */

    struct {
      __IO uint32_t DB4        : 8;            /*!< [7..0] Data byte 4                                                        */
      __IO uint32_t DB5        : 8;            /*!< [15..8] Data byte 5                                                       */
      __IO uint32_t DB6        : 8;            /*!< [23..16] Data byte 6                                                      */
      __IO uint32_t DB7        : 8;            /*!< [31..24] Data byte 7                                                      */
    } TMDATA11_b;
  } ;

  union {
    __IO uint32_t TMI2;                        /*!< (@ 0x000001A0) Transmit mailbox identifier register 2                     */

    struct {
      __IO uint32_t TEN        : 1;            /*!< [0..0] Transmit enable                                                    */
      __IO uint32_t FT         : 1;            /*!< [1..1] Frame type                                                         */
      __IO uint32_t FF         : 1;            /*!< [2..2] Frame format                                                       */
      __IO uint32_t EFID       : 18;           /*!< [20..3] The frame identifier                                              */
      __IO uint32_t SFID_EFID  : 11;           /*!< [31..21] The frame identifier                                             */
    } TMI2_b;
  } ;

  union {
    __IO uint32_t TMP2;                        /*!< (@ 0x000001A4) Transmit mailbox property register 2                       */

    struct {
      __IO uint32_t DLENC      : 4;            /*!< [3..0] Data length code                                                   */
            uint32_t            : 4;
      __IO uint32_t TSEN       : 1;            /*!< [8..8] Time stamp enable                                                  */
            uint32_t            : 7;
      __IO uint32_t TS         : 16;           /*!< [31..16] Time stamp                                                       */
    } TMP2_b;
  } ;

  union {
    __IO uint32_t TMDATA02;                    /*!< (@ 0x000001A8) Transmit mailbox data0 register                            */

    struct {
      __IO uint32_t DB0        : 8;            /*!< [7..0] Data byte 0                                                        */
      __IO uint32_t DB1        : 8;            /*!< [15..8] Data byte 1                                                       */
      __IO uint32_t DB2        : 8;            /*!< [23..16] Data byte 2                                                      */
      __IO uint32_t DB3        : 8;            /*!< [31..24] Data byte 3                                                      */
    } TMDATA02_b;
  } ;

  union {
    __IO uint32_t TMDATA12;                    /*!< (@ 0x000001AC) Transmit mailbox data1 register                            */

    struct {
      __IO uint32_t DB4        : 8;            /*!< [7..0] Data byte 4                                                        */
      __IO uint32_t DB5        : 8;            /*!< [15..8] Data byte 5                                                       */
      __IO uint32_t DB6        : 8;            /*!< [23..16] Data byte 6                                                      */
      __IO uint32_t DB7        : 8;            /*!< [31..24] Data byte 7                                                      */
    } TMDATA12_b;
  } ;

  union {
    __I  uint32_t RFIFOMI0;                    /*!< (@ 0x000001B0) Receive FIFO mailbox identifier register                   */

