RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
            uint32_t            : 1;
      __I  uint32_t FT         : 1;            /*!< [1..1] Frame type                                                         */
      __I  uint32_t FF         : 1;            /*!< [2..2] Frame format                                                       */
      __I  uint32_t EFID       : 18;           /*!< [20..3] The frame identifier                                              */
      __I  uint32_t SFID_EFID  : 11;           /*!< [31..21] The frame identifier                                             */
    } RFIFOMI0_b;
  } ;

  union {
    __I  uint32_t RFIFOMP0;                    /*!< (@ 0x000001B4) Receive FIFO0 mailbox property register                    */

    struct {
      __I  uint32_t DLENC      : 4;            /*!< [3..0] Data length code                                                   */
            uint32_t            : 4;
      __I  uint32_t FI         : 8;            /*!< [15..8] Filtering index                                                   */
      __I  uint32_t TS         : 16;           /*!< [31..16] Time stamp                                                       */
    } RFIFOMP0_b;
  } ;

  union {
    __I  uint32_t RFIFOMDATA00;                /*!< (@ 0x000001B8) Receive FIFO0 mailbox data0 register                       */

    struct {
      __I  uint32_t DB0        : 8;            /*!< [7..0] Data byte 0                                                        */
      __I  uint32_t DB1        : 8;            /*!< [15..8] Data byte 1                                                       */
      __I  uint32_t DB2        : 8;            /*!< [23..16] Data byte 2                                                      */
      __I  uint32_t DB3        : 8;            /*!< [31..24] Data byte 3                                                      */
    } RFIFOMDATA00_b;
  } ;

  union {
    __I  uint32_t RFIFOMDATA10;                /*!< (@ 0x000001BC) Receive FIFO0 mailbox data1 register                       */

    struct {
      __I  uint32_t DB4        : 8;            /*!< [7..0] Data byte 4                                                        */
      __I  uint32_t DB5        : 8;            /*!< [15..8] Data byte 5                                                       */
      __I  uint32_t DB6        : 8;            /*!< [23..16] Data byte 6                                                      */
      __I  uint32_t DB7        : 8;            /*!< [31..24] Data byte 7                                                      */
    } RFIFOMDATA10_b;
  } ;

  union {
    __I  uint32_t RFIFOMI1;                    /*!< (@ 0x000001C0) Receive FIFO1 mailbox identifier register                  */

    struct {
            uint32_t            : 1;
      __I  uint32_t FT         : 1;            /*!< [1..1] Frame type                                                         */
      __I  uint32_t FF         : 1;            /*!< [2..2] Frame format                                                       */
      __I  uint32_t EFID       : 18;           /*!< [20..3] The frame identifier                                              */
      __I  uint32_t SFID_EFID  : 11;           /*!< [31..21] The frame identifier                                             */
    } RFIFOMI1_b;
  } ;

  union {
    __I  uint32_t RFIFOMP1;                    /*!< (@ 0x000001C4) Receive FIFO1 mailbox property register                    */

    struct {
      __I  uint32_t DLENC      : 4;            /*!< [3..0] Data length code                                                   */
            uint32_t            : 4;
      __I  uint32_t FI         : 8;            /*!< [15..8] Filtering index                                                   */
      __I  uint32_t TS         : 16;           /*!< [31..16] Time stamp                                                       */
    } RFIFOMP1_b;
  } ;

  union {
    __I  uint32_t RFIFOMDATA01;                /*!< (@ 0x000001C8) Receive FIFO1 mailbox data0 register                       */

    struct {
      __I  uint32_t DB0        : 8;            /*!< [7..0] Data byte 0                                                        */
      __I  uint32_t DB1        : 8;            /*!< [15..8] Data byte 1                                                       */
      __I  uint32_t DB2        : 8;            /*!< [23..16] Data byte 2                                                      */
      __I  uint32_t DB3        : 8;            /*!< [31..24] Data byte 3                                                      */
    } RFIFOMDATA01_b;
  } ;

  union {
    __I  uint32_t RFIFOMDATA11;                /*!< (@ 0x000001CC) Receive FIFO1 mailbox data1 register                       */

    struct {
      __I  uint32_t DB4        : 8;            /*!< [7..0] Data byte 4                                                        */
      __I  uint32_t DB5        : 8;            /*!< [15..8] Data byte 5                                                       */
      __I  uint32_t DB6        : 8;            /*!< [23..16] Data byte 6                                                      */
      __I  uint32_t DB7        : 8;            /*!< [31..24] Data byte 7                                                      */
    } RFIFOMDATA11_b;
  } ;
  __I  uint32_t  RESERVED1[12];

  union {
    __IO uint32_t FCTL;                        /*!< (@ 0x00000200) Filter control register                                    */

    struct {
      __IO uint32_t FLD        : 1;            /*!< [0..0] Filter lock disable                                                */
            uint32_t            : 7;
      __IO uint32_t HBC1F      : 6;            /*!< [13..8] Header bank of CAN1 filter                                        */
            uint32_t            : 18;
    } FCTL_b;
  } ;

  union {
    __IO uint32_t FMCFG;                       /*!< (@ 0x00000204) Filter mode configuration register                         */

    struct {
      __IO uint32_t FMOD0      : 1;            /*!< [0..0] Filter mode                                                        */
      __IO uint32_t FMOD1      : 1;            /*!< [1..1] Filter mode                                                        */
      __IO uint32_t FMOD2      : 1;            /*!< [2..2] Filter mode                                                        */
      __IO uint32_t FMOD3      : 1;            /*!< [3..3] Filter mode                                                        */
      __IO uint32_t FMOD4      : 1;            /*!< [4..4] Filter mode                                                        */
      __IO uint32_t FMOD5      : 1;            /*!< [5..5] Filter mode                                                        */
      __IO uint32_t FMOD6      : 1;            /*!< [6..6] Filter mode                                                        */
      __IO uint32_t FMOD7      : 1;            /*!< [7..7] Filter mode                                                        */
      __IO uint32_t FMOD8      : 1;            /*!< [8..8] Filter mode                                                        */
      __IO uint32_t FMOD9      : 1;            /*!< [9..9] Filter mode                                                        */
      __IO uint32_t FMOD10     : 1;            /*!< [10..10] Filter mode                                                      */
      __IO uint32_t FMOD11     : 1;            /*!< [11..11] Filter mode                                                      */
      __IO uint32_t FMOD12     : 1;            /*!< [12..12] Filter mode                                                      */
      __IO uint32_t FMOD13     : 1;            /*!< [13..13] Filter mode                                                      */
      __IO uint32_t FMOD14     : 1;            /*!< [14..14] Filter mode                                                      */
      __IO uint32_t FMOD15     : 1;            /*!< [15..15] Filter mode                                                      */
      __IO uint32_t FMOD16     : 1;            /*!< [16..16] Filter mode                                                      */
      __IO uint32_t FMOD17     : 1;            /*!< [17..17] Filter mode                                                      */
      __IO uint32_t FMOD18     : 1;            /*!< [18..18] Filter mode                                                      */
      __IO uint32_t FMOD19     : 1;            /*!< [19..19] Filter mode                                                      */
      __IO uint32_t FMOD20     : 1;            /*!< [20..20] Filter mode                                                      */
      __IO uint32_t FMOD21     : 1;            /*!< [21..21] Filter mode                                                      */
      __IO uint32_t FMOD22     : 1;            /*!< [22..22] Filter mode                                                      */
      __IO uint32_t FMOD23     : 1;            /*!< [23..23] Filter mode                                                      */
      __IO uint32_t FMOD24     : 1;            /*!< [24..24] Filter mode                                                      */
      __IO uint32_t FMOD25     : 1;            /*!< [25..25] Filter mode                                                      */
      __IO uint32_t FMOD26     : 1;            /*!< [26..26] Filter mode                                                      */
      __IO uint32_t FMOD27     : 1;            /*!< [27..27] Filter mode                                                      */
            uint32_t            : 4;
    } FMCFG_b;
  } ;
  __I  uint32_t  RESERVED2;

  union {
    __IO uint32_t FSCFG;                       /*!< (@ 0x0000020C) Filter scale configuration register                        */

