RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t FS0        : 1;            /*!< [0..0] Filter scale configuration                                         */
      __IO uint32_t FS1        : 1;            /*!< [1..1] Filter scale configuration                                         */
      __IO uint32_t FS2        : 1;            /*!< [2..2] Filter scale configuration                                         */
      __IO uint32_t FS3        : 1;            /*!< [3..3] Filter scale configuration                                         */
      __IO uint32_t FS4        : 1;            /*!< [4..4] Filter scale configuration                                         */
      __IO uint32_t FS5        : 1;            /*!< [5..5] Filter scale configuration                                         */
      __IO uint32_t FS6        : 1;            /*!< [6..6] Filter scale configuration                                         */
      __IO uint32_t FS7        : 1;            /*!< [7..7] Filter scale configuration                                         */
      __IO uint32_t FS8        : 1;            /*!< [8..8] Filter scale configuration                                         */
      __IO uint32_t FS9        : 1;            /*!< [9..9] Filter scale configuration                                         */
      __IO uint32_t FS10       : 1;            /*!< [10..10] Filter scale configuration                                       */
      __IO uint32_t FS11       : 1;            /*!< [11..11] Filter scale configuration                                       */
      __IO uint32_t FS12       : 1;            /*!< [12..12] Filter scale configuration                                       */
      __IO uint32_t FS13       : 1;            /*!< [13..13] Filter scale configuration                                       */
      __IO uint32_t FS14       : 1;            /*!< [14..14] Filter scale configuration                                       */
      __IO uint32_t FS15       : 1;            /*!< [15..15] Filter scale configuration                                       */
      __IO uint32_t FS16       : 1;            /*!< [16..16] Filter scale configuration                                       */
      __IO uint32_t FS17       : 1;            /*!< [17..17] Filter scale configuration                                       */
      __IO uint32_t FS18       : 1;            /*!< [18..18] Filter scale configuration                                       */
      __IO uint32_t FS19       : 1;            /*!< [19..19] Filter scale configuration                                       */
      __IO uint32_t FS20       : 1;            /*!< [20..20] Filter scale configuration                                       */
      __IO uint32_t FS21       : 1;            /*!< [21..21] Filter scale configuration                                       */
      __IO uint32_t FS22       : 1;            /*!< [22..22] Filter scale configuration                                       */
      __IO uint32_t FS23       : 1;            /*!< [23..23] Filter scale configuration                                       */
      __IO uint32_t FS24       : 1;            /*!< [24..24] Filter scale configuration                                       */
      __IO uint32_t FS25       : 1;            /*!< [25..25] Filter scale configuration                                       */
      __IO uint32_t FS26       : 1;            /*!< [26..26] Filter scale configuration                                       */
      __IO uint32_t FS27       : 1;            /*!< [27..27] Filter scale configuration                                       */
            uint32_t            : 4;
    } FSCFG_b;
  } ;
  __I  uint32_t  RESERVED3;

  union {
    __IO uint32_t FAFIFO;                      /*!< (@ 0x00000214) Filter associated FIFO register                            */

    struct {
      __IO uint32_t FAF0       : 1;            /*!< [0..0] Filter 0 associated with FIFO                                      */
      __IO uint32_t FAF1       : 1;            /*!< [1..1] Filter 1 associated with FIFO                                      */
      __IO uint32_t FAF2       : 1;            /*!< [2..2] Filter 2 associated with FIFO                                      */
      __IO uint32_t FAF3       : 1;            /*!< [3..3] Filter 3 associated with FIFO                                      */
      __IO uint32_t FAF4       : 1;            /*!< [4..4] Filter 4 associated with FIFO                                      */
      __IO uint32_t FAF5       : 1;            /*!< [5..5] Filter 5 associated with FIFO                                      */
      __IO uint32_t FAF6       : 1;            /*!< [6..6] Filter 6 associated with FIFO                                      */
      __IO uint32_t FAF7       : 1;            /*!< [7..7] Filter 7 associated with FIFO                                      */
      __IO uint32_t FAF8       : 1;            /*!< [8..8] Filter 8 associated with FIFO                                      */
      __IO uint32_t FAF9       : 1;            /*!< [9..9] Filter 9 associated with FIFO                                      */
      __IO uint32_t FAF10      : 1;            /*!< [10..10] Filter 10 associated with FIFO                                   */
      __IO uint32_t FAF11      : 1;            /*!< [11..11] Filter 11 associated with FIFO                                   */
      __IO uint32_t FAF12      : 1;            /*!< [12..12] Filter 12 associated with FIFO                                   */
      __IO uint32_t FAF13      : 1;            /*!< [13..13] Filter 13 associated with FIFO                                   */
      __IO uint32_t FAF14      : 1;            /*!< [14..14] Filter 14 associated with FIFO                                   */
      __IO uint32_t FAF15      : 1;            /*!< [15..15] Filter 15 associated with FIFO                                   */
      __IO uint32_t FAF16      : 1;            /*!< [16..16] Filter 16 associated with FIFO                                   */
      __IO uint32_t FAF17      : 1;            /*!< [17..17] Filter 17 associated with FIFO                                   */
      __IO uint32_t FAF18      : 1;            /*!< [18..18] Filter 18 associated with FIFO                                   */
      __IO uint32_t FAF19      : 1;            /*!< [19..19] Filter 19 associated with FIFO                                   */
      __IO uint32_t FAF20      : 1;            /*!< [20..20] Filter 20 associated with FIFO                                   */
      __IO uint32_t FAF21      : 1;            /*!< [21..21] Filter 21 associated with FIFO                                   */
      __IO uint32_t FAF22      : 1;            /*!< [22..22] Filter 22 associated with FIFO                                   */
      __IO uint32_t FAF23      : 1;            /*!< [23..23] Filter 23 associated with FIFO                                   */
      __IO uint32_t FAF24      : 1;            /*!< [24..24] Filter 24 associated with FIFO                                   */
      __IO uint32_t FAF25      : 1;            /*!< [25..25] Filter 25 associated with FIFO                                   */
      __IO uint32_t FAF26      : 1;            /*!< [26..26] Filter 26 associated with FIFO                                   */
      __IO uint32_t FAF27      : 1;            /*!< [27..27] Filter 27 associated with FIFO                                   */
            uint32_t            : 4;
    } FAFIFO_b;
  } ;
  __I  uint32_t  RESERVED4;

  union {
    __IO uint32_t FW;                          /*!< (@ 0x0000021C) Filter working register                                    */

