RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t FW0        : 1;            /*!< [0..0] Filter working                                                     */
      __IO uint32_t FW1        : 1;            /*!< [1..1] Filter working                                                     */
      __IO uint32_t FW2        : 1;            /*!< [2..2] Filter working                                                     */
      __IO uint32_t FW3        : 1;            /*!< [3..3] Filter working                                                     */
      __IO uint32_t FW4        : 1;            /*!< [4..4] Filter working                                                     */
      __IO uint32_t FW5        : 1;            /*!< [5..5] Filter working                                                     */
      __IO uint32_t FW6        : 1;            /*!< [6..6] Filter working                                                     */
      __IO uint32_t FW7        : 1;            /*!< [7..7] Filter working                                                     */
      __IO uint32_t FW8        : 1;            /*!< [8..8] Filter working                                                     */
      __IO uint32_t FW9        : 1;            /*!< [9..9] Filter working                                                     */
      __IO uint32_t FW10       : 1;            /*!< [10..10] Filter working                                                   */
      __IO uint32_t FW11       : 1;            /*!< [11..11] Filter working                                                   */
      __IO uint32_t FW12       : 1;            /*!< [12..12] Filter working                                                   */
      __IO uint32_t FW13       : 1;            /*!< [13..13] Filter working                                                   */
      __IO uint32_t FW14       : 1;            /*!< [14..14] Filter working                                                   */
      __IO uint32_t FW15       : 1;            /*!< [15..15] Filter working                                                   */
      __IO uint32_t FW16       : 1;            /*!< [16..16] Filter working                                                   */
      __IO uint32_t FW17       : 1;            /*!< [17..17] Filter working                                                   */
      __IO uint32_t FW18       : 1;            /*!< [18..18] Filter working                                                   */
      __IO uint32_t FW19       : 1;            /*!< [19..19] Filter working                                                   */
      __IO uint32_t FW20       : 1;            /*!< [20..20] Filter working                                                   */
      __IO uint32_t FW21       : 1;            /*!< [21..21] Filter working                                                   */
      __IO uint32_t FW22       : 1;            /*!< [22..22] Filter working                                                   */
      __IO uint32_t FW23       : 1;            /*!< [23..23] Filter working                                                   */
      __IO uint32_t FW24       : 1;            /*!< [24..24] Filter working                                                   */
      __IO uint32_t FW25       : 1;            /*!< [25..25] Filter working                                                   */
      __IO uint32_t FW26       : 1;            /*!< [26..26] Filter working                                                   */
      __IO uint32_t FW27       : 1;            /*!< [27..27] Filter working                                                   */
            uint32_t            : 4;
    } FW_b;
  } ;
  __I  uint32_t  RESERVED5[8];

  union {
    __IO uint32_t F0DATA0;                     /*!< (@ 0x00000240) Filter 0 data 0 register                                   */

    struct {
      __IO uint32_t FD0        : 1;            /*!< [0..0] Filter bits                                                        */
      __IO uint32_t FD1        : 1;            /*!< [1..1] Filter bits                                                        */
      __IO uint32_t FD2        : 1;            /*!< [2..2] Filter bits                                                        */
      __IO uint32_t FD3        : 1;            /*!< [3..3] Filter bits                                                        */
      __IO uint32_t FD4        : 1;            /*!< [4..4] Filter bits                                                        */
      __IO uint32_t FD5        : 1;            /*!< [5..5] Filter bits                                                        */
      __IO uint32_t FD6        : 1;            /*!< [6..6] Filter bits                                                        */
      __IO uint32_t FD7        : 1;            /*!< [7..7] Filter bits                                                        */
      __IO uint32_t FD8        : 1;            /*!< [8..8] Filter bits                                                        */
      __IO uint32_t FD9        : 1;            /*!< [9..9] Filter bits                                                        */
      __IO uint32_t FD10       : 1;            /*!< [10..10] Filter bits                                                      */
      __IO uint32_t FD11       : 1;            /*!< [11..11] Filter bits                                                      */
      __IO uint32_t FD12       : 1;            /*!< [12..12] Filter bits                                                      */
      __IO uint32_t FD13       : 1;            /*!< [13..13] Filter bits                                                      */
      __IO uint32_t FD14       : 1;            /*!< [14..14] Filter bits                                                      */
      __IO uint32_t FD15       : 1;            /*!< [15..15] Filter bits                                                      */
      __IO uint32_t FD16       : 1;            /*!< [16..16] Filter bits                                                      */
      __IO uint32_t FD17       : 1;            /*!< [17..17] Filter bits                                                      */
      __IO uint32_t FD18       : 1;            /*!< [18..18] Filter bits                                                      */
      __IO uint32_t FD19       : 1;            /*!< [19..19] Filter bits                                                      */
      __IO uint32_t FD20       : 1;            /*!< [20..20] Filter bits                                                      */
      __IO uint32_t FD21       : 1;            /*!< [21..21] Filter bits                                                      */
      __IO uint32_t FD22       : 1;            /*!< [22..22] Filter bits                                                      */
      __IO uint32_t FD23       : 1;            /*!< [23..23] Filter bits                                                      */
      __IO uint32_t FD24       : 1;            /*!< [24..24] Filter bits                                                      */
      __IO uint32_t FD25       : 1;            /*!< [25..25] Filter bits                                                      */
      __IO uint32_t FD26       : 1;            /*!< [26..26] Filter bits                                                      */
      __IO uint32_t FD27       : 1;            /*!< [27..27] Filter bits                                                      */
      __IO uint32_t FD28       : 1;            /*!< [28..28] Filter bits                                                      */
      __IO uint32_t FD29       : 1;            /*!< [29..29] Filter bits                                                      */
      __IO uint32_t FD30       : 1;            /*!< [30..30] Filter bits                                                      */
      __IO uint32_t FD31       : 1;            /*!< [31..31] Filter bits                                                      */
    } F0DATA0_b;
  } ;

  union {
    __IO uint32_t F0DATA1;                     /*!< (@ 0x00000244) Filter 0 data 1 register                                   */

