RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t FD0        : 1;            /*!< [0..0] Filter bits                                                        */
      __IO uint32_t FD1        : 1;            /*!< [1..1] Filter bits                                                        */
      __IO uint32_t FD2        : 1;            /*!< [2..2] Filter bits                                                        */
      __IO uint32_t FD3        : 1;            /*!< [3..3] Filter bits                                                        */
      __IO uint32_t FD4        : 1;            /*!< [4..4] Filter bits                                                        */
      __IO uint32_t FD5        : 1;            /*!< [5..5] Filter bits                                                        */
      __IO uint32_t FD6        : 1;            /*!< [6..6] Filter bits                                                        */
      __IO uint32_t FD7        : 1;            /*!< [7..7] Filter bits                                                        */
      __IO uint32_t FD8        : 1;            /*!< [8..8] Filter bits                                                        */
      __IO uint32_t FD9        : 1;            /*!< [9..9] Filter bits                                                        */
      __IO uint32_t FD10       : 1;            /*!< [10..10] Filter bits                                                      */
      __IO uint32_t FD11       : 1;            /*!< [11..11] Filter bits                                                      */
      __IO uint32_t FD12       : 1;            /*!< [12..12] Filter bits                                                      */
      __IO uint32_t FD13       : 1;            /*!< [13..13] Filter bits                                                      */
      __IO uint32_t FD14       : 1;            /*!< [14..14] Filter bits                                                      */
      __IO uint32_t FD15       : 1;            /*!< [15..15] Filter bits                                                      */
      __IO uint32_t FD16       : 1;            /*!< [16..16] Filter bits                                                      */
      __IO uint32_t FD17       : 1;            /*!< [17..17] Filter bits                                                      */
      __IO uint32_t FD18       : 1;            /*!< [18..18] Filter bits                                                      */
      __IO uint32_t FD19       : 1;            /*!< [19..19] Filter bits                                                      */
      __IO uint32_t FD20       : 1;            /*!< [20..20] Filter bits                                                      */
      __IO uint32_t FD21       : 1;            /*!< [21..21] Filter bits                                                      */
      __IO uint32_t FD22       : 1;            /*!< [22..22] Filter bits                                                      */
      __IO uint32_t FD23       : 1;            /*!< [23..23] Filter bits                                                      */
      __IO uint32_t FD24       : 1;            /*!< [24..24] Filter bits                                                      */
      __IO uint32_t FD25       : 1;            /*!< [25..25] Filter bits                                                      */
      __IO uint32_t FD26       : 1;            /*!< [26..26] Filter bits                                                      */
      __IO uint32_t FD27       : 1;            /*!< [27..27] Filter bits                                                      */
      __IO uint32_t FD28       : 1;            /*!< [28..28] Filter bits                                                      */
      __IO uint32_t FD29       : 1;            /*!< [29..29] Filter bits                                                      */
      __IO uint32_t FD30       : 1;            /*!< [30..30] Filter bits                                                      */
      __IO uint32_t FD31       : 1;            /*!< [31..31] Filter bits                                                      */
    } F27DATA1_b;
  } ;
} CAN0_Type;                                    /*!< Size = 800 (0x320)                                                        */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief cyclic redundancy check calculation unit (CRC)
  */

typedef struct {                                /*!< (@ 0x40023000) CRC Structure                                              */

  union {
    __IO uint32_t DATA;                        /*!< (@ 0x00000000) Data register                                              */

    struct {
      __IO uint32_t DATA       : 32;           /*!< [31..0] CRC calculation result bits                                       */
    } DATA_b;
  } ;

  union {
    __IO uint32_t FDATA;                       /*!< (@ 0x00000004) Free data register                                         */

    struct {
      __IO uint32_t FDATA      : 8;            /*!< [7..0] Free Data Register bits                                            */
            uint32_t            : 24;
    } FDATA_b;
  } ;

  union {
    __IO uint32_t CTL;                         /*!< (@ 0x00000008) Control register                                           */

    struct {
      __IO uint32_t RST        : 1;            /*!< [0..0] reset bit                                                          */
            uint32_t            : 31;
    } CTL_b;
  } ;
} CRC_Type;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            DAC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Digital-to-analog converter (DAC)
  */

typedef struct {                                /*!< (@ 0x40007400) DAC Structure                                              */

  union {
    __IO uint32_t CTL;                         /*!< (@ 0x00000000) control register                                           */

