RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t DEN0       : 1;            /*!< [0..0] DAC0 enable                                                        */
      __IO uint32_t DBOFF0     : 1;            /*!< [1..1] DAC0 output buffer turn off                                        */
      __IO uint32_t DTEN0      : 1;            /*!< [2..2] DAC0 trigger enable                                                */
      __IO uint32_t DTSEL0     : 3;            /*!< [5..3] DAC0 trigger selection                                             */
      __IO uint32_t DWM0       : 2;            /*!< [7..6] DAC0 noise wave mode                                               */
      __IO uint32_t DWBW0      : 4;            /*!< [11..8] DAC0 noise wave bit width                                         */
      __IO uint32_t DDMAEN0    : 1;            /*!< [12..12] DAC0 DMA enable                                                  */
            uint32_t            : 3;
      __IO uint32_t DEN1       : 1;            /*!< [16..16] DAC1 enable                                                      */
      __IO uint32_t DBOFF1     : 1;            /*!< [17..17] DAC1 output buffer turn off                                      */
      __IO uint32_t DTEN1      : 1;            /*!< [18..18] DAC1 trigger enable                                              */
      __IO uint32_t DTSEL1     : 3;            /*!< [21..19] DAC1 trigger selection                                           */
      __IO uint32_t DWM1       : 2;            /*!< [23..22] DAC1 noise wave mode                                             */
      __IO uint32_t DWBW1      : 4;            /*!< [27..24] DAC1 noise wave bit width                                        */
      __IO uint32_t DDMAEN1    : 1;            /*!< [28..28] DAC1 DMA enable                                                  */
            uint32_t            : 3;
    } CTL_b;
  } ;

  union {
    __O  uint32_t SWT;                         /*!< (@ 0x00000004) software trigger register                                  */

    struct {
      __O  uint32_t SWTR0      : 1;            /*!< [0..0] DAC0 software trigger                                              */
      __O  uint32_t SWTR1      : 1;            /*!< [1..1] DAC1 software trigger                                              */
            uint32_t            : 30;
    } SWT_b;
  } ;

  union {
    __IO uint32_t DAC0_R12DH;                  /*!< (@ 0x00000008) DAC0 12-bit right-aligned data holding register            */

    struct {
      __IO uint32_t DAC0_DH    : 12;           /*!< [11..0] DAC0 12-bit right-aligned data                                    */
            uint32_t            : 20;
    } DAC0_R12DH_b;
  } ;

  union {
    __IO uint32_t DAC0_L12DH;                  /*!< (@ 0x0000000C) DAC0 12-bit left-aligned data holding register             */

    struct {
            uint32_t            : 4;
      __IO uint32_t DAC0_DH    : 12;           /*!< [15..4] DAC0 12-bit left-aligned data                                     */
            uint32_t            : 16;
    } DAC0_L12DH_b;
  } ;

  union {
    __IO uint32_t DAC0_R8DH;                   /*!< (@ 0x00000010) DAC0 8-bit right aligned data holding register             */

    struct {
      __IO uint32_t DAC0_DH    : 8;            /*!< [7..0] DAC0 8-bit right-aligned data                                      */
            uint32_t            : 24;
    } DAC0_R8DH_b;
  } ;

  union {
    __IO uint32_t DAC1_R12DH;                  /*!< (@ 0x00000014) DAC1 12-bit right-aligned data holding register            */

    struct {
      __IO uint32_t DAC1_DH    : 12;           /*!< [11..0] DAC1 12-bit right-aligned data                                    */
            uint32_t            : 20;
    } DAC1_R12DH_b;
  } ;

  union {
    __IO uint32_t DAC1_L12DH;                  /*!< (@ 0x00000018) DAC1 12-bit left aligned data holding register             */

    struct {
            uint32_t            : 4;
      __IO uint32_t DAC1_DH    : 12;           /*!< [15..4] DAC1 12-bit left-aligned data                                     */
            uint32_t            : 16;
    } DAC1_L12DH_b;
  } ;

  union {
    __IO uint32_t DAC1_R8DH;                   /*!< (@ 0x0000001C) DAC1 8-bit right aligned data holding register             */

    struct {
      __IO uint32_t DAC1_DH    : 8;            /*!< [7..0] DAC1 8-bit right-aligned data                                      */
            uint32_t            : 24;
    } DAC1_R8DH_b;
  } ;

  union {
    __IO uint32_t DACC_R12DH;                  /*!< (@ 0x00000020) DAC concurrent mode 12-bit right-aligned data
                                                                    holding register                                           */

    struct {
      __IO uint32_t DAC0_DH    : 12;           /*!< [11..0] DAC0 12-bit right-aligned data                                    */
            uint32_t            : 4;
      __IO uint32_t DAC1_DH    : 12;           /*!< [27..16] DAC1 12-bit right-aligned data                                   */
            uint32_t            : 4;
    } DACC_R12DH_b;
  } ;

  union {
    __IO uint32_t DACC_L12DH;                  /*!< (@ 0x00000024) DAC concurrent mode 12-bit left aligned data
                                                                    holding register                                           */

    struct {
            uint32_t            : 4;
      __IO uint32_t DAC0_DH    : 12;           /*!< [15..4] DAC0 12-bit left-aligned data                                     */
            uint32_t            : 4;
      __IO uint32_t DAC1_DH    : 12;           /*!< [31..20] DAC1 12-bit left-aligned data                                    */
    } DACC_L12DH_b;
  } ;

  union {
    __IO uint32_t DACC_R8DH;                   /*!< (@ 0x00000028) DAC concurrent mode 8-bit right aligned data
                                                                    holding register                                           */

