RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t DAC0_DH    : 8;            /*!< [7..0] DAC0 8-bit right-aligned data                                      */
      __IO uint32_t DAC1_DH    : 8;            /*!< [15..8] DAC1 8-bit right-aligned data                                     */
            uint32_t            : 16;
    } DACC_R8DH_b;
  } ;

  union {
    __I  uint32_t DAC0_DO;                     /*!< (@ 0x0000002C) DAC0 data output register                                  */

    struct {
      __I  uint32_t DAC0_DO    : 12;           /*!< [11..0] DAC0 data output                                                  */
            uint32_t            : 20;
    } DAC0_DO_b;
  } ;

  union {
    __I  uint32_t DAC1_DO;                     /*!< (@ 0x00000030) DAC1 data output register                                  */

    struct {
      __I  uint32_t DAC1_DO    : 12;           /*!< [11..0] DAC1 data output                                                  */
            uint32_t            : 20;
    } DAC1_DO_b;
  } ;
} DAC_Type;                                     /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                            DBG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Debug support (DBG)
  */

typedef struct {                                /*!< (@ 0xE0042000) DBG Structure                                              */

  union {
    __I  uint32_t ID;                          /*!< (@ 0x00000000) ID code register                                           */

    struct {
      __I  uint32_t ID_CODE    : 32;           /*!< [31..0] DBG ID code register                                              */
    } ID_b;
  } ;

  union {
    __IO uint32_t CTL;                         /*!< (@ 0x00000004) Control register 0                                         */

    struct {
      __IO uint32_t SLP_HOLD   : 1;            /*!< [0..0] Sleep mode hold register                                           */
      __IO uint32_t DSLP_HOLD  : 1;            /*!< [1..1] Deep-sleep mode hold register                                      */
      __IO uint32_t STB_HOLD   : 1;            /*!< [2..2] Standby mode hold register                                         */
            uint32_t            : 5;
      __IO uint32_t FWDGT_HOLD : 1;            /*!< [8..8] FWDGT hold bit                                                     */
      __IO uint32_t WWDGT_HOLD : 1;            /*!< [9..9] WWDGT hold bit                                                     */
      __IO uint32_t TIMER0_HOLD : 1;           /*!< [10..10] TIMER 0 hold bit                                                 */
      __IO uint32_t TIMER1_HOLD : 1;           /*!< [11..11] TIMER 1 hold bit                                                 */
      __IO uint32_t TIMER2_HOLD : 1;           /*!< [12..12] TIMER 2 hold bit                                                 */
      __IO uint32_t TIMER3_HOLD : 1;           /*!< [13..13] TIMER 23 hold bit                                                */
      __IO uint32_t CAN0_HOLD  : 1;            /*!< [14..14] CAN0 hold bit                                                    */
      __IO uint32_t I2C0_HOLD  : 1;            /*!< [15..15] I2C0 hold bit                                                    */
      __IO uint32_t I2C1_HOLD  : 1;            /*!< [16..16] I2C1 hold bit                                                    */
            uint32_t            : 1;
      __IO uint32_t TIMER4_HOLD : 1;           /*!< [18..18] TIMER4_HOLD                                                      */
      __IO uint32_t TIMER5_HOLD : 1;           /*!< [19..19] TIMER 5 hold bit                                                 */
      __IO uint32_t TIMER6_HOLD : 1;           /*!< [20..20] TIMER 6 hold bit                                                 */
      __IO uint32_t CAN1_HOLD  : 1;            /*!< [21..21] CAN1 hold bit                                                    */
            uint32_t            : 10;
    } CTL_b;
  } ;
} DBG_Type;                                     /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                           DMA0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA controller (DMA0)
  */

typedef struct {                                /*!< (@ 0x40020000) DMA0 Structure                                             */

  union {
    __I  uint32_t INTF;                        /*!< (@ 0x00000000) Interrupt flag register                                    */

    struct {
      __I  uint32_t GIF0       : 1;            /*!< [0..0] Global interrupt flag of channel 0                                 */
      __I  uint32_t FTFIF0     : 1;            /*!< [1..1] Full Transfer finish flag of channe 0                              */
      __I  uint32_t HTFIF0     : 1;            /*!< [2..2] Half transfer finish flag of channel 0                             */
      __I  uint32_t ERRIF0     : 1;            /*!< [3..3] Error flag of channel 0                                            */
      __I  uint32_t GIF1       : 1;            /*!< [4..4] Global interrupt flag of channel 1                                 */
      __I  uint32_t FTFIF1     : 1;            /*!< [5..5] Full Transfer finish flag of channe 1                              */
      __I  uint32_t HTFIF1     : 1;            /*!< [6..6] Half transfer finish flag of channel 1                             */
      __I  uint32_t ERRIF1     : 1;            /*!< [7..7] Error flag of channel 1                                            */
      __I  uint32_t GIF2       : 1;            /*!< [8..8] Global interrupt flag of channel 2                                 */
      __I  uint32_t FTFIF2     : 1;            /*!< [9..9] Full Transfer finish flag of channe 2                              */
      __I  uint32_t HTFIF2     : 1;            /*!< [10..10] Half transfer finish flag of channel 2                           */
      __I  uint32_t ERRIF2     : 1;            /*!< [11..11] Error flag of channel 2                                          */
      __I  uint32_t GIF3       : 1;            /*!< [12..12] Global interrupt flag of channel 3                               */
      __I  uint32_t FTFIF3     : 1;            /*!< [13..13] Full Transfer finish flag of channe 3                            */
      __I  uint32_t HTFIF3     : 1;            /*!< [14..14] Half transfer finish flag of channel 3                           */
      __I  uint32_t ERRIF3     : 1;            /*!< [15..15] Error flag of channel 3                                          */
      __I  uint32_t GIF4       : 1;            /*!< [16..16] Global interrupt flag of channel 4                               */
      __I  uint32_t FTFIF4     : 1;            /*!< [17..17] Full Transfer finish flag of channe 4                            */
      __I  uint32_t HTFIF4     : 1;            /*!< [18..18] Half transfer finish flag of channel 4                           */
      __I  uint32_t ERRIF4     : 1;            /*!< [19..19] Error flag of channel 4                                          */
      __I  uint32_t GIF5       : 1;            /*!< [20..20] Global interrupt flag of channel 5                               */
      __I  uint32_t FTFIF5     : 1;            /*!< [21..21] Full Transfer finish flag of channe 5                            */
      __I  uint32_t HTFIF5     : 1;            /*!< [22..22] Half transfer finish flag of channel 5                           */
      __I  uint32_t ERRIF5     : 1;            /*!< [23..23] Error flag of channel 5                                          */
      __I  uint32_t GIF6       : 1;            /*!< [24..24] Global interrupt flag of channel 6                               */
      __I  uint32_t FTFIF6     : 1;            /*!< [25..25] Full Transfer finish flag of channe 6                            */
      __I  uint32_t HTFIF6     : 1;            /*!< [26..26] Half transfer finish flag of channel 6                           */
      __I  uint32_t ERRIF6     : 1;            /*!< [27..27] Error flag of channel 6                                          */
            uint32_t            : 4;
    } INTF_b;
  } ;

  union {
    __O  uint32_t INTC;                        /*!< (@ 0x00000004) Interrupt flag clear register                              */

