RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __O  uint32_t GIFC0      : 1;            /*!< [0..0] Clear global interrupt flag of channel 0                           */
      __O  uint32_t FTFIFC0    : 1;            /*!< [1..1] Clear bit for full transfer finish flag of channel 0               */
      __O  uint32_t HTFIFC0    : 1;            /*!< [2..2] Clear bit for half transfer finish flag of channel 0               */
      __O  uint32_t ERRIFC0    : 1;            /*!< [3..3] Clear bit for error flag of channel 0                              */
      __O  uint32_t GIFC1      : 1;            /*!< [4..4] Clear global interrupt flag of channel 1                           */
      __O  uint32_t FTFIFC1    : 1;            /*!< [5..5] Clear bit for full transfer finish flag of channel 1               */
      __O  uint32_t HTFIFC1    : 1;            /*!< [6..6] Clear bit for half transfer finish flag of channel 1               */
      __O  uint32_t ERRIFC1    : 1;            /*!< [7..7] Clear bit for error flag of channel 1                              */
      __O  uint32_t GIFC2      : 1;            /*!< [8..8] Clear global interrupt flag of channel 2                           */
      __O  uint32_t FTFIFC2    : 1;            /*!< [9..9] Clear bit for full transfer finish flag of channel 2               */
      __O  uint32_t HTFIFC2    : 1;            /*!< [10..10] Clear bit for half transfer finish flag of channel
                                                     2                                                                         */
      __O  uint32_t ERRIFC2    : 1;            /*!< [11..11] Clear bit for error flag of channel 2                            */
      __O  uint32_t GIFC3      : 1;            /*!< [12..12] Clear global interrupt flag of channel 3                         */
      __O  uint32_t FTFIFC3    : 1;            /*!< [13..13] Clear bit for full transfer finish flag of channel
                                                     3                                                                         */
      __O  uint32_t HTFIFC3    : 1;            /*!< [14..14] Clear bit for half transfer finish flag of channel
                                                     3                                                                         */
      __O  uint32_t ERRIFC3    : 1;            /*!< [15..15] Clear bit for error flag of channel 3                            */
      __O  uint32_t GIFC4      : 1;            /*!< [16..16] Clear global interrupt flag of channel 4                         */
      __O  uint32_t FTFIFC4    : 1;            /*!< [17..17] Clear bit for full transfer finish flag of channel
                                                     4                                                                         */
      __O  uint32_t HTFIFC4    : 1;            /*!< [18..18] Clear bit for half transfer finish flag of channel
                                                     4                                                                         */
      __O  uint32_t ERRIFC4    : 1;            /*!< [19..19] Clear bit for error flag of channel 4                            */
      __O  uint32_t GIFC5      : 1;            /*!< [20..20] Clear global interrupt flag of channel 5                         */
      __O  uint32_t FTFIFC5    : 1;            /*!< [21..21] Clear bit for full transfer finish flag of channel
                                                     5                                                                         */
      __O  uint32_t HTFIFC5    : 1;            /*!< [22..22] Clear bit for half transfer finish flag of channel
                                                     5                                                                         */
      __O  uint32_t ERRIFC5    : 1;            /*!< [23..23] Clear bit for error flag of channel 5                            */
      __O  uint32_t GIFC6      : 1;            /*!< [24..24] Clear global interrupt flag of channel 6                         */
      __O  uint32_t FTFIFC6    : 1;            /*!< [25..25] Clear bit for full transfer finish flag of channel
                                                     6                                                                         */
      __O  uint32_t HTFIFC6    : 1;            /*!< [26..26] Clear bit for half transfer finish flag of channel
                                                     6                                                                         */
      __O  uint32_t ERRIFC6    : 1;            /*!< [27..27] Clear bit for error flag of channel 6                            */
            uint32_t            : 4;
    } INTC_b;
  } ;

  union {
    __IO uint32_t CH0CTL;                      /*!< (@ 0x00000008) Channel 0 control register                                 */

    struct {
      __IO uint32_t CHEN       : 1;            /*!< [0..0] Channel enable                                                     */
      __IO uint32_t FTFIE      : 1;            /*!< [1..1] Enable bit for channel full transfer finish interrupt              */
      __IO uint32_t HTFIE      : 1;            /*!< [2..2] Enable bit for channel half transfer finish interrupt              */
      __IO uint32_t ERRIE      : 1;            /*!< [3..3] Enable bit for channel error interrupt                             */
      __IO uint32_t DIR        : 1;            /*!< [4..4] Transfer direction                                                 */
      __IO uint32_t CMEN       : 1;            /*!< [5..5] Circular mode enable                                               */
      __IO uint32_t PNAGA      : 1;            /*!< [6..6] Next address generation algorithm of peripheral                    */
      __IO uint32_t MNAGA      : 1;            /*!< [7..7] Next address generation algorithm of memory                        */
      __IO uint32_t PWIDTH     : 2;            /*!< [9..8] Transfer data size of peripheral                                   */
      __IO uint32_t MWIDTH     : 2;            /*!< [11..10] Transfer data size of memory                                     */
      __IO uint32_t PRIO       : 2;            /*!< [13..12] Priority level                                                   */
      __IO uint32_t M2M        : 1;            /*!< [14..14] Memory to Memory Mode                                            */
            uint32_t            : 17;
    } CH0CTL_b;
  } ;

  union {
    __IO uint32_t CH0CNT;                      /*!< (@ 0x0000000C) Channel 0 counter register                                 */

