RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t CNT        : 16;           /*!< [15..0] Transfer counter                                                  */
            uint32_t            : 16;
    } CH5CNT_b;
  } ;

  union {
    __IO uint32_t CH5PADDR;                    /*!< (@ 0x00000074) Channel 5 peripheral base address register                 */

    struct {
      __IO uint32_t PADDR      : 32;           /*!< [31..0] Peripheral base address                                           */
    } CH5PADDR_b;
  } ;

  union {
    __IO uint32_t CH5MADDR;                    /*!< (@ 0x00000078) Channel 5 memory base address register                     */

    struct {
      __IO uint32_t MADDR      : 32;           /*!< [31..0] Memory base address                                               */
    } CH5MADDR_b;
  } ;
  __I  uint32_t  RESERVED5;

  union {
    __IO uint32_t CH6CTL;                      /*!< (@ 0x00000080) Channel 6 control register                                 */

    struct {
      __IO uint32_t CHEN       : 1;            /*!< [0..0] Channel enable                                                     */
      __IO uint32_t FTFIE      : 1;            /*!< [1..1] Enable bit for channel full transfer finish interrupt              */
      __IO uint32_t HTFIE      : 1;            /*!< [2..2] Enable bit for channel half transfer finish interrupt              */
      __IO uint32_t ERRIE      : 1;            /*!< [3..3] Enable bit for channel error interrupt                             */
      __IO uint32_t DIR        : 1;            /*!< [4..4] Transfer direction                                                 */
      __IO uint32_t CMEN       : 1;            /*!< [5..5] Circular mode enable                                               */
      __IO uint32_t PNAGA      : 1;            /*!< [6..6] Next address generation algorithm of peripheral                    */
      __IO uint32_t MNAGA      : 1;            /*!< [7..7] Next address generation algorithm of memory                        */
      __IO uint32_t PWIDTH     : 2;            /*!< [9..8] Transfer data size of peripheral                                   */
      __IO uint32_t MWIDTH     : 2;            /*!< [11..10] Transfer data size of memory                                     */
      __IO uint32_t PRIO       : 2;            /*!< [13..12] Priority level                                                   */
      __IO uint32_t M2M        : 1;            /*!< [14..14] Memory to Memory Mode                                            */
            uint32_t            : 17;
    } CH6CTL_b;
  } ;

  union {
    __IO uint32_t CH6CNT;                      /*!< (@ 0x00000084) Channel 6 counter register                                 */

    struct {
      __IO uint32_t CNT        : 16;           /*!< [15..0] Transfer counter                                                  */
            uint32_t            : 16;
    } CH6CNT_b;
  } ;

  union {
    __IO uint32_t CH6PADDR;                    /*!< (@ 0x00000088) Channel 6 peripheral base address register                 */

    struct {
      __IO uint32_t PADDR      : 32;           /*!< [31..0] Peripheral base address                                           */
    } CH6PADDR_b;
  } ;

  union {
    __IO uint32_t CH6MADDR;                    /*!< (@ 0x0000008C) Channel 6 memory base address register                     */

    struct {
      __IO uint32_t MADDR      : 32;           /*!< [31..0] Memory base address                                               */
    } CH6MADDR_b;
  } ;
} DMA0_Type;                                    /*!< Size = 144 (0x90)                                                         */



/* =========================================================================================================================== */
/* ================                                           DMA1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Direct memory access controller (DMA1)
  */

typedef struct {                                /*!< (@ 0x40020400) DMA1 Structure                                             */

  union {
    __I  uint32_t INTF;                        /*!< (@ 0x00000000) Interrupt flag register                                    */

    struct {
      __I  uint32_t GIF0       : 1;            /*!< [0..0] Global interrupt flag of channel 0                                 */
      __I  uint32_t FTFIF0     : 1;            /*!< [1..1] Full Transfer finish flag of channe 0                              */
      __I  uint32_t HTFIF0     : 1;            /*!< [2..2] Half transfer finish flag of channel 0                             */
      __I  uint32_t ERRIF0     : 1;            /*!< [3..3] Error flag of channel 0                                            */
      __I  uint32_t GIF1       : 1;            /*!< [4..4] Global interrupt flag of channel 1                                 */
      __I  uint32_t FTFIF1     : 1;            /*!< [5..5] Full Transfer finish flag of channe 1                              */
      __I  uint32_t HTFIF1     : 1;            /*!< [6..6] Half transfer finish flag of channel 1                             */
      __I  uint32_t ERRIF1     : 1;            /*!< [7..7] Error flag of channel 1                                            */
      __I  uint32_t GIF2       : 1;            /*!< [8..8] Global interrupt flag of channel 2                                 */
      __I  uint32_t FTFIF2     : 1;            /*!< [9..9] Full Transfer finish flag of channe 2                              */
      __I  uint32_t HTFIF2     : 1;            /*!< [10..10] Half transfer finish flag of channel 2                           */
      __I  uint32_t ERRIF2     : 1;            /*!< [11..11] Error flag of channel 2                                          */
      __I  uint32_t GIF3       : 1;            /*!< [12..12] Global interrupt flag of channel 3                               */
      __I  uint32_t FTFIF3     : 1;            /*!< [13..13] Full Transfer finish flag of channe 3                            */
      __I  uint32_t HTFIF3     : 1;            /*!< [14..14] Half transfer finish flag of channel 3                           */
      __I  uint32_t ERRIF3     : 1;            /*!< [15..15] Error flag of channel 3                                          */
      __I  uint32_t GIF4       : 1;            /*!< [16..16] Global interrupt flag of channel 4                               */
      __I  uint32_t FTFIF4     : 1;            /*!< [17..17] Full Transfer finish flag of channe 4                            */
      __I  uint32_t HTFIF4     : 1;            /*!< [18..18] Half transfer finish flag of channel 4                           */
      __I  uint32_t ERRIF4     : 1;            /*!< [19..19] Error flag of channel 4                                          */
            uint32_t            : 12;
    } INTF_b;
  } ;

  union {
    __O  uint32_t INTC;                        /*!< (@ 0x00000004) Interrupt flag clear register                              */

