RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t CHEN       : 1;            /*!< [0..0] Channel enable                                                     */
      __IO uint32_t FTFIE      : 1;            /*!< [1..1] Enable bit for channel full transfer finish interrupt              */
      __IO uint32_t HTFIE      : 1;            /*!< [2..2] Enable bit for channel half transfer finish interrupt              */
      __IO uint32_t ERRIE      : 1;            /*!< [3..3] Enable bit for channel error interrupt                             */
      __IO uint32_t DIR        : 1;            /*!< [4..4] Transfer direction                                                 */
      __IO uint32_t CMEN       : 1;            /*!< [5..5] Circular mode enable                                               */
      __IO uint32_t PNAGA      : 1;            /*!< [6..6] Next address generation algorithm of peripheral                    */
      __IO uint32_t MNAGA      : 1;            /*!< [7..7] Next address generation algorithm of memory                        */
      __IO uint32_t PWIDTH     : 2;            /*!< [9..8] Transfer data size of peripheral                                   */
      __IO uint32_t MWIDTH     : 2;            /*!< [11..10] Transfer data size of memory                                     */
      __IO uint32_t PRIO       : 2;            /*!< [13..12] Priority level                                                   */
      __IO uint32_t M2M        : 1;            /*!< [14..14] Memory to Memory Mode                                            */
            uint32_t            : 17;
    } CH1CTL_b;
  } ;

  union {
    __IO uint32_t CH1CNT;                      /*!< (@ 0x00000020) Channel 1 counter register                                 */

    struct {
      __IO uint32_t CNT        : 16;           /*!< [15..0] Transfer counter                                                  */
            uint32_t            : 16;
    } CH1CNT_b;
  } ;

  union {
    __IO uint32_t CH1PADDR;                    /*!< (@ 0x00000024) Channel 1 peripheral base address register                 */

    struct {
      __IO uint32_t PADDR      : 32;           /*!< [31..0] Peripheral base address                                           */
    } CH1PADDR_b;
  } ;

  union {
    __IO uint32_t CH1MADDR;                    /*!< (@ 0x00000028) Channel 1 memory base address register                     */

    struct {
      __IO uint32_t MADDR      : 32;           /*!< [31..0] Memory base address                                               */
    } CH1MADDR_b;
  } ;
  __I  uint32_t  RESERVED1;

  union {
    __IO uint32_t CH2CTL;                      /*!< (@ 0x00000030) Channel 2 control register                                 */

    struct {
      __IO uint32_t CHEN       : 1;            /*!< [0..0] Channel enable                                                     */
      __IO uint32_t FTFIE      : 1;            /*!< [1..1] Enable bit for channel full transfer finish interrupt              */
      __IO uint32_t HTFIE      : 1;            /*!< [2..2] Enable bit for channel half transfer finish interrupt              */
      __IO uint32_t ERRIE      : 1;            /*!< [3..3] Enable bit for channel error interrupt                             */
      __IO uint32_t DIR        : 1;            /*!< [4..4] Transfer direction                                                 */
      __IO uint32_t CMEN       : 1;            /*!< [5..5] Circular mode enable                                               */
      __IO uint32_t PNAGA      : 1;            /*!< [6..6] Next address generation algorithm of peripheral                    */
      __IO uint32_t MNAGA      : 1;            /*!< [7..7] Next address generation algorithm of memory                        */
      __IO uint32_t PWIDTH     : 2;            /*!< [9..8] Transfer data size of peripheral                                   */
      __IO uint32_t MWIDTH     : 2;            /*!< [11..10] Transfer data size of memory                                     */
      __IO uint32_t PRIO       : 2;            /*!< [13..12] Priority level                                                   */
      __IO uint32_t M2M        : 1;            /*!< [14..14] Memory to Memory Mode                                            */
            uint32_t            : 17;
    } CH2CTL_b;
  } ;

  union {
    __IO uint32_t CH2CNT;                      /*!< (@ 0x00000034) Channel 2 counter register                                 */

    struct {
      __IO uint32_t CNT        : 16;           /*!< [15..0] Transfer counter                                                  */
            uint32_t            : 16;
    } CH2CNT_b;
  } ;

  union {
    __IO uint32_t CH2PADDR;                    /*!< (@ 0x00000038) Channel 2 peripheral base address register                 */

    struct {
      __IO uint32_t PADDR      : 32;           /*!< [31..0] Peripheral base address                                           */
    } CH2PADDR_b;
  } ;

  union {
    __IO uint32_t CH2MADDR;                    /*!< (@ 0x0000003C) Channel 2 memory base address register                     */

    struct {
      __IO uint32_t MADDR      : 32;           /*!< [31..0] Memory base address                                               */
    } CH2MADDR_b;
  } ;
  __I  uint32_t  RESERVED2;

  union {
    __IO uint32_t CH3CTL;                      /*!< (@ 0x00000044) Channel 3 control register                                 */

    struct {
      __IO uint32_t CHEN       : 1;            /*!< [0..0] Channel enable                                                     */
      __IO uint32_t FTFIE      : 1;            /*!< [1..1] Enable bit for channel full transfer finish interrupt              */
      __IO uint32_t HTFIE      : 1;            /*!< [2..2] Enable bit for channel half transfer finish interrupt              */
      __IO uint32_t ERRIE      : 1;            /*!< [3..3] Enable bit for channel error interrupt                             */
      __IO uint32_t DIR        : 1;            /*!< [4..4] Transfer direction                                                 */
      __IO uint32_t CMEN       : 1;            /*!< [5..5] Circular mode enable                                               */
      __IO uint32_t PNAGA      : 1;            /*!< [6..6] Next address generation algorithm of peripheral                    */
      __IO uint32_t MNAGA      : 1;            /*!< [7..7] Next address generation algorithm of memory                        */
      __IO uint32_t PWIDTH     : 2;            /*!< [9..8] Transfer data size of peripheral                                   */
      __IO uint32_t MWIDTH     : 2;            /*!< [11..10] Transfer data size of memory                                     */
      __IO uint32_t PRIO       : 2;            /*!< [13..12] Priority level                                                   */
      __IO uint32_t M2M        : 1;            /*!< [14..14] Memory to Memory Mode                                            */
            uint32_t            : 17;
    } CH3CTL_b;
  } ;

  union {
    __IO uint32_t CH3CNT;                      /*!< (@ 0x00000048) Channel 3 counter register                                 */

