RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t ASET       : 4;            /*!< [3..0] Address setup time                                                 */
      __IO uint32_t AHLD       : 4;            /*!< [7..4] Address hold time                                                  */
      __IO uint32_t DSET       : 8;            /*!< [15..8] Data setup time                                                   */
      __IO uint32_t BUSLAT     : 4;            /*!< [19..16] Bus latency                                                      */
            uint32_t            : 12;
    } SNTCFG0_b;
  } ;

  union {
    __IO uint32_t SNCTL1;                      /*!< (@ 0x00000008) SRAM/NOR flash control register 1                          */

    struct {
      __IO uint32_t NRBKEN     : 1;            /*!< [0..0] NOR bank enable                                                    */
      __IO uint32_t NRMUX      : 1;            /*!< [1..1] NOR bank memory address/data multiplexing                          */
      __IO uint32_t NRTP       : 2;            /*!< [3..2] NOR bank memory type                                               */
      __IO uint32_t NRW        : 2;            /*!< [5..4] NOR bank memory data bus width                                     */
      __IO uint32_t NREN       : 1;            /*!< [6..6] NOR Flash access enable                                            */
            uint32_t            : 2;
      __IO uint32_t NRWTPOL    : 1;            /*!< [9..9] NWAIT signal polarity                                              */
            uint32_t            : 2;
      __IO uint32_t WREN       : 1;            /*!< [12..12] Write enable                                                     */
      __IO uint32_t NRWTEN     : 1;            /*!< [13..13] NWAIT signal enable                                              */
            uint32_t            : 1;
      __IO uint32_t ASYNCWAIT  : 1;            /*!< [15..15] Asynchronous wait                                                */
            uint32_t            : 16;
    } SNCTL1_b;
  } ;
} EXMC_Type;                                    /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           EXTI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief External interrupt/event
      controller (EXTI)
  */

typedef struct {                                /*!< (@ 0x40010400) EXTI Structure                                             */

  union {
    __IO uint32_t INTEN;                       /*!< (@ 0x00000000) Interrupt enable register (EXTI_INTEN)                     */

    struct {
      __IO uint32_t INTEN0     : 1;            /*!< [0..0] Enable Interrupt on line 0                                         */
      __IO uint32_t INTEN1     : 1;            /*!< [1..1] Enable Interrupt on line 1                                         */
      __IO uint32_t INTEN2     : 1;            /*!< [2..2] Enable Interrupt on line 2                                         */
      __IO uint32_t INTEN3     : 1;            /*!< [3..3] Enable Interrupt on line 3                                         */
      __IO uint32_t INTEN4     : 1;            /*!< [4..4] Enable Interrupt on line 4                                         */
      __IO uint32_t INTEN5     : 1;            /*!< [5..5] Enable Interrupt on line 5                                         */
      __IO uint32_t INTEN6     : 1;            /*!< [6..6] Enable Interrupt on line 6                                         */
      __IO uint32_t INTEN7     : 1;            /*!< [7..7] Enable Interrupt on line 7                                         */
      __IO uint32_t INTEN8     : 1;            /*!< [8..8] Enable Interrupt on line 8                                         */
      __IO uint32_t INTEN9     : 1;            /*!< [9..9] Enable Interrupt on line 9                                         */
      __IO uint32_t INTEN10    : 1;            /*!< [10..10] Enable Interrupt on line 10                                      */
      __IO uint32_t INTEN11    : 1;            /*!< [11..11] Enable Interrupt on line 11                                      */
      __IO uint32_t INTEN12    : 1;            /*!< [12..12] Enable Interrupt on line 12                                      */
      __IO uint32_t INTEN13    : 1;            /*!< [13..13] Enable Interrupt on line 13                                      */
      __IO uint32_t INTEN14    : 1;            /*!< [14..14] Enable Interrupt on line 14                                      */
      __IO uint32_t INTEN15    : 1;            /*!< [15..15] Enable Interrupt on line 15                                      */
      __IO uint32_t INTEN16    : 1;            /*!< [16..16] Enable Interrupt on line 16                                      */
      __IO uint32_t INTEN17    : 1;            /*!< [17..17] Enable Interrupt on line 17                                      */
      __IO uint32_t INTEN18    : 1;            /*!< [18..18] Enable Interrupt on line 18                                      */
            uint32_t            : 13;
    } INTEN_b;
  } ;

  union {
    __IO uint32_t EVEN;                        /*!< (@ 0x00000004) Event enable register (EXTI_EVEN)                          */

    struct {
      __IO uint32_t EVEN0      : 1;            /*!< [0..0] Enable Event on line 0                                             */
      __IO uint32_t EVEN1      : 1;            /*!< [1..1] Enable Event on line 1                                             */
      __IO uint32_t EVEN2      : 1;            /*!< [2..2] Enable Event on line 2                                             */
      __IO uint32_t EVEN3      : 1;            /*!< [3..3] Enable Event on line 3                                             */
      __IO uint32_t EVEN4      : 1;            /*!< [4..4] Enable Event on line 4                                             */
      __IO uint32_t EVEN5      : 1;            /*!< [5..5] Enable Event on line 5                                             */
      __IO uint32_t EVEN6      : 1;            /*!< [6..6] Enable Event on line 6                                             */
      __IO uint32_t EVEN7      : 1;            /*!< [7..7] Enable Event on line 7                                             */
      __IO uint32_t EVEN8      : 1;            /*!< [8..8] Enable Event on line 8                                             */
      __IO uint32_t EVEN9      : 1;            /*!< [9..9] Enable Event on line 9                                             */
      __IO uint32_t EVEN10     : 1;            /*!< [10..10] Enable Event on line 10                                          */
      __IO uint32_t EVEN11     : 1;            /*!< [11..11] Enable Event on line 11                                          */
      __IO uint32_t EVEN12     : 1;            /*!< [12..12] Enable Event on line 12                                          */
      __IO uint32_t EVEN13     : 1;            /*!< [13..13] Enable Event on line 13                                          */
      __IO uint32_t EVEN14     : 1;            /*!< [14..14] Enable Event on line 14                                          */
      __IO uint32_t EVEN15     : 1;            /*!< [15..15] Enable Event on line 15                                          */
      __IO uint32_t EVEN16     : 1;            /*!< [16..16] Enable Event on line 16                                          */
      __IO uint32_t EVEN17     : 1;            /*!< [17..17] Enable Event on line 17                                          */
      __IO uint32_t EVEN18     : 1;            /*!< [18..18] Enable Event on line 18                                          */
            uint32_t            : 13;
    } EVEN_b;
  } ;

  union {
    __IO uint32_t RTEN;                        /*!< (@ 0x00000008) Rising Edge Trigger Enable register (EXTI_RTEN)            */

