RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t RTEN0      : 1;            /*!< [0..0] Rising edge trigger enable of line 0                               */
      __IO uint32_t RTEN1      : 1;            /*!< [1..1] Rising edge trigger enable of line 1                               */
      __IO uint32_t RTEN2      : 1;            /*!< [2..2] Rising edge trigger enable of line 2                               */
      __IO uint32_t RTEN3      : 1;            /*!< [3..3] Rising edge trigger enable of line 3                               */
      __IO uint32_t RTEN4      : 1;            /*!< [4..4] Rising edge trigger enable of line 4                               */
      __IO uint32_t RTEN5      : 1;            /*!< [5..5] Rising edge trigger enable of line 5                               */
      __IO uint32_t RTEN6      : 1;            /*!< [6..6] Rising edge trigger enable of line 6                               */
      __IO uint32_t RTEN7      : 1;            /*!< [7..7] Rising edge trigger enable of line 7                               */
      __IO uint32_t RTEN8      : 1;            /*!< [8..8] Rising edge trigger enable of line 8                               */
      __IO uint32_t RTEN9      : 1;            /*!< [9..9] Rising edge trigger enable of line 9                               */
      __IO uint32_t RTEN10     : 1;            /*!< [10..10] Rising edge trigger enable of line 10                            */
      __IO uint32_t RTEN11     : 1;            /*!< [11..11] Rising edge trigger enable of line 11                            */
      __IO uint32_t RTEN12     : 1;            /*!< [12..12] Rising edge trigger enable of line 12                            */
      __IO uint32_t RTEN13     : 1;            /*!< [13..13] Rising edge trigger enable of line 13                            */
      __IO uint32_t RTEN14     : 1;            /*!< [14..14] Rising edge trigger enable of line 14                            */
      __IO uint32_t RTEN15     : 1;            /*!< [15..15] Rising edge trigger enable of line 15                            */
      __IO uint32_t RTEN16     : 1;            /*!< [16..16] Rising edge trigger enable of line 16                            */
      __IO uint32_t RTEN17     : 1;            /*!< [17..17] Rising edge trigger enable of line 17                            */
      __IO uint32_t RTEN18     : 1;            /*!< [18..18] Rising edge trigger enable of line 18                            */
            uint32_t            : 13;
    } RTEN_b;
  } ;

  union {
    __IO uint32_t FTEN;                        /*!< (@ 0x0000000C) Falling Egde Trigger Enable register (EXTI_FTEN)           */

    struct {
      __IO uint32_t FTEN0      : 1;            /*!< [0..0] Falling edge trigger enable of line 0                              */
      __IO uint32_t FTEN1      : 1;            /*!< [1..1] Falling edge trigger enable of line 1                              */
      __IO uint32_t FTEN2      : 1;            /*!< [2..2] Falling edge trigger enable of line 2                              */
      __IO uint32_t FTEN3      : 1;            /*!< [3..3] Falling edge trigger enable of line 3                              */
      __IO uint32_t FTEN4      : 1;            /*!< [4..4] Falling edge trigger enable of line 4                              */
      __IO uint32_t FTEN5      : 1;            /*!< [5..5] Falling edge trigger enable of line 5                              */
      __IO uint32_t FTEN6      : 1;            /*!< [6..6] Falling edge trigger enable of line 6                              */
      __IO uint32_t FTEN7      : 1;            /*!< [7..7] Falling edge trigger enable of line 7                              */
      __IO uint32_t FTEN8      : 1;            /*!< [8..8] Falling edge trigger enable of line 8                              */
      __IO uint32_t FTEN9      : 1;            /*!< [9..9] Falling edge trigger enable of line 9                              */
      __IO uint32_t FTEN10     : 1;            /*!< [10..10] Falling edge trigger enable of line 10                           */
      __IO uint32_t FTEN11     : 1;            /*!< [11..11] Falling edge trigger enable of line 11                           */
      __IO uint32_t FTEN12     : 1;            /*!< [12..12] Falling edge trigger enable of line 12                           */
      __IO uint32_t FTEN13     : 1;            /*!< [13..13] Falling edge trigger enable of line 13                           */
      __IO uint32_t FTEN14     : 1;            /*!< [14..14] Falling edge trigger enable of line 14                           */
      __IO uint32_t FTEN15     : 1;            /*!< [15..15] Falling edge trigger enable of line 15                           */
      __IO uint32_t FTEN16     : 1;            /*!< [16..16] Falling edge trigger enable of line 16                           */
      __IO uint32_t FTEN17     : 1;            /*!< [17..17] Falling edge trigger enable of line 17                           */
      __IO uint32_t FTEN18     : 1;            /*!< [18..18] Falling edge trigger enable of line 18                           */
            uint32_t            : 13;
    } FTEN_b;
  } ;

  union {
    __IO uint32_t SWIEV;                       /*!< (@ 0x00000010) Software interrupt event register (EXTI_SWIEV)             */

    struct {
      __IO uint32_t SWIEV0     : 1;            /*!< [0..0] Interrupt/Event software trigger on line 0                         */
      __IO uint32_t SWIEV1     : 1;            /*!< [1..1] Interrupt/Event software trigger on line 1                         */
      __IO uint32_t SWIEV2     : 1;            /*!< [2..2] Interrupt/Event software trigger on line 2                         */
      __IO uint32_t SWIEV3     : 1;            /*!< [3..3] Interrupt/Event software trigger on line 3                         */
      __IO uint32_t SWIEV4     : 1;            /*!< [4..4] Interrupt/Event software trigger on line 4                         */
      __IO uint32_t SWIEV5     : 1;            /*!< [5..5] Interrupt/Event software trigger on line 5                         */
      __IO uint32_t SWIEV6     : 1;            /*!< [6..6] Interrupt/Event software trigger on line 6                         */
      __IO uint32_t SWIEV7     : 1;            /*!< [7..7] Interrupt/Event software trigger on line 7                         */
      __IO uint32_t SWIEV8     : 1;            /*!< [8..8] Interrupt/Event software trigger on line 8                         */
      __IO uint32_t SWIEV9     : 1;            /*!< [9..9] Interrupt/Event software trigger on line 9                         */
      __IO uint32_t SWIEV10    : 1;            /*!< [10..10] Interrupt/Event software trigger on line 10                      */
      __IO uint32_t SWIEV11    : 1;            /*!< [11..11] Interrupt/Event software trigger on line 11                      */
      __IO uint32_t SWIEV12    : 1;            /*!< [12..12] Interrupt/Event software trigger on line 12                      */
      __IO uint32_t SWIEV13    : 1;            /*!< [13..13] Interrupt/Event software trigger on line 13                      */
      __IO uint32_t SWIEV14    : 1;            /*!< [14..14] Interrupt/Event software trigger on line 14                      */
      __IO uint32_t SWIEV15    : 1;            /*!< [15..15] Interrupt/Event software trigger on line 15                      */
      __IO uint32_t SWIEV16    : 1;            /*!< [16..16] Interrupt/Event software trigger on line 16                      */
      __IO uint32_t SWIEV17    : 1;            /*!< [17..17] Interrupt/Event software trigger on line 17                      */
      __IO uint32_t SWIEV18    : 1;            /*!< [18..18] Interrupt/Event software trigger on line 18                      */
            uint32_t            : 13;
    } SWIEV_b;
  } ;

  union {
    __IO uint32_t PD;                          /*!< (@ 0x00000014) Pending register (EXTI_PD)                                 */

