RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t PD0        : 1;            /*!< [0..0] Interrupt pending status of line 0                                 */
      __IO uint32_t PD1        : 1;            /*!< [1..1] Interrupt pending status of line 1                                 */
      __IO uint32_t PD2        : 1;            /*!< [2..2] Interrupt pending status of line 2                                 */
      __IO uint32_t PD3        : 1;            /*!< [3..3] Interrupt pending status of line 3                                 */
      __IO uint32_t PD4        : 1;            /*!< [4..4] Interrupt pending status of line 4                                 */
      __IO uint32_t PD5        : 1;            /*!< [5..5] Interrupt pending status of line 5                                 */
      __IO uint32_t PD6        : 1;            /*!< [6..6] Interrupt pending status of line 6                                 */
      __IO uint32_t PD7        : 1;            /*!< [7..7] Interrupt pending status of line 7                                 */
      __IO uint32_t PD8        : 1;            /*!< [8..8] Interrupt pending status of line 8                                 */
      __IO uint32_t PD9        : 1;            /*!< [9..9] Interrupt pending status of line 9                                 */
      __IO uint32_t PD10       : 1;            /*!< [10..10] Interrupt pending status of line 10                              */
      __IO uint32_t PD11       : 1;            /*!< [11..11] Interrupt pending status of line 11                              */
      __IO uint32_t PD12       : 1;            /*!< [12..12] Interrupt pending status of line 12                              */
      __IO uint32_t PD13       : 1;            /*!< [13..13] Interrupt pending status of line 13                              */
      __IO uint32_t PD14       : 1;            /*!< [14..14] Interrupt pending status of line 14                              */
      __IO uint32_t PD15       : 1;            /*!< [15..15] Interrupt pending status of line 15                              */
      __IO uint32_t PD16       : 1;            /*!< [16..16] Interrupt pending status of line 16                              */
      __IO uint32_t PD17       : 1;            /*!< [17..17] Interrupt pending status of line 17                              */
      __IO uint32_t PD18       : 1;            /*!< [18..18] Interrupt pending status of line 18                              */
            uint32_t            : 13;
    } PD_b;
  } ;
} EXTI_Type;                                    /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                            FMC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief FMC (FMC)
  */

typedef struct {                                /*!< (@ 0x40022000) FMC Structure                                              */

  union {
    __IO uint32_t WS;                          /*!< (@ 0x00000000) wait state counter register                                */

    struct {
      __IO uint32_t WSCNT      : 3;            /*!< [2..0] wait state counter register                                        */
            uint32_t            : 29;
    } WS_b;
  } ;

  union {
    __O  uint32_t KEY0;                        /*!< (@ 0x00000004) Unlock key register 0                                      */

    struct {
      __O  uint32_t KEY        : 32;           /*!< [31..0] FMC_CTL0 unlock key                                               */
    } KEY0_b;
  } ;

  union {
    __O  uint32_t OBKEY;                       /*!< (@ 0x00000008) Option byte unlock key register                            */

    struct {
      __O  uint32_t OBKEY      : 32;           /*!< [31..0] FMC_ CTL0 option byte operation unlock register                   */
    } OBKEY_b;
  } ;

  union {
    __IO uint32_t STAT0;                       /*!< (@ 0x0000000C) Status register 0                                          */

    struct {
      __I  uint32_t BUSY       : 1;            /*!< [0..0] The flash is busy bit                                              */
            uint32_t            : 1;
      __IO uint32_t PGERR      : 1;            /*!< [2..2] Program error flag bit                                             */
            uint32_t            : 1;
      __IO uint32_t WPERR      : 1;            /*!< [4..4] Erase/Program protection error flag bit                            */
      __IO uint32_t ENDF       : 1;            /*!< [5..5] End of operation flag bit                                          */
            uint32_t            : 26;
    } STAT0_b;
  } ;

  union {
    __IO uint32_t CTL0;                        /*!< (@ 0x00000010) Control register 0                                         */

    struct {
      __IO uint32_t PG         : 1;            /*!< [0..0] Main flash program for bank0 command bit                           */
      __IO uint32_t PER        : 1;            /*!< [1..1] Main flash page erase for bank0 command bit                        */
      __IO uint32_t MER        : 1;            /*!< [2..2] Main flash mass erase for bank0 command bit                        */
            uint32_t            : 1;
      __IO uint32_t OBPG       : 1;            /*!< [4..4] Option bytes program command bit                                   */
      __IO uint32_t OBER       : 1;            /*!< [5..5] Option bytes erase command bit                                     */
      __IO uint32_t START      : 1;            /*!< [6..6] Send erase command to FMC bit                                      */
      __IO uint32_t LK         : 1;            /*!< [7..7] FMC_CTL0 lock bit                                                  */
            uint32_t            : 1;
      __IO uint32_t OBWEN      : 1;            /*!< [9..9] Option byte erase/program enable bit                               */
      __IO uint32_t ERRIE      : 1;            /*!< [10..10] Error interrupt enable bit                                       */
            uint32_t            : 1;
      __IO uint32_t ENDIE      : 1;            /*!< [12..12] End of operation interrupt enable bit                            */
            uint32_t            : 19;
    } CTL0_b;
  } ;

  union {
    __O  uint32_t ADDR0;                       /*!< (@ 0x00000014) Address register 0                                         */

