RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __O  uint32_t ADDR       : 32;           /*!< [31..0] Flash erase/program command address bits                          */
    } ADDR0_b;
  } ;
  __I  uint32_t  RESERVED;

  union {
    __I  uint32_t OBSTAT;                      /*!< (@ 0x0000001C) Option byte status register                                */

    struct {
      __I  uint32_t OBERR      : 1;            /*!< [0..0] Option bytes read error bit                                        */
      __I  uint32_t SPC        : 1;            /*!< [1..1] Option bytes security protection code                              */
      __I  uint32_t USER       : 8;            /*!< [9..2] Store USER of option bytes block after system reset                */
      __I  uint32_t DATA       : 16;           /*!< [25..10] Store DATA[15:0] of option bytes block after system
                                                     reset                                                                     */
            uint32_t            : 6;
    } OBSTAT_b;
  } ;

  union {
    __I  uint32_t WP;                          /*!< (@ 0x00000020) Erase/Program Protection register                          */

    struct {
      __I  uint32_t WP         : 32;           /*!< [31..0] Store WP[31:0] of option bytes block after system reset           */
    } WP_b;
  } ;
  __I  uint32_t  RESERVED1[55];

  union {
    __I  uint32_t PID;                         /*!< (@ 0x00000100) Product ID register                                        */

    struct {
      __I  uint32_t PID        : 32;           /*!< [31..0] Product reserved ID code register                                 */
    } PID_b;
  } ;
} FMC_Type;                                     /*!< Size = 260 (0x104)                                                        */



/* =========================================================================================================================== */
/* ================                                           FWDGT                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief free watchdog timer (FWDGT)
  */

typedef struct {                                /*!< (@ 0x40003000) FWDGT Structure                                            */

  union {
    __O  uint32_t CTL;                         /*!< (@ 0x00000000) Control register                                           */

    struct {
      __O  uint32_t CMD        : 16;           /*!< [15..0] Key value                                                         */
            uint32_t            : 16;
    } CTL_b;
  } ;

  union {
    __IO uint32_t PSC;                         /*!< (@ 0x00000004) Prescaler register                                         */

    struct {
      __IO uint32_t PSC        : 3;            /*!< [2..0] Free watchdog timer prescaler selection                            */
            uint32_t            : 29;
    } PSC_b;
  } ;

  union {
    __IO uint32_t RLD;                         /*!< (@ 0x00000008) Reload register                                            */

    struct {
      __IO uint32_t RLD        : 12;           /*!< [11..0] Free watchdog timer counter reload value                          */
            uint32_t            : 20;
    } RLD_b;
  } ;

  union {
    __I  uint32_t STAT;                        /*!< (@ 0x0000000C) Status register                                            */

    struct {
      __I  uint32_t PUD        : 1;            /*!< [0..0] Free watchdog timer prescaler value update                         */
      __I  uint32_t RUD        : 1;            /*!< [1..1] Free watchdog timer counter reload value update                    */
            uint32_t            : 30;
    } STAT_b;
  } ;
} FWDGT_Type;                                   /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIO)
  */

typedef struct {                                /*!< (@ 0x40010800) GPIO Structure                                            */

  union {
    __IO uint32_t CTL0;                        /*!< (@ 0x00000000) port control register 0                                    */

    struct {
      __IO uint32_t MD0        : 2;            /*!< [1..0] Port x mode bits (x = 0)                                           */
      __IO uint32_t CTL0       : 2;            /*!< [3..2] Port x configuration bits (x = 0)                                  */
      __IO uint32_t MD1        : 2;            /*!< [5..4] Port x mode bits (x = 1)                                           */
      __IO uint32_t CTL1       : 2;            /*!< [7..6] Port x configuration bits (x = 1)                                  */
      __IO uint32_t MD2        : 2;            /*!< [9..8] Port x mode bits (x = 2 )                                          */
      __IO uint32_t CTL2       : 2;            /*!< [11..10] Port x configuration bits (x = 2)                                */
      __IO uint32_t MD3        : 2;            /*!< [13..12] Port x mode bits (x = 3 )                                        */
      __IO uint32_t CTL3       : 2;            /*!< [15..14] Port x configuration bits (x = 3)                                */
      __IO uint32_t MD4        : 2;            /*!< [17..16] Port x mode bits (x = 4)                                         */
      __IO uint32_t CTL4       : 2;            /*!< [19..18] Port x configuration bits (x = 4)                                */
      __IO uint32_t MD5        : 2;            /*!< [21..20] Port x mode bits (x = 5)                                         */
      __IO uint32_t CTL5       : 2;            /*!< [23..22] Port x configuration bits (x = 5)                                */
      __IO uint32_t MD6        : 2;            /*!< [25..24] Port x mode bits (x = 6)                                         */
      __IO uint32_t CTL6       : 2;            /*!< [27..26] Port x configuration bits (x = 6)                                */
      __IO uint32_t MD7        : 2;            /*!< [29..28] Port x mode bits (x = 7)                                         */
      __IO uint32_t CTL7       : 2;            /*!< [31..30] Port x configuration bits (x = 7)                                */
    } CTL0_b;
  } ;

  union {
    __IO uint32_t CTL1;                        /*!< (@ 0x00000004) port control register 1                                    */

