RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t MD8        : 2;            /*!< [1..0] Port x mode bits (x = 8)                                           */
      __IO uint32_t CTL8       : 2;            /*!< [3..2] Port x configuration bits (x = 8)                                  */
      __IO uint32_t MD9        : 2;            /*!< [5..4] Port x mode bits (x = 9)                                           */
      __IO uint32_t CTL9       : 2;            /*!< [7..6] Port x configuration bits (x = 9)                                  */
      __IO uint32_t MD10       : 2;            /*!< [9..8] Port x mode bits (x = 10 )                                         */
      __IO uint32_t CTL10      : 2;            /*!< [11..10] Port x configuration bits (x = 10)                               */
      __IO uint32_t MD11       : 2;            /*!< [13..12] Port x mode bits (x = 11 )                                       */
      __IO uint32_t CTL11      : 2;            /*!< [15..14] Port x configuration bits (x = 11)                               */
      __IO uint32_t MD12       : 2;            /*!< [17..16] Port x mode bits (x = 12)                                        */
      __IO uint32_t CTL12      : 2;            /*!< [19..18] Port x configuration bits (x = 12)                               */
      __IO uint32_t MD13       : 2;            /*!< [21..20] Port x mode bits (x = 13)                                        */
      __IO uint32_t CTL13      : 2;            /*!< [23..22] Port x configuration bits (x = 13)                               */
      __IO uint32_t MD14       : 2;            /*!< [25..24] Port x mode bits (x = 14)                                        */
      __IO uint32_t CTL14      : 2;            /*!< [27..26] Port x configuration bits (x = 14)                               */
      __IO uint32_t MD15       : 2;            /*!< [29..28] Port x mode bits (x = 15)                                        */
      __IO uint32_t CTL15      : 2;            /*!< [31..30] Port x configuration bits (x = 15)                               */
    } CTL1_b;
  } ;

  union {
    __I  uint32_t ISTAT;                       /*!< (@ 0x00000008) Port input status register                                 */

    struct {
      __I  uint32_t ISTAT0     : 1;            /*!< [0..0] Port input status                                                  */
      __I  uint32_t ISTAT1     : 1;            /*!< [1..1] Port input status                                                  */
      __I  uint32_t ISTAT2     : 1;            /*!< [2..2] Port input status                                                  */
      __I  uint32_t ISTAT3     : 1;            /*!< [3..3] Port input status                                                  */
      __I  uint32_t ISTAT4     : 1;            /*!< [4..4] Port input status                                                  */
      __I  uint32_t ISTAT5     : 1;            /*!< [5..5] Port input status                                                  */
      __I  uint32_t ISTAT6     : 1;            /*!< [6..6] Port input status                                                  */
      __I  uint32_t ISTAT7     : 1;            /*!< [7..7] Port input status                                                  */
      __I  uint32_t ISTAT8     : 1;            /*!< [8..8] Port input status                                                  */
      __I  uint32_t ISTAT9     : 1;            /*!< [9..9] Port input status                                                  */
      __I  uint32_t ISTAT10    : 1;            /*!< [10..10] Port input status                                                */
      __I  uint32_t ISTAT11    : 1;            /*!< [11..11] Port input status                                                */
      __I  uint32_t ISTAT12    : 1;            /*!< [12..12] Port input status                                                */
      __I  uint32_t ISTAT13    : 1;            /*!< [13..13] Port input status                                                */
      __I  uint32_t ISTAT14    : 1;            /*!< [14..14] Port input status                                                */
      __I  uint32_t ISTAT15    : 1;            /*!< [15..15] Port input status                                                */
            uint32_t            : 16;
    } ISTAT_b;
  } ;

  union {
    __IO uint32_t OCTL;                        /*!< (@ 0x0000000C) Port output control register                               */

    struct {
      __IO uint32_t OCTL0      : 1;            /*!< [0..0] Port output control                                                */
      __IO uint32_t OCTL1      : 1;            /*!< [1..1] Port output control                                                */
      __IO uint32_t OCTL2      : 1;            /*!< [2..2] Port output control                                                */
      __IO uint32_t OCTL3      : 1;            /*!< [3..3] Port output control                                                */
      __IO uint32_t OCTL4      : 1;            /*!< [4..4] Port output control                                                */
      __IO uint32_t OCTL5      : 1;            /*!< [5..5] Port output control                                                */
      __IO uint32_t OCTL6      : 1;            /*!< [6..6] Port output control                                                */
      __IO uint32_t OCTL7      : 1;            /*!< [7..7] Port output control                                                */
      __IO uint32_t OCTL8      : 1;            /*!< [8..8] Port output control                                                */
      __IO uint32_t OCTL9      : 1;            /*!< [9..9] Port output control                                                */
      __IO uint32_t OCTL10     : 1;            /*!< [10..10] Port output control                                              */
      __IO uint32_t OCTL11     : 1;            /*!< [11..11] Port output control                                              */
      __IO uint32_t OCTL12     : 1;            /*!< [12..12] Port output control                                              */
      __IO uint32_t OCTL13     : 1;            /*!< [13..13] Port output control                                              */
      __IO uint32_t OCTL14     : 1;            /*!< [14..14] Port output control                                              */
      __IO uint32_t OCTL15     : 1;            /*!< [15..15] Port output control                                              */
            uint32_t            : 16;
    } OCTL_b;
  } ;

  union {
    __O  uint32_t BOP;                         /*!< (@ 0x00000010) Port bit operate register                                  */

