RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __O  uint32_t BOP0       : 1;            /*!< [0..0] Port 0 Set bit                                                     */
      __O  uint32_t BOP1       : 1;            /*!< [1..1] Port 1 Set bit                                                     */
      __O  uint32_t BOP2       : 1;            /*!< [2..2] Port 2 Set bit                                                     */
      __O  uint32_t BOP3       : 1;            /*!< [3..3] Port 3 Set bit                                                     */
      __O  uint32_t BOP4       : 1;            /*!< [4..4] Port 4 Set bit                                                     */
      __O  uint32_t BOP5       : 1;            /*!< [5..5] Port 5 Set bit                                                     */
      __O  uint32_t BOP6       : 1;            /*!< [6..6] Port 6 Set bit                                                     */
      __O  uint32_t BOP7       : 1;            /*!< [7..7] Port 7 Set bit                                                     */
      __O  uint32_t BOP8       : 1;            /*!< [8..8] Port 8 Set bit                                                     */
      __O  uint32_t BOP9       : 1;            /*!< [9..9] Port 9 Set bit                                                     */
      __O  uint32_t BOP10      : 1;            /*!< [10..10] Port 10 Set bit                                                  */
      __O  uint32_t BOP11      : 1;            /*!< [11..11] Port 11 Set bit                                                  */
      __O  uint32_t BOP12      : 1;            /*!< [12..12] Port 12 Set bit                                                  */
      __O  uint32_t BOP13      : 1;            /*!< [13..13] Port 13 Set bit                                                  */
      __O  uint32_t BOP14      : 1;            /*!< [14..14] Port 14 Set bit                                                  */
      __O  uint32_t BOP15      : 1;            /*!< [15..15] Port 15 Set bit                                                  */
      __O  uint32_t CR0        : 1;            /*!< [16..16] Port 0 Clear bit                                                 */
      __O  uint32_t CR1        : 1;            /*!< [17..17] Port 1 Clear bit                                                 */
      __O  uint32_t CR2        : 1;            /*!< [18..18] Port 2 Clear bit                                                 */
      __O  uint32_t CR3        : 1;            /*!< [19..19] Port 3 Clear bit                                                 */
      __O  uint32_t CR4        : 1;            /*!< [20..20] Port 4 Clear bit                                                 */
      __O  uint32_t CR5        : 1;            /*!< [21..21] Port 5 Clear bit                                                 */
      __O  uint32_t CR6        : 1;            /*!< [22..22] Port 6 Clear bit                                                 */
      __O  uint32_t CR7        : 1;            /*!< [23..23] Port 7 Clear bit                                                 */
      __O  uint32_t CR8        : 1;            /*!< [24..24] Port 8 Clear bit                                                 */
      __O  uint32_t CR9        : 1;            /*!< [25..25] Port 9 Clear bit                                                 */
      __O  uint32_t CR10       : 1;            /*!< [26..26] Port 10 Clear bit                                                */
      __O  uint32_t CR11       : 1;            /*!< [27..27] Port 11 Clear bit                                                */
      __O  uint32_t CR12       : 1;            /*!< [28..28] Port 12 Clear bit                                                */
      __O  uint32_t CR13       : 1;            /*!< [29..29] Port 13 Clear bit                                                */
      __O  uint32_t CR14       : 1;            /*!< [30..30] Port 14 Clear bit                                                */
      __O  uint32_t CR15       : 1;            /*!< [31..31] Port 15 Clear bit                                                */
    } BOP_b;
  } ;

  union {
    __O  uint32_t BC;                          /*!< (@ 0x00000014) Port bit clear register                                    */

    struct {
      __O  uint32_t CR0        : 1;            /*!< [0..0] Port 0 Clear bit                                                   */
      __O  uint32_t CR1        : 1;            /*!< [1..1] Port 1 Clear bit                                                   */
      __O  uint32_t CR2        : 1;            /*!< [2..2] Port 2 Clear bit                                                   */
      __O  uint32_t CR3        : 1;            /*!< [3..3] Port 3 Clear bit                                                   */
      __O  uint32_t CR4        : 1;            /*!< [4..4] Port 4 Clear bit                                                   */
      __O  uint32_t CR5        : 1;            /*!< [5..5] Port 5 Clear bit                                                   */
      __O  uint32_t CR6        : 1;            /*!< [6..6] Port 6 Clear bit                                                   */
      __O  uint32_t CR7        : 1;            /*!< [7..7] Port 7 Clear bit                                                   */
      __O  uint32_t CR8        : 1;            /*!< [8..8] Port 8 Clear bit                                                   */
      __O  uint32_t CR9        : 1;            /*!< [9..9] Port 9 Clear bit                                                   */
      __O  uint32_t CR10       : 1;            /*!< [10..10] Port 10 Clear bit                                                */
      __O  uint32_t CR11       : 1;            /*!< [11..11] Port 11 Clear bit                                                */
      __O  uint32_t CR12       : 1;            /*!< [12..12] Port 12 Clear bit                                                */
      __O  uint32_t CR13       : 1;            /*!< [13..13] Port 13 Clear bit                                                */
      __O  uint32_t CR14       : 1;            /*!< [14..14] Port 14 Clear bit                                                */
      __O  uint32_t CR15       : 1;            /*!< [15..15] Port 15 Clear bit                                                */
            uint32_t            : 16;
    } BC_b;
  } ;

  union {
    __IO uint32_t LOCK;                        /*!< (@ 0x00000018) GPIO port configuration lock register                      */

