RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t LK0        : 1;            /*!< [0..0] Port Lock bit 0                                                    */
      __IO uint32_t LK1        : 1;            /*!< [1..1] Port Lock bit 1                                                    */
      __IO uint32_t LK2        : 1;            /*!< [2..2] Port Lock bit 2                                                    */
      __IO uint32_t LK3        : 1;            /*!< [3..3] Port Lock bit 3                                                    */
      __IO uint32_t LK4        : 1;            /*!< [4..4] Port Lock bit 4                                                    */
      __IO uint32_t LK5        : 1;            /*!< [5..5] Port Lock bit 5                                                    */
      __IO uint32_t LK6        : 1;            /*!< [6..6] Port Lock bit 6                                                    */
      __IO uint32_t LK7        : 1;            /*!< [7..7] Port Lock bit 7                                                    */
      __IO uint32_t LK8        : 1;            /*!< [8..8] Port Lock bit 8                                                    */
      __IO uint32_t LK9        : 1;            /*!< [9..9] Port Lock bit 9                                                    */
      __IO uint32_t LK10       : 1;            /*!< [10..10] Port Lock bit 10                                                 */
      __IO uint32_t LK11       : 1;            /*!< [11..11] Port Lock bit 11                                                 */
      __IO uint32_t LK12       : 1;            /*!< [12..12] Port Lock bit 12                                                 */
      __IO uint32_t LK13       : 1;            /*!< [13..13] Port Lock bit 13                                                 */
      __IO uint32_t LK14       : 1;            /*!< [14..14] Port Lock bit 14                                                 */
      __IO uint32_t LK15       : 1;            /*!< [15..15] Port Lock bit 15                                                 */
      __IO uint32_t LKK        : 1;            /*!< [16..16] Lock sequence key                                                */
            uint32_t            : 15;
    } LOCK_b;
  } ;
} GPIO_Type;                                   /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                           I2C0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter integrated circuit (I2C0)
  */

typedef struct {                                /*!< (@ 0x40005400) I2C0 Structure                                             */

  union {
    __IO uint16_t CTL0;                        /*!< (@ 0x00000000) Control register 0                                         */

    struct {
      __IO uint16_t I2CEN      : 1;            /*!< [0..0] I2C peripheral enable                                              */
      __IO uint16_t SMBEN      : 1;            /*!< [1..1] SMBus/I2C mode switch                                              */
            uint16_t            : 1;
      __IO uint16_t SMBSEL     : 1;            /*!< [3..3] SMBusType Selection                                                */
      __IO uint16_t ARPEN      : 1;            /*!< [4..4] ARP protocol in SMBus switch                                       */
      __IO uint16_t PECEN      : 1;            /*!< [5..5] PEC Calculation Switch                                             */
      __IO uint16_t GCEN       : 1;            /*!< [6..6] Whether or not to response to a General Call (0x00)                */
      __IO uint16_t SS         : 1;            /*!< [7..7] Whether to stretch SCL low when data is not ready in
                                                     slave mode                                                                */
      __IO uint16_t START      : 1;            /*!< [8..8] Generate a START condition on I2C bus                              */
      __IO uint16_t STOP       : 1;            /*!< [9..9] Generate a STOP condition on I2C bus                               */
      __IO uint16_t ACKEN      : 1;            /*!< [10..10] Whether or not to send an ACK                                    */
      __IO uint16_t POAP       : 1;            /*!< [11..11] Position of ACK and PEC when receiving                           */
      __IO uint16_t PECTRANS   : 1;            /*!< [12..12] PEC Transfer                                                     */
      __IO uint16_t SALT       : 1;            /*!< [13..13] SMBus alert                                                      */
            uint16_t            : 1;
      __IO uint16_t SRESET     : 1;            /*!< [15..15] Software reset                                                   */
    } CTL0_b;
  } ;
  __I  uint16_t  RESERVED;

  union {
    __IO uint16_t CTL1;                        /*!< (@ 0x00000004) Control register 1                                         */

    struct {
      __IO uint16_t I2CCLK     : 6;            /*!< [5..0] I2C Peripheral clock frequency                                     */
            uint16_t            : 2;
      __IO uint16_t ERRIE      : 1;            /*!< [8..8] Error interrupt enable                                             */
      __IO uint16_t EVIE       : 1;            /*!< [9..9] Event interrupt enable                                             */
      __IO uint16_t BUFIE      : 1;            /*!< [10..10] Buffer interrupt enable                                          */
      __IO uint16_t DMAON      : 1;            /*!< [11..11] DMA mode switch                                                  */
      __IO uint16_t DMALST     : 1;            /*!< [12..12] Flag indicating DMA last transfer                                */
            uint16_t            : 3;
    } CTL1_b;
  } ;
  __I  uint16_t  RESERVED1;

  union {
    __IO uint16_t SADDR0;                      /*!< (@ 0x00000008) Slave address register 0                                   */

