RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint16_t ADDRESS0   : 1;            /*!< [0..0] Bit 0 of a 10-bit address                                          */
      __IO uint16_t ADDRESS7_1 : 7;            /*!< [7..1] 7-bit address or bits 7:1 of a 10-bit address                      */
      __IO uint16_t ADDRESS9_8 : 2;            /*!< [9..8] Highest two bits of a 10-bit address                               */
            uint16_t            : 5;
      __IO uint16_t ADDFORMAT  : 1;            /*!< [15..15] Address mode for the I2C slave                                   */
    } SADDR0_b;
  } ;
  __I  uint16_t  RESERVED2;

  union {
    __IO uint16_t SADDR1;                      /*!< (@ 0x0000000C) Slave address register 1                                   */

    struct {
      __IO uint16_t DUADEN     : 1;            /*!< [0..0] Dual-Address mode switch                                           */
      __IO uint16_t ADDRESS2   : 7;            /*!< [7..1] Second I2C address for the slave in Dual-Address mode              */
            uint16_t            : 8;
    } SADDR1_b;
  } ;
  __I  uint16_t  RESERVED3;

  union {
    __IO uint16_t DATA;                        /*!< (@ 0x00000010) Transfer buffer register                                   */

    struct {
      __IO uint16_t TRB        : 8;            /*!< [7..0] Transmission or reception data buffer register                     */
            uint16_t            : 8;
    } DATA_b;
  } ;
  __I  uint16_t  RESERVED4;

  union {
    __IO uint16_t STAT0;                       /*!< (@ 0x00000014) Transfer status register 0                                 */

    struct {
      __I  uint16_t SBSEND     : 1;            /*!< [0..0] START condition sent out in master mode                            */
      __I  uint16_t ADDSEND    : 1;            /*!< [1..1] Address is sent in master mode or received and matches
                                                     in slave mode                                                             */
      __I  uint16_t BTC        : 1;            /*!< [2..2] Byte transmission completed                                        */
      __I  uint16_t ADD10SEND  : 1;            /*!< [3..3] Header of 10-bit address is sent in master mode                    */
      __I  uint16_t STPDET     : 1;            /*!< [4..4] STOP condition detected in slave mode                              */
            uint16_t            : 1;
      __I  uint16_t RBNE       : 1;            /*!< [6..6] I2C_DATA is not Empty during receiving                             */
      __I  uint16_t TBE        : 1;            /*!< [7..7] I2C_DATA is Empty during transmitting                              */
      __IO uint16_t BERR       : 1;            /*!< [8..8] A bus error occurs indication a unexpected START or STOP
                                                     condition on I2C bus                                                      */
      __IO uint16_t LOSTARB    : 1;            /*!< [9..9] Arbitration Lost in master mode                                    */
      __IO uint16_t AERR       : 1;            /*!< [10..10] Acknowledge error                                                */
      __IO uint16_t OUERR      : 1;            /*!< [11..11] Over-run or under-run situation occurs in slave mode             */
      __IO uint16_t PECERR     : 1;            /*!< [12..12] PEC error when receiving data                                    */
            uint16_t            : 1;
      __IO uint16_t SMBTO      : 1;            /*!< [14..14] Timeout signal in SMBus mode                                     */
      __IO uint16_t SMBALT     : 1;            /*!< [15..15] SMBus Alert status                                               */
    } STAT0_b;
  } ;
  __I  uint16_t  RESERVED5;

  union {
    __I  uint16_t STAT1;                       /*!< (@ 0x00000018) Transfer status register 1                                 */

    struct {
      __I  uint16_t MASTER     : 1;            /*!< [0..0] A flag indicating whether I2C block is in master or slave
                                                     mode                                                                      */
      __I  uint16_t I2CBSY     : 1;            /*!< [1..1] Busy flag                                                          */
      __I  uint16_t TR         : 1;            /*!< [2..2] Whether the I2C is a transmitter or a receiver                     */
            uint16_t            : 1;
      __I  uint16_t RXGC       : 1;            /*!< [4..4] General call address (00h) received                                */
      __I  uint16_t DEFSMB     : 1;            /*!< [5..5] Default address of SMBusDevice                                     */
      __I  uint16_t HSTSMB     : 1;            /*!< [6..6] SMBus Host Header detected in slave mode                           */
      __I  uint16_t DUMODF     : 1;            /*!< [7..7] Dual Flag in slave mode                                            */
      __I  uint16_t PECV       : 8;            /*!< [15..8] Packet Error Checking Value that calculated by hardware
                                                     when PEC is enabled                                                       */
    } STAT1_b;
  } ;
  __I  uint16_t  RESERVED6;

  union {
    __IO uint16_t CKCFG;                       /*!< (@ 0x0000001C) Clock configure register                                   */

    struct {
      __IO uint16_t CLKC       : 12;           /*!< [11..0] I2C Clock control in master mode                                  */
            uint16_t            : 2;
      __IO uint16_t DTCY       : 1;            /*!< [14..14] Duty cycle in fast mode                                          */
      __IO uint16_t FAST       : 1;            /*!< [15..15] I2C speed selection in master mode                               */
    } CKCFG_b;
  } ;
  __I  uint16_t  RESERVED7;

  union {
    __IO uint16_t RT;                          /*!< (@ 0x00000020) Rise time register                                         */

