RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint16_t RISETIME   : 6;            /*!< [5..0] Maximum rise time in master mode                                   */
            uint16_t            : 10;
    } RT_b;
  } ;
} I2C_Type;                                    /*!< Size = 34 (0x22)                                                          */



/* =========================================================================================================================== */
/* ================                                           ECLIC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Enhanced Core Local Interrupt Controller (ECLIC)
  */

typedef struct {                                /*!< (@ 0xD2000000) ECLIC Structure                                            */

  union {
    __IO uint8_t CLICCFG;                      /*!< (@ 0x00000000) cliccfg Register                                           */

    struct {
            uint8_t             : 1;
      __IO uint8_t NLBITS      : 4;            /*!< [4..1] NLBITS                                                             */
            uint8_t             : 3;
    } CLICCFG_b;
  } ;
  __I  uint8_t   RESERVED;
  __I  uint16_t  RESERVED1;

  union {
    __I  uint32_t CLICINFO;                    /*!< (@ 0x00000004) clicinfo Register                                          */

    struct {
      __I  uint32_t NUM_INTERRUPT : 13;        /*!< [12..0] NUM_INTERRUPT                                                     */
      __I  uint32_t VERSION    : 8;            /*!< [20..13] VERSION                                                          */
      __I  uint32_t CLICINTCTLBITS : 4;        /*!< [24..21] CLICINTCTLBITS                                                   */
            uint32_t            : 7;
    } CLICINFO_b;
  } ;
  __I  uint16_t  RESERVED2;
  __I  uint8_t   RESERVED3;

  union {
    __IO uint8_t MTH;                          /*!< (@ 0x0000000B) MTH Register                                               */

    struct {
      __IO uint8_t MTH         : 8;            /*!< [7..0] MTH                                                                */
    } MTH_b;
  } ;
  __I  uint32_t  RESERVED4[1021];

  union {
    __IO uint8_t CLICINTIP_0;                  /*!< (@ 0x00001000) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_0_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_0;                  /*!< (@ 0x00001001) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_0_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_0;                /*!< (@ 0x00001002) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_0_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_0;                 /*!< (@ 0x00001003) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_0_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_1;                  /*!< (@ 0x00001004) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_1_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_1;                  /*!< (@ 0x00001005) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_1_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_1;                /*!< (@ 0x00001006) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_1_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_1;                 /*!< (@ 0x00001007) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_1_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_2;                  /*!< (@ 0x00001008) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_2_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_2;                  /*!< (@ 0x00001009) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_2_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_2;                /*!< (@ 0x0000100A) clicintattr Register                                       */

