RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_2_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_2;                 /*!< (@ 0x0000100B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_2_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_3;                  /*!< (@ 0x0000100C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_3_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_3;                  /*!< (@ 0x0000100D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_3_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_3;                /*!< (@ 0x0000100E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_3_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_3;                 /*!< (@ 0x0000100F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_3_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_4;                  /*!< (@ 0x00001010) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_4_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_4;                  /*!< (@ 0x00001011) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_4_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_4;                /*!< (@ 0x00001012) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_4_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_4;                 /*!< (@ 0x00001013) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_4_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_5;                  /*!< (@ 0x00001014) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_5_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_5;                  /*!< (@ 0x00001015) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_5_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_5;                /*!< (@ 0x00001016) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_5_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_5;                 /*!< (@ 0x00001017) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_5_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_6;                  /*!< (@ 0x00001018) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_6_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_6;                  /*!< (@ 0x00001019) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_6_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_6;                /*!< (@ 0x0000101A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_6_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_6;                 /*!< (@ 0x0000101B) clicintctl Register                                        */

