RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_6_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_7;                  /*!< (@ 0x0000101C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_7_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_7;                  /*!< (@ 0x0000101D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_7_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_7;                /*!< (@ 0x0000101E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_7_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_7;                 /*!< (@ 0x0000101F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_7_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_8;                  /*!< (@ 0x00001020) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_8_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_8;                  /*!< (@ 0x00001021) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_8_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_8;                /*!< (@ 0x00001022) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_8_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_8;                 /*!< (@ 0x00001023) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_8_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_9;                  /*!< (@ 0x00001024) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_9_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_9;                  /*!< (@ 0x00001025) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_9_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_9;                /*!< (@ 0x00001026) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_9_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_9;                 /*!< (@ 0x00001027) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_9_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_10;                 /*!< (@ 0x00001028) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_10_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_10;                 /*!< (@ 0x00001029) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_10_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_10;               /*!< (@ 0x0000102A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_10_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_10;                /*!< (@ 0x0000102B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_10_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_11;                 /*!< (@ 0x0000102C) clicintip Register                                         */

