RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_11_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_11;                 /*!< (@ 0x0000102D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_11_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_11;               /*!< (@ 0x0000102E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_11_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_11;                /*!< (@ 0x0000102F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_11_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_12;                 /*!< (@ 0x00001030) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_12_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_12;                 /*!< (@ 0x00001031) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_12_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_12;               /*!< (@ 0x00001032) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_12_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_12;                /*!< (@ 0x00001033) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_12_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_13;                 /*!< (@ 0x00001034) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_13_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_13;                 /*!< (@ 0x00001035) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_13_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_13;               /*!< (@ 0x00001036) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_13_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_13;                /*!< (@ 0x00001037) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_13_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_14;                 /*!< (@ 0x00001038) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_14_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_14;                 /*!< (@ 0x00001039) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_14_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_14;               /*!< (@ 0x0000103A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_14_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_14;                /*!< (@ 0x0000103B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_14_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_15;                 /*!< (@ 0x0000103C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_15_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_15;                 /*!< (@ 0x0000103D) clicintie Register                                         */

