RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_15_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_15;               /*!< (@ 0x0000103E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_15_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_15;                /*!< (@ 0x0000103F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_15_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_16;                 /*!< (@ 0x00001040) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_16_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_16;                 /*!< (@ 0x00001041) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_16_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_16;               /*!< (@ 0x00001042) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_16_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_16;                /*!< (@ 0x00001043) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_16_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_17;                 /*!< (@ 0x00001044) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_17_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_17;                 /*!< (@ 0x00001045) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_17_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_17;               /*!< (@ 0x00001046) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_17_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_17;                /*!< (@ 0x00001047) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_17_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_18;                 /*!< (@ 0x00001048) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_18_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_18;                 /*!< (@ 0x00001049) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_18_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_18;               /*!< (@ 0x0000104A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_18_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_18;                /*!< (@ 0x0000104B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_18_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_19;                 /*!< (@ 0x0000104C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_19_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_19;                 /*!< (@ 0x0000104D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_19_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_19;               /*!< (@ 0x0000104E) clicintattr Register                                       */

