RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_19_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_19;                /*!< (@ 0x0000104F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_19_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_20;                 /*!< (@ 0x00001050) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_20_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_20;                 /*!< (@ 0x00001051) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_20_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_20;               /*!< (@ 0x00001052) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_20_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_20;                /*!< (@ 0x00001053) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_20_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_21;                 /*!< (@ 0x00001054) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_21_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_21;                 /*!< (@ 0x00001055) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_21_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_21;               /*!< (@ 0x00001056) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_21_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_21;                /*!< (@ 0x00001057) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_21_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_22;                 /*!< (@ 0x00001058) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_22_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_22;                 /*!< (@ 0x00001059) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_22_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_22;               /*!< (@ 0x0000105A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_22_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_22;                /*!< (@ 0x0000105B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_22_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_23;                 /*!< (@ 0x0000105C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_23_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_23;                 /*!< (@ 0x0000105D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_23_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_23;               /*!< (@ 0x0000105E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_23_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_23;                /*!< (@ 0x0000105F) clicintctl Register                                        */

