RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_23_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_24;                 /*!< (@ 0x00001060) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_24_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_24;                 /*!< (@ 0x00001061) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_24_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_24;               /*!< (@ 0x00001062) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_24_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_24;                /*!< (@ 0x00001063) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_24_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_25;                 /*!< (@ 0x00001064) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_25_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_25;                 /*!< (@ 0x00001065) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_25_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_25;               /*!< (@ 0x00001066) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_25_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_25;                /*!< (@ 0x00001067) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_25_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_26;                 /*!< (@ 0x00001068) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_26_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_26;                 /*!< (@ 0x00001069) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_26_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_26;               /*!< (@ 0x0000106A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_26_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_26;                /*!< (@ 0x0000106B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_26_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_27;                 /*!< (@ 0x0000106C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_27_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_27;                 /*!< (@ 0x0000106D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_27_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_27;               /*!< (@ 0x0000106E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_27_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_27;                /*!< (@ 0x0000106F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_27_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_28;                 /*!< (@ 0x00001070) clicintip Register                                         */

