RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_28_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_28;                 /*!< (@ 0x00001071) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_28_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_28;               /*!< (@ 0x00001072) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_28_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_28;                /*!< (@ 0x00001073) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_28_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_29;                 /*!< (@ 0x00001074) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_29_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_29;                 /*!< (@ 0x00001075) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_29_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_29;               /*!< (@ 0x00001076) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_29_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_29;                /*!< (@ 0x00001077) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_29_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_30;                 /*!< (@ 0x00001078) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_30_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_30;                 /*!< (@ 0x00001079) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_30_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_30;               /*!< (@ 0x0000107A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_30_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_30;                /*!< (@ 0x0000107B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_30_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_31;                 /*!< (@ 0x0000107C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_31_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_31;                 /*!< (@ 0x0000107D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_31_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_31;               /*!< (@ 0x0000107E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_31_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_31;                /*!< (@ 0x0000107F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_31_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_32;                 /*!< (@ 0x00001080) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_32_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_32;                 /*!< (@ 0x00001081) clicintie Register                                         */

