RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_32_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_32;               /*!< (@ 0x00001082) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_32_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_32;                /*!< (@ 0x00001083) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_32_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_33;                 /*!< (@ 0x00001084) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_33_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_33;                 /*!< (@ 0x00001085) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_33_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_33;               /*!< (@ 0x00001086) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_33_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_33;                /*!< (@ 0x00001087) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_33_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_34;                 /*!< (@ 0x00001088) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_34_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_34;                 /*!< (@ 0x00001089) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_34_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_34;               /*!< (@ 0x0000108A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_34_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_34;                /*!< (@ 0x0000108B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_34_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_35;                 /*!< (@ 0x0000108C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_35_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_35;                 /*!< (@ 0x0000108D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_35_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_35;               /*!< (@ 0x0000108E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_35_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_35;                /*!< (@ 0x0000108F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_35_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_36;                 /*!< (@ 0x00001090) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_36_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_36;                 /*!< (@ 0x00001091) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_36_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_36;               /*!< (@ 0x00001092) clicintattr Register                                       */

