RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_36_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_36;                /*!< (@ 0x00001093) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_36_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_37;                 /*!< (@ 0x00001094) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_37_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_37;                 /*!< (@ 0x00001095) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_37_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_37;               /*!< (@ 0x00001096) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_37_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_37;                /*!< (@ 0x00001097) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_37_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_38;                 /*!< (@ 0x00001098) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_38_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_38;                 /*!< (@ 0x00001099) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_38_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_38;               /*!< (@ 0x0000109A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_38_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_38;                /*!< (@ 0x0000109B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_38_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_39;                 /*!< (@ 0x0000109C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_39_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_39;                 /*!< (@ 0x0000109D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_39_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_39;               /*!< (@ 0x0000109E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_39_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_39;                /*!< (@ 0x0000109F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_39_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_40;                 /*!< (@ 0x000010A0) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_40_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_40;                 /*!< (@ 0x000010A1) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_40_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_40;               /*!< (@ 0x000010A2) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_40_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_40;                /*!< (@ 0x000010A3) clicintctl Register                                        */

