RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_40_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_41;                 /*!< (@ 0x000010A4) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_41_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_41;                 /*!< (@ 0x000010A5) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_41_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_41;               /*!< (@ 0x000010A6) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_41_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_41;                /*!< (@ 0x000010A7) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_41_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_42;                 /*!< (@ 0x000010A8) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_42_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_42;                 /*!< (@ 0x000010A9) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_42_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_42;               /*!< (@ 0x000010AA) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_42_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_42;                /*!< (@ 0x000010AB) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_42_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_43;                 /*!< (@ 0x000010AC) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_43_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_43;                 /*!< (@ 0x000010AD) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_43_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_43;               /*!< (@ 0x000010AE) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_43_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_43;                /*!< (@ 0x000010AF) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_43_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_44;                 /*!< (@ 0x000010B0) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_44_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_44;                 /*!< (@ 0x000010B1) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_44_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_44;               /*!< (@ 0x000010B2) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_44_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_44;                /*!< (@ 0x000010B3) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_44_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_45;                 /*!< (@ 0x000010B4) clicintip Register                                         */

