RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_45_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_45;                 /*!< (@ 0x000010B5) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_45_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_45;               /*!< (@ 0x000010B6) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_45_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_45;                /*!< (@ 0x000010B7) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_45_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_46;                 /*!< (@ 0x000010B8) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_46_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_46;                 /*!< (@ 0x000010B9) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_46_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_46;               /*!< (@ 0x000010BA) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_46_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_46;                /*!< (@ 0x000010BB) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_46_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_47;                 /*!< (@ 0x000010BC) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_47_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_47;                 /*!< (@ 0x000010BD) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_47_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_47;               /*!< (@ 0x000010BE) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_47_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_47;                /*!< (@ 0x000010BF) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_47_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_48;                 /*!< (@ 0x000010C0) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_48_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_48;                 /*!< (@ 0x000010C1) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_48_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_48;               /*!< (@ 0x000010C2) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_48_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_48;                /*!< (@ 0x000010C3) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_48_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_49;                 /*!< (@ 0x000010C4) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_49_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_49;                 /*!< (@ 0x000010C5) clicintie Register                                         */

