RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_49_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_49;               /*!< (@ 0x000010C6) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_49_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_49;                /*!< (@ 0x000010C7) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_49_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_50;                 /*!< (@ 0x000010C8) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_50_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_50;                 /*!< (@ 0x000010C9) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_50_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_50;               /*!< (@ 0x000010CA) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_50_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_50;                /*!< (@ 0x000010CB) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_50_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_51;                 /*!< (@ 0x000010CC) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_51_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_51;                 /*!< (@ 0x000010CD) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_51_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_51;               /*!< (@ 0x000010CE) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_51_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_51;                /*!< (@ 0x000010CF) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_51_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_52;                 /*!< (@ 0x000010D0) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_52_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_52;                 /*!< (@ 0x000010D1) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_52_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_52;               /*!< (@ 0x000010D2) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_52_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_52;                /*!< (@ 0x000010D3) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_52_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_53;                 /*!< (@ 0x000010D4) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_53_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_53;                 /*!< (@ 0x000010D5) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_53_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_53;               /*!< (@ 0x000010D6) clicintattr Register                                       */

