RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_53_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_53;                /*!< (@ 0x000010D7) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_53_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_54;                 /*!< (@ 0x000010D8) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_54_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_54;                 /*!< (@ 0x000010D9) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_54_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_54;               /*!< (@ 0x000010DA) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_54_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_54;                /*!< (@ 0x000010DB) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_54_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_55;                 /*!< (@ 0x000010DC) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_55_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_55;                 /*!< (@ 0x000010DD) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_55_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_55;               /*!< (@ 0x000010DE) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_55_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_55;                /*!< (@ 0x000010DF) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_55_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_56;                 /*!< (@ 0x000010E0) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_56_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_56;                 /*!< (@ 0x000010E1) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_56_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_56;               /*!< (@ 0x000010E2) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_56_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_56;                /*!< (@ 0x000010E3) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_56_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_57;                 /*!< (@ 0x000010E4) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_57_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_57;                 /*!< (@ 0x000010E5) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_57_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_57;               /*!< (@ 0x000010E6) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_57_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_57;                /*!< (@ 0x000010E7) clicintctl Register                                        */

