RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_57_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_58;                 /*!< (@ 0x000010E8) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_58_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_58;                 /*!< (@ 0x000010E9) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_58_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_58;               /*!< (@ 0x000010EA) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_58_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_58;                /*!< (@ 0x000010EB) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_58_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_59;                 /*!< (@ 0x000010EC) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_59_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_59;                 /*!< (@ 0x000010ED) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_59_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_59;               /*!< (@ 0x000010EE) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_59_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_59;                /*!< (@ 0x000010EF) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_59_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_60;                 /*!< (@ 0x000010F0) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_60_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_60;                 /*!< (@ 0x000010F1) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_60_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_60;               /*!< (@ 0x000010F2) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_60_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_60;                /*!< (@ 0x000010F3) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_60_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_61;                 /*!< (@ 0x000010F4) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_61_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_61;                 /*!< (@ 0x000010F5) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_61_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_61;               /*!< (@ 0x000010F6) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_61_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_61;                /*!< (@ 0x000010F7) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_61_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_62;                 /*!< (@ 0x000010F8) clicintip Register                                         */

