RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_62_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_62;                 /*!< (@ 0x000010F9) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_62_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_62;               /*!< (@ 0x000010FA) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_62_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_62;                /*!< (@ 0x000010FB) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_62_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_63;                 /*!< (@ 0x000010FC) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_63_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_63;                 /*!< (@ 0x000010FD) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_63_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_63;               /*!< (@ 0x000010FE) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_63_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_63;                /*!< (@ 0x000010FF) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_63_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_64;                 /*!< (@ 0x00001100) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_64_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_64;                 /*!< (@ 0x00001101) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_64_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_64;               /*!< (@ 0x00001102) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_64_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_64;                /*!< (@ 0x00001103) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_64_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_65;                 /*!< (@ 0x00001104) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_65_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_65;                 /*!< (@ 0x00001105) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_65_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_65;               /*!< (@ 0x00001106) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_65_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_65;                /*!< (@ 0x00001107) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_65_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_66;                 /*!< (@ 0x00001108) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_66_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_66;                 /*!< (@ 0x00001109) clicintie Register                                         */

