RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_66_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_66;               /*!< (@ 0x0000110A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_66_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_66;                /*!< (@ 0x0000110B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_66_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_67;                 /*!< (@ 0x0000110C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_67_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_67;                 /*!< (@ 0x0000110D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_67_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_67;               /*!< (@ 0x0000110E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_67_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_67;                /*!< (@ 0x0000110F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_67_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_68;                 /*!< (@ 0x00001110) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_68_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_68;                 /*!< (@ 0x00001111) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_68_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_68;               /*!< (@ 0x00001112) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_68_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_68;                /*!< (@ 0x00001113) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_68_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_69;                 /*!< (@ 0x00001114) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_69_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_69;                 /*!< (@ 0x00001115) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_69_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_69;               /*!< (@ 0x00001116) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_69_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_69;                /*!< (@ 0x00001117) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_69_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_70;                 /*!< (@ 0x00001118) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_70_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_70;                 /*!< (@ 0x00001119) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_70_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_70;               /*!< (@ 0x0000111A) clicintattr Register                                       */

