RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_70_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_70;                /*!< (@ 0x0000111B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_70_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_71;                 /*!< (@ 0x0000111C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_71_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_71;                 /*!< (@ 0x0000111D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_71_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_71;               /*!< (@ 0x0000111E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_71_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_71;                /*!< (@ 0x0000111F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_71_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_72;                 /*!< (@ 0x00001120) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_72_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_72;                 /*!< (@ 0x00001121) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_72_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_72;               /*!< (@ 0x00001122) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_72_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_72;                /*!< (@ 0x00001123) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_72_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_73;                 /*!< (@ 0x00001124) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_73_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_73;                 /*!< (@ 0x00001125) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_73_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_73;               /*!< (@ 0x00001126) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_73_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_73;                /*!< (@ 0x00001127) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_73_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_74;                 /*!< (@ 0x00001128) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_74_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_74;                 /*!< (@ 0x00001129) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_74_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_74;               /*!< (@ 0x0000112A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_74_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_74;                /*!< (@ 0x0000112B) clicintctl Register                                        */

