RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_74_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_75;                 /*!< (@ 0x0000112C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_75_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_75;                 /*!< (@ 0x0000112D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_75_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_75;               /*!< (@ 0x0000112E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_75_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_75;                /*!< (@ 0x0000112F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_75_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_76;                 /*!< (@ 0x00001130) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_76_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_76;                 /*!< (@ 0x00001131) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_76_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_76;               /*!< (@ 0x00001132) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_76_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_76;                /*!< (@ 0x00001133) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_76_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_77;                 /*!< (@ 0x00001134) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_77_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_77;                 /*!< (@ 0x00001135) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_77_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_77;               /*!< (@ 0x00001136) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_77_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_77;                /*!< (@ 0x00001137) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_77_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_78;                 /*!< (@ 0x00001138) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_78_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_78;                 /*!< (@ 0x00001139) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_78_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_78;               /*!< (@ 0x0000113A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_78_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_78;                /*!< (@ 0x0000113B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_78_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_79;                 /*!< (@ 0x0000113C) clicintip Register                                         */

