RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_79_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_79;                 /*!< (@ 0x0000113D) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_79_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_79;               /*!< (@ 0x0000113E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_79_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_79;                /*!< (@ 0x0000113F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_79_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_80;                 /*!< (@ 0x00001140) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_80_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_80;                 /*!< (@ 0x00001141) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_80_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_80;               /*!< (@ 0x00001142) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_80_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_80;                /*!< (@ 0x00001143) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_80_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_81;                 /*!< (@ 0x00001144) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_81_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_81;                 /*!< (@ 0x00001145) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_81_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_81;               /*!< (@ 0x00001146) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_81_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_81;                /*!< (@ 0x00001147) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_81_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_82;                 /*!< (@ 0x00001148) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_82_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_82;                 /*!< (@ 0x00001149) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_82_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_82;               /*!< (@ 0x0000114A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_82_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_82;                /*!< (@ 0x0000114B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_82_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_83;                 /*!< (@ 0x0000114C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_83_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_83;                 /*!< (@ 0x0000114D) clicintie Register                                         */

