RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_83_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_83;               /*!< (@ 0x0000114E) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_83_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_83;                /*!< (@ 0x0000114F) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_83_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_84;                 /*!< (@ 0x00001150) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_84_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_84;                 /*!< (@ 0x00001151) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_84_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_84;               /*!< (@ 0x00001152) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_84_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_84;                /*!< (@ 0x00001153) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_84_b;
  } ;
  __I  uint8_t   RESERVED5;

  union {
    __IO uint8_t CLICINTIE_85;                 /*!< (@ 0x00001155) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_85_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_85;               /*!< (@ 0x00001156) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_85_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_85;                /*!< (@ 0x00001157) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_85_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_85;                 /*!< (@ 0x00001158) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_85_b;
  } ;

  union {
    __IO uint8_t CLICINTIE_86;                 /*!< (@ 0x00001159) clicintie Register                                         */

    struct {
      __IO uint8_t IE          : 1;            /*!< [0..0] IE                                                                 */
            uint8_t             : 7;
    } CLICINTIE_86_b;
  } ;

  union {
    __IO uint8_t CLICINTATTR_86;               /*!< (@ 0x0000115A) clicintattr Register                                       */

    struct {
      __IO uint8_t SHV         : 1;            /*!< [0..0] SHV                                                                */
      __IO uint8_t TRIG        : 2;            /*!< [2..1] TRIG                                                               */
            uint8_t             : 5;
    } CLICINTATTR_86_b;
  } ;

  union {
    __IO uint8_t CLICINTCTL_86;                /*!< (@ 0x0000115B) clicintctl Register                                        */

    struct {
      __IO uint8_t LEVEL_PRIORITY : 8;         /*!< [7..0] LEVEL_PRIORITY                                                     */
    } CLICINTCTL_86_b;
  } ;

  union {
    __IO uint8_t CLICINTIP_86;                 /*!< (@ 0x0000115C) clicintip Register                                         */

    struct {
      __IO uint8_t IP          : 1;            /*!< [0..0] IP                                                                 */
            uint8_t             : 7;
    } CLICINTIP_86_b;
  } ;
  __I  uint8_t   RESERVED6;
  __I  uint16_t  RESERVED7;
} ECLIC_Type;                                   /*!< Size = 4448 (0x1160)                                                      */



/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power management unit (PMU)
  */

typedef struct {                                /*!< (@ 0x40007000) PMU Structure                                              */

  union {
    __IO uint32_t CTL;                         /*!< (@ 0x00000000) power control register                                     */

