RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t LDOLP      : 1;            /*!< [0..0] LDO Low Power Mode                                                 */
      __IO uint32_t STBMOD     : 1;            /*!< [1..1] Standby Mode                                                       */
      __IO uint32_t WURST      : 1;            /*!< [2..2] Wakeup Flag Reset                                                  */
      __IO uint32_t STBRST     : 1;            /*!< [3..3] Standby Flag Reset                                                 */
      __IO uint32_t LVDEN      : 1;            /*!< [4..4] Low Voltage Detector Enable                                        */
      __IO uint32_t LVDT       : 3;            /*!< [7..5] Low Voltage Detector Threshold                                     */
      __IO uint32_t BKPWEN     : 1;            /*!< [8..8] Backup Domain Write Enable                                         */
            uint32_t            : 23;
    } CTL_b;
  } ;

  union {
    __IO uint32_t CS;                          /*!< (@ 0x00000004) power control/status register                              */

    struct {
      __I  uint32_t WUF        : 1;            /*!< [0..0] Wakeup flag                                                        */
      __I  uint32_t STBF       : 1;            /*!< [1..1] Standby flag                                                       */
      __I  uint32_t LVDF       : 1;            /*!< [2..2] Low Voltage Detector Status Flag                                   */
            uint32_t            : 5;
      __IO uint32_t WUPEN      : 1;            /*!< [8..8] Enable WKUP pin                                                    */
            uint32_t            : 23;
    } CS_b;
  } ;
} PMU_Type;                                     /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                            RCU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset and clock unit (RCU)
  */

typedef struct {                                /*!< (@ 0x40021000) RCU Structure                                              */

  union {
    __IO uint32_t CTL;                         /*!< (@ 0x00000000) Control register                                           */

    struct {
      __IO uint32_t IRC8MEN    : 1;            /*!< [0..0] Internal 8MHz RC oscillator Enable                                 */
      __I  uint32_t IRC8MSTB   : 1;            /*!< [1..1] IRC8M Internal 8MHz RC Oscillator stabilization Flag               */
            uint32_t            : 1;
      __IO uint32_t IRC8MADJ   : 5;            /*!< [7..3] Internal 8MHz RC Oscillator clock trim adjust value                */
      __I  uint32_t IRC8MCALIB : 8;            /*!< [15..8] Internal 8MHz RC Oscillator calibration value register            */
      __IO uint32_t HXTALEN    : 1;            /*!< [16..16] External High Speed oscillator Enable                            */
      __I  uint32_t HXTALSTB   : 1;            /*!< [17..17] External crystal oscillator (HXTAL) clock stabilization
                                                     flag                                                                      */
      __IO uint32_t HXTALBPS   : 1;            /*!< [18..18] External crystal oscillator (HXTAL) clock bypass mode
                                                     enable                                                                    */
      __IO uint32_t CKMEN      : 1;            /*!< [19..19] HXTAL Clock Monitor Enable                                       */
            uint32_t            : 4;
      __IO uint32_t PLLEN      : 1;            /*!< [24..24] PLL enable                                                       */
      __I  uint32_t PLLSTB     : 1;            /*!< [25..25] PLL Clock Stabilization Flag                                     */
      __IO uint32_t PLL1EN     : 1;            /*!< [26..26] PLL1 enable                                                      */
      __I  uint32_t PLL1STB    : 1;            /*!< [27..27] PLL1 Clock Stabilization Flag                                    */
      __IO uint32_t PLL2EN     : 1;            /*!< [28..28] PLL2 enable                                                      */
      __I  uint32_t PLL2STB    : 1;            /*!< [29..29] PLL2 Clock Stabilization Flag                                    */
            uint32_t            : 2;
    } CTL_b;
  } ;

  union {
    __IO uint32_t CFG0;                        /*!< (@ 0x00000004) Clock configuration register 0 (RCU_CFG0)                  */

    struct {
      __IO uint32_t SCS        : 2;            /*!< [1..0] System clock switch                                                */
      __I  uint32_t SCSS       : 2;            /*!< [3..2] System clock switch status                                         */
      __IO uint32_t AHBPSC     : 4;            /*!< [7..4] AHB prescaler selection                                            */
      __IO uint32_t APB1PSC    : 3;            /*!< [10..8] APB1 prescaler selection                                          */
      __IO uint32_t APB2PSC    : 3;            /*!< [13..11] APB2 prescaler selection                                         */
      __IO uint32_t ADCPSC_1_0 : 2;            /*!< [15..14] ADC clock prescaler selection                                    */
      __IO uint32_t PLLSEL     : 1;            /*!< [16..16] PLL Clock Source Selection                                       */
      __IO uint32_t PREDV0_LSB : 1;            /*!< [17..17] The LSB of PREDV0 division factor                                */
      __IO uint32_t PLLMF_3_0  : 4;            /*!< [21..18] The PLL clock multiplication factor                              */
      __IO uint32_t USBFSPSC   : 2;            /*!< [23..22] USBFS clock prescaler selection                                  */
      __IO uint32_t CKOUT0SEL  : 4;            /*!< [27..24] CKOUT0 Clock Source Selection                                    */
      __IO uint32_t ADCPSC_2   : 1;            /*!< [28..28] Bit 2 of ADCPSC                                                  */
      __IO uint32_t PLLMF_4    : 1;            /*!< [29..29] Bit 4 of PLLMF                                                   */
            uint32_t            : 2;
    } CFG0_b;
  } ;

  union {
    __IO uint32_t INT;                         /*!< (@ 0x00000008) Clock interrupt register (RCU_INT)                         */

