RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __I  uint32_t IRC40KSTBIF : 1;           /*!< [0..0] IRC40K stabilization interrupt flag                                */
      __I  uint32_t LXTALSTBIF : 1;            /*!< [1..1] LXTAL stabilization interrupt flag                                 */
      __I  uint32_t IRC8MSTBIF : 1;            /*!< [2..2] IRC8M stabilization interrupt flag                                 */
      __I  uint32_t HXTALSTBIF : 1;            /*!< [3..3] HXTAL stabilization interrupt flag                                 */
      __I  uint32_t PLLSTBIF   : 1;            /*!< [4..4] PLL stabilization interrupt flag                                   */
      __I  uint32_t PLL1STBIF  : 1;            /*!< [5..5] PLL1 stabilization interrupt flag                                  */
      __I  uint32_t PLL2STBIF  : 1;            /*!< [6..6] PLL2 stabilization interrupt flag                                  */
      __I  uint32_t CKMIF      : 1;            /*!< [7..7] HXTAL Clock Stuck Interrupt Flag                                   */
      __IO uint32_t IRC40KSTBIE : 1;           /*!< [8..8] IRC40K Stabilization interrupt enable                              */
      __IO uint32_t LXTALSTBIE : 1;            /*!< [9..9] LXTAL Stabilization Interrupt Enable                               */
      __IO uint32_t IRC8MSTBIE : 1;            /*!< [10..10] IRC8M Stabilization Interrupt Enable                             */
      __IO uint32_t HXTALSTBIE : 1;            /*!< [11..11] HXTAL Stabilization Interrupt Enable                             */
      __IO uint32_t PLLSTBIE   : 1;            /*!< [12..12] PLL Stabilization Interrupt Enable                               */
      __IO uint32_t PLL1STBIE  : 1;            /*!< [13..13] PLL1 Stabilization Interrupt Enable                              */
      __IO uint32_t PLL2STBIE  : 1;            /*!< [14..14] PLL2 Stabilization Interrupt Enable                              */
            uint32_t            : 1;
      __O  uint32_t IRC40KSTBIC : 1;           /*!< [16..16] IRC40K Stabilization Interrupt Clear                             */
      __O  uint32_t LXTALSTBIC : 1;            /*!< [17..17] LXTAL Stabilization Interrupt Clear                              */
      __O  uint32_t IRC8MSTBIC : 1;            /*!< [18..18] IRC8M Stabilization Interrupt Clear                              */
      __O  uint32_t HXTALSTBIC : 1;            /*!< [19..19] HXTAL Stabilization Interrupt Clear                              */
      __O  uint32_t PLLSTBIC   : 1;            /*!< [20..20] PLL stabilization Interrupt Clear                                */
      __O  uint32_t PLL1STBIC  : 1;            /*!< [21..21] PLL1 stabilization Interrupt Clear                               */
      __O  uint32_t PLL2STBIC  : 1;            /*!< [22..22] PLL2 stabilization Interrupt Clear                               */
      __O  uint32_t CKMIC      : 1;            /*!< [23..23] HXTAL Clock Stuck Interrupt Clear                                */
            uint32_t            : 8;
    } INT_b;
  } ;

  union {
    __IO uint32_t APB2RST;                     /*!< (@ 0x0000000C) APB2 reset register (RCU_APB2RST)                          */

    struct {
      __IO uint32_t AFRST      : 1;            /*!< [0..0] Alternate function I/O reset                                       */
            uint32_t            : 1;
      __IO uint32_t PARST      : 1;            /*!< [2..2] GPIO port A reset                                                  */
      __IO uint32_t PBRST      : 1;            /*!< [3..3] GPIO port B reset                                                  */
      __IO uint32_t PCRST      : 1;            /*!< [4..4] GPIO port C reset                                                  */
      __IO uint32_t PDRST      : 1;            /*!< [5..5] GPIO port D reset                                                  */
      __IO uint32_t PERST      : 1;            /*!< [6..6] GPIO port E reset                                                  */
            uint32_t            : 2;
      __IO uint32_t ADC0RST    : 1;            /*!< [9..9] ADC0 reset                                                         */
      __IO uint32_t ADC1RST    : 1;            /*!< [10..10] ADC1 reset                                                       */
      __IO uint32_t TIMER0RST  : 1;            /*!< [11..11] Timer 0 reset                                                    */
      __IO uint32_t SPI0RST    : 1;            /*!< [12..12] SPI0 reset                                                       */
            uint32_t            : 1;
      __IO uint32_t USART0RST  : 1;            /*!< [14..14] USART0 Reset                                                     */
            uint32_t            : 17;
    } APB2RST_b;
  } ;

  union {
    __IO uint32_t APB1RST;                     /*!< (@ 0x00000010) APB1 reset register (RCU_APB1RST)                          */

    struct {
      __IO uint32_t TIMER1RST  : 1;            /*!< [0..0] TIMER1 timer reset                                                 */
      __IO uint32_t TIMER2RST  : 1;            /*!< [1..1] TIMER2 timer reset                                                 */
      __IO uint32_t TIMER3RST  : 1;            /*!< [2..2] TIMER3 timer reset                                                 */
      __IO uint32_t TIMER4RST  : 1;            /*!< [3..3] TIMER4 timer reset                                                 */
      __IO uint32_t TIMER5RST  : 1;            /*!< [4..4] TIMER5 timer reset                                                 */
      __IO uint32_t TIMER6RST  : 1;            /*!< [5..5] TIMER6 timer reset                                                 */
            uint32_t            : 5;
      __IO uint32_t WWDGTRST   : 1;            /*!< [11..11] Window watchdog timer reset                                      */
            uint32_t            : 2;
      __IO uint32_t SPI1RST    : 1;            /*!< [14..14] SPI1 reset                                                       */
      __IO uint32_t SPI2RST    : 1;            /*!< [15..15] SPI2 reset                                                       */
            uint32_t            : 1;
      __IO uint32_t USART1RST  : 1;            /*!< [17..17] USART1 reset                                                     */
      __IO uint32_t USART2RST  : 1;            /*!< [18..18] USART2 reset                                                     */
      __IO uint32_t UART3RST   : 1;            /*!< [19..19] UART3 reset                                                      */
      __IO uint32_t UART4RST   : 1;            /*!< [20..20] UART4 reset                                                      */
      __IO uint32_t I2C0RST    : 1;            /*!< [21..21] I2C0 reset                                                       */
      __IO uint32_t I2C1RST    : 1;            /*!< [22..22] I2C1 reset                                                       */
            uint32_t            : 2;
      __IO uint32_t CAN0RST    : 1;            /*!< [25..25] CAN0 reset                                                       */
      __IO uint32_t CAN1RST    : 1;            /*!< [26..26] CAN1 reset                                                       */
      __IO uint32_t BKPIRST    : 1;            /*!< [27..27] Backup interface reset                                           */
      __IO uint32_t PMURST     : 1;            /*!< [28..28] Power control reset                                              */
      __IO uint32_t DACRST     : 1;            /*!< [29..29] DAC reset                                                        */
            uint32_t            : 2;
    } APB1RST_b;
  } ;

  union {
    __IO uint32_t AHBEN;                       /*!< (@ 0x00000014) AHB enable register                                        */

