RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t DMA0EN     : 1;            /*!< [0..0] DMA0 clock enable                                                  */
      __IO uint32_t DMA1EN     : 1;            /*!< [1..1] DMA1 clock enable                                                  */
      __IO uint32_t SRAMSPEN   : 1;            /*!< [2..2] SRAM interface clock enable when sleep mode                        */
            uint32_t            : 1;
      __IO uint32_t FMCSPEN    : 1;            /*!< [4..4] FMC clock enable when sleep mode                                   */
            uint32_t            : 1;
      __IO uint32_t CRCEN      : 1;            /*!< [6..6] CRC clock enable                                                   */
            uint32_t            : 1;
      __IO uint32_t EXMCEN     : 1;            /*!< [8..8] EXMC clock enable                                                  */
            uint32_t            : 3;
      __IO uint32_t USBFSEN    : 1;            /*!< [12..12] USBFS clock enable                                               */
            uint32_t            : 19;
    } AHBEN_b;
  } ;

  union {
    __IO uint32_t APB2EN;                      /*!< (@ 0x00000018) APB2 clock enable register (RCU_APB2EN)                    */

    struct {
      __IO uint32_t AFEN       : 1;            /*!< [0..0] Alternate function IO clock enable                                 */
            uint32_t            : 1;
      __IO uint32_t PAEN       : 1;            /*!< [2..2] GPIO port A clock enable                                           */
      __IO uint32_t PBEN       : 1;            /*!< [3..3] GPIO port B clock enable                                           */
      __IO uint32_t PCEN       : 1;            /*!< [4..4] GPIO port C clock enable                                           */
      __IO uint32_t PDEN       : 1;            /*!< [5..5] GPIO port D clock enable                                           */
      __IO uint32_t PEEN       : 1;            /*!< [6..6] GPIO port E clock enable                                           */
            uint32_t            : 2;
      __IO uint32_t ADC0EN     : 1;            /*!< [9..9] ADC0 clock enable                                                  */
      __IO uint32_t ADC1EN     : 1;            /*!< [10..10] ADC1 clock enable                                                */
      __IO uint32_t TIMER0EN   : 1;            /*!< [11..11] TIMER0 clock enable                                              */
      __IO uint32_t SPI0EN     : 1;            /*!< [12..12] SPI0 clock enable                                                */
            uint32_t            : 1;
      __IO uint32_t USART0EN   : 1;            /*!< [14..14] USART0 clock enable                                              */
            uint32_t            : 17;
    } APB2EN_b;
  } ;

  union {
    __IO uint32_t APB1EN;                      /*!< (@ 0x0000001C) APB1 clock enable register (RCU_APB1EN)                    */

    struct {
      __IO uint32_t TIMER1EN   : 1;            /*!< [0..0] TIMER1 timer clock enable                                          */
      __IO uint32_t TIMER2EN   : 1;            /*!< [1..1] TIMER2 timer clock enable                                          */
      __IO uint32_t TIMER3EN   : 1;            /*!< [2..2] TIMER3 timer clock enable                                          */
      __IO uint32_t TIMER4EN   : 1;            /*!< [3..3] TIMER4 timer clock enable                                          */
      __IO uint32_t TIMER5EN   : 1;            /*!< [4..4] TIMER5 timer clock enable                                          */
      __IO uint32_t TIMER6EN   : 1;            /*!< [5..5] TIMER6 timer clock enable                                          */
            uint32_t            : 5;
      __IO uint32_t WWDGTEN    : 1;            /*!< [11..11] Window watchdog timer clock enable                               */
            uint32_t            : 2;
      __IO uint32_t SPI1EN     : 1;            /*!< [14..14] SPI1 clock enable                                                */
      __IO uint32_t SPI2EN     : 1;            /*!< [15..15] SPI2 clock enable                                                */
            uint32_t            : 1;
      __IO uint32_t USART1EN   : 1;            /*!< [17..17] USART1 clock enable                                              */
      __IO uint32_t USART2EN   : 1;            /*!< [18..18] USART2 clock enable                                              */
      __IO uint32_t UART3EN    : 1;            /*!< [19..19] UART3 clock enable                                               */
      __IO uint32_t UART4EN    : 1;            /*!< [20..20] UART4 clock enable                                               */
      __IO uint32_t I2C0EN     : 1;            /*!< [21..21] I2C0 clock enable                                                */
      __IO uint32_t I2C1EN     : 1;            /*!< [22..22] I2C1 clock enable                                                */
            uint32_t            : 2;
      __IO uint32_t CAN0EN     : 1;            /*!< [25..25] CAN0 clock enable                                                */
      __IO uint32_t CAN1EN     : 1;            /*!< [26..26] CAN1 clock enable                                                */
      __IO uint32_t BKPIEN     : 1;            /*!< [27..27] Backup interface clock enable                                    */
      __IO uint32_t PMUEN      : 1;            /*!< [28..28] Power control clock enable                                       */
      __IO uint32_t DACEN      : 1;            /*!< [29..29] DAC clock enable                                                 */
            uint32_t            : 2;
    } APB1EN_b;
  } ;

  union {
    __IO uint32_t BDCTL;                       /*!< (@ 0x00000020) Backup domain control register (RCU_BDCTL)                 */

    struct {
      __IO uint32_t LXTALEN    : 1;            /*!< [0..0] LXTAL enable                                                       */
      __I  uint32_t LXTALSTB   : 1;            /*!< [1..1] External low-speed oscillator stabilization                        */
      __IO uint32_t LXTALBPS   : 1;            /*!< [2..2] LXTAL bypass mode enable                                           */
            uint32_t            : 5;
      __IO uint32_t RTCSRC     : 2;            /*!< [9..8] RTC clock entry selection                                          */
            uint32_t            : 5;
      __IO uint32_t RTCEN      : 1;            /*!< [15..15] RTC clock enable                                                 */
      __IO uint32_t BKPRST     : 1;            /*!< [16..16] Backup domain reset                                              */
            uint32_t            : 15;
    } BDCTL_b;
  } ;

  union {
    __IO uint32_t RSTSCK;                      /*!< (@ 0x00000024) Reset source /clock register (RCU_RSTSCK)                  */

