RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t IRC40KEN   : 1;            /*!< [0..0] IRC40K enable                                                      */
      __I  uint32_t IRC40KSTB  : 1;            /*!< [1..1] IRC40K stabilization                                               */
            uint32_t            : 22;
      __IO uint32_t RSTFC      : 1;            /*!< [24..24] Reset flag clear                                                 */
            uint32_t            : 1;
      __I  uint32_t EPRSTF     : 1;            /*!< [26..26] External PIN reset flag                                          */
      __I  uint32_t PORRSTF    : 1;            /*!< [27..27] Power reset flag                                                 */
      __I  uint32_t SWRSTF     : 1;            /*!< [28..28] Software reset flag                                              */
      __I  uint32_t FWDGTRSTF  : 1;            /*!< [29..29] Free Watchdog timer reset flag                                   */
      __I  uint32_t WWDGTRSTF  : 1;            /*!< [30..30] Window watchdog timer reset flag                                 */
      __I  uint32_t LPRSTF     : 1;            /*!< [31..31] Low-power reset flag                                             */
    } RSTSCK_b;
  } ;

  union {
    __IO uint32_t AHBRST;                      /*!< (@ 0x00000028) AHB reset register                                         */

    struct {
            uint32_t            : 12;
      __IO uint32_t USBFSRST   : 1;            /*!< [12..12] USBFS reset                                                      */
            uint32_t            : 19;
    } AHBRST_b;
  } ;

  union {
    __IO uint32_t CFG1;                        /*!< (@ 0x0000002C) Clock Configuration register 1                             */

    struct {
      __IO uint32_t PREDV0     : 4;            /*!< [3..0] PREDV0 division factor                                             */
      __IO uint32_t PREDV1     : 4;            /*!< [7..4] PREDV1 division factor                                             */
      __IO uint32_t PLL1MF     : 4;            /*!< [11..8] The PLL1 clock multiplication factor                              */
      __IO uint32_t PLL2MF     : 4;            /*!< [15..12] The PLL2 clock multiplication factor                             */
      __IO uint32_t PREDV0SEL  : 1;            /*!< [16..16] PREDV0 input Clock Source Selection                              */
      __IO uint32_t I2S1SEL    : 1;            /*!< [17..17] I2S1 Clock Source Selection                                      */
      __IO uint32_t I2S2SEL    : 1;            /*!< [18..18] I2S2 Clock Source Selection                                      */
            uint32_t            : 13;
    } CFG1_b;
  } ;
  __I  uint32_t  RESERVED;

  union {
    __IO uint32_t DSV;                         /*!< (@ 0x00000034) Deep sleep mode Voltage register                           */

    struct {
      __IO uint32_t DSLPVS     : 2;            /*!< [1..0] Deep-sleep mode voltage select                                     */
            uint32_t            : 30;
    } DSV_b;
  } ;
} RCU_Type;                                     /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

typedef struct {                                /*!< (@ 0x40002800) RTC Structure                                              */

  union {
    __IO uint32_t INTEN;                       /*!< (@ 0x00000000) RTC interrupt enable register                              */

    struct {
      __IO uint32_t SCIE       : 1;            /*!< [0..0] Second interrupt                                                   */
      __IO uint32_t ALRMIE     : 1;            /*!< [1..1] Alarm interrupt enable                                             */
      __IO uint32_t OVIE       : 1;            /*!< [2..2] Overflow interrupt enable                                          */
            uint32_t            : 29;
    } INTEN_b;
  } ;

  union {
    __IO uint32_t CTL;                         /*!< (@ 0x00000004) control register                                           */

    struct {
      __IO uint32_t SCIF       : 1;            /*!< [0..0] Sencond interrupt flag                                             */
      __IO uint32_t ALRMIF     : 1;            /*!< [1..1] Alarm interrupt flag                                               */
      __IO uint32_t OVIF       : 1;            /*!< [2..2] Overflow interrupt flag                                            */
      __IO uint32_t RSYNF      : 1;            /*!< [3..3] Registers synchronized flag                                        */
      __IO uint32_t CMF        : 1;            /*!< [4..4] Configuration mode flag                                            */
      __IO uint32_t LWOFF      : 1;            /*!< [5..5] Last write operation finished flag                                 */
            uint32_t            : 26;
    } CTL_b;
  } ;

  union {
    __IO uint32_t PSCH;                        /*!< (@ 0x00000008) RTC prescaler high register                                */

    struct {
      __O  uint32_t PSC        : 4;            /*!< [3..0] RTC prescaler value high                                           */
            uint32_t            : 28;
    } PSCH_b;
  } ;

  union {
    __IO uint32_t PSCL;                        /*!< (@ 0x0000000C) RTC prescaler low register                                 */

    struct {
      __O  uint32_t PSC        : 16;           /*!< [15..0] RTC prescaler value low                                           */
            uint32_t            : 16;
    } PSCL_b;
  } ;

  union {
    __I  uint32_t DIVH;                        /*!< (@ 0x00000010) RTC divider high register                                  */

