RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __I  uint32_t DIV        : 4;            /*!< [3..0] RTC divider value high                                             */
            uint32_t            : 28;
    } DIVH_b;
  } ;

  union {
    __I  uint32_t DIVL;                        /*!< (@ 0x00000014) RTC divider low register                                   */

    struct {
      __I  uint32_t DIV        : 16;           /*!< [15..0] RTC divider value low                                             */
            uint32_t            : 16;
    } DIVL_b;
  } ;

  union {
    __IO uint32_t CNTH;                        /*!< (@ 0x00000018) RTC counter high register                                  */

    struct {
      __IO uint32_t CNT        : 16;           /*!< [15..0] RTC counter value high                                            */
            uint32_t            : 16;
    } CNTH_b;
  } ;

  union {
    __IO uint32_t CNTL;                        /*!< (@ 0x0000001C) RTC counter low register                                   */

    struct {
      __IO uint32_t CNT        : 16;           /*!< [15..0] RTC counter value low                                             */
            uint32_t            : 16;
    } CNTL_b;
  } ;

  union {
    __O  uint32_t ALRMH;                       /*!< (@ 0x00000020) Alarm high register                                        */

    struct {
      __O  uint32_t ALRM       : 16;           /*!< [15..0] Alarm value high                                                  */
            uint32_t            : 16;
    } ALRMH_b;
  } ;

  union {
    __O  uint32_t ALRML;                       /*!< (@ 0x00000024) RTC alarm low register                                     */

    struct {
      __O  uint32_t ALRM       : 16;           /*!< [15..0] alarm value low                                                   */
            uint32_t            : 16;
    } ALRML_b;
  } ;
} RTC_Type;                                     /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial peripheral interface (SPI0)
  */

typedef struct {                                /*!< (@ 0x40013000) SPI0 Structure                                             */

  union {
    __IO uint16_t CTL0;                        /*!< (@ 0x00000000) control register 0                                         */

    struct {
      __IO uint16_t CKPH       : 1;            /*!< [0..0] Clock Phase Selection                                              */
      __IO uint16_t CKPL       : 1;            /*!< [1..1] Clock polarity Selection                                           */
      __IO uint16_t MSTMOD     : 1;            /*!< [2..2] Master Mode Enable                                                 */
      __IO uint16_t PSC        : 3;            /*!< [5..3] Master Clock Prescaler Selection                                   */
      __IO uint16_t SPIEN      : 1;            /*!< [6..6] SPI enable                                                         */
      __IO uint16_t LF         : 1;            /*!< [7..7] LSB First Mode                                                     */
      __IO uint16_t SWNSS      : 1;            /*!< [8..8] NSS Pin Selection In NSS Software Mode                             */
      __IO uint16_t SWNSSEN    : 1;            /*!< [9..9] NSS Software Mode Selection                                        */
      __IO uint16_t RO         : 1;            /*!< [10..10] Receive only                                                     */
      __IO uint16_t FF16       : 1;            /*!< [11..11] Data frame format                                                */
      __IO uint16_t CRCNT      : 1;            /*!< [12..12] CRC Next Transfer                                                */
      __IO uint16_t CRCEN      : 1;            /*!< [13..13] CRC Calculation Enable                                           */
      __IO uint16_t BDOEN      : 1;            /*!< [14..14] Bidirectional Transmit output enable                             */
      __IO uint16_t BDEN       : 1;            /*!< [15..15] Bidirectional  enable                                            */
    } CTL0_b;
  } ;
  __I  uint16_t  RESERVED;

  union {
    __IO uint16_t CTL1;                        /*!< (@ 0x00000004) control register 1                                         */

    struct {
      __IO uint16_t DMAREN     : 1;            /*!< [0..0] Rx buffer DMA enable                                               */
      __IO uint16_t DMATEN     : 1;            /*!< [1..1] Transmit Buffer DMA Enable                                         */
      __IO uint16_t NSSDRV     : 1;            /*!< [2..2] Drive NSS Output                                                   */
      __IO uint16_t NSSP       : 1;            /*!< [3..3] SPI NSS pulse mode enable                                          */
      __IO uint16_t TMOD       : 1;            /*!< [4..4] SPI TI mode enable                                                 */
      __IO uint16_t ERRIE      : 1;            /*!< [5..5] Error interrupt enable                                             */
      __IO uint16_t RBNEIE     : 1;            /*!< [6..6] RX buffer not empty interrupt enable                               */
      __IO uint16_t TBEIE      : 1;            /*!< [7..7] Tx buffer empty interrupt enable                                   */
            uint16_t            : 8;
    } CTL1_b;
  } ;
  __I  uint16_t  RESERVED1;

  union {
    __IO uint16_t STAT;                        /*!< (@ 0x00000008) status register                                            */

