RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __I  uint16_t RBNE       : 1;            /*!< [0..0] Receive Buffer Not Empty                                           */
      __I  uint16_t TBE        : 1;            /*!< [1..1] Transmit Buffer Empty                                              */
      __I  uint16_t I2SCH      : 1;            /*!< [2..2] I2S channel side                                                   */
      __I  uint16_t TXURERR    : 1;            /*!< [3..3] Transmission underrun error bit                                    */
      __IO uint16_t CRCERR     : 1;            /*!< [4..4] SPI CRC Error Bit                                                  */
      __I  uint16_t CONFERR    : 1;            /*!< [5..5] SPI Configuration error                                            */
      __I  uint16_t RXORERR    : 1;            /*!< [6..6] Reception Overrun Error Bit                                        */
      __I  uint16_t TRANS      : 1;            /*!< [7..7] Transmitting On-going Bit                                          */
      __I  uint16_t FERR       : 1;            /*!< [8..8] Format error                                                       */
            uint16_t            : 7;
    } STAT_b;
  } ;
  __I  uint16_t  RESERVED2;

  union {
    __IO uint16_t DATA;                        /*!< (@ 0x0000000C) data register                                              */

    struct {
      __IO uint16_t SPI_DATA   : 16;           /*!< [15..0] Data transfer register                                            */
    } DATA_b;
  } ;
  __I  uint16_t  RESERVED3;

  union {
    __IO uint16_t CRCPOLY;                     /*!< (@ 0x00000010) CRC polynomial register                                    */

    struct {
      __IO uint16_t CRCPOLY    : 16;           /*!< [15..0] CRC polynomial value                                              */
    } CRCPOLY_b;
  } ;
  __I  uint16_t  RESERVED4;

  union {
    __I  uint16_t RCRC;                        /*!< (@ 0x00000014) RX CRC register                                            */

    struct {
      __I  uint16_t RCRC       : 16;           /*!< [15..0] RX CRC value                                                      */
    } RCRC_b;
  } ;
  __I  uint16_t  RESERVED5;

  union {
    __I  uint16_t TCRC;                        /*!< (@ 0x00000018) TX CRC register                                            */

    struct {
      __I  uint16_t TCRC       : 16;           /*!< [15..0] Tx CRC value                                                      */
    } TCRC_b;
  } ;
  __I  uint16_t  RESERVED6;

  union {
    __IO uint16_t I2SCTL;                      /*!< (@ 0x0000001C) I2S control register                                       */

    struct {
      __IO uint16_t CHLEN      : 1;            /*!< [0..0] Channel length (number of bits per audio channel)                  */
      __IO uint16_t DTLEN      : 2;            /*!< [2..1] Data length                                                        */
      __IO uint16_t CKPL       : 1;            /*!< [3..3] Idle state clock polarity                                          */
      __IO uint16_t I2SSTD     : 2;            /*!< [5..4] I2S standard selection                                             */
            uint16_t            : 1;
      __IO uint16_t PCMSMOD    : 1;            /*!< [7..7] PCM frame synchronization mode                                     */
      __IO uint16_t I2SOPMOD   : 2;            /*!< [9..8] I2S operation mode                                                 */
      __IO uint16_t I2SEN      : 1;            /*!< [10..10] I2S Enable                                                       */
      __IO uint16_t I2SSEL     : 1;            /*!< [11..11] I2S mode selection                                               */
            uint16_t            : 4;
    } I2SCTL_b;
  } ;
  __I  uint16_t  RESERVED7;

  union {
    __IO uint16_t I2SPSC;                      /*!< (@ 0x00000020) I2S prescaler register                                     */

    struct {
      __IO uint16_t DIV        : 8;            /*!< [7..0] Dividing factor for the prescaler                                  */
      __IO uint16_t OF         : 1;            /*!< [8..8] Odd factor for the prescaler                                       */
      __IO uint16_t MCKOEN     : 1;            /*!< [9..9] I2S_MCK output enable                                              */
            uint16_t            : 6;
    } I2SPSC_b;
  } ;
} SPI_Type;                                    /*!< Size = 34 (0x22)                                                          */



/* =========================================================================================================================== */
/* ================                                          TIMER                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief timers (TIMER)
  */

typedef struct {                                /*!< (@ 0x40012C00) TIMER0 Structure                                           */

  union {
    __IO uint16_t CTL0;                        /*!< (@ 0x00000000) control register 0                                         */

    struct {
      __IO uint16_t CEN        : 1;            /*!< [0..0] Counter enable                                                     */
      __IO uint16_t UPDIS      : 1;            /*!< [1..1] Update disable                                                     */
      __IO uint16_t UPS        : 1;            /*!< [2..2] Update source                                                      */
      __IO uint16_t SPM        : 1;            /*!< [3..3] Single pulse mode                                                  */
      __IO uint16_t DIR        : 1;            /*!< [4..4] Direction                                                          */
      __IO uint16_t CAM        : 2;            /*!< [6..5] Counter aligns mode selection                                      */
      __IO uint16_t ARSE       : 1;            /*!< [7..7] Auto-reload shadow enable                                          */
      __IO uint16_t CKDIV      : 2;            /*!< [9..8] Clock division                                                     */
            uint16_t            : 6;
    } CTL0_b;
  } ;
  __I  uint16_t  RESERVED;

  union {
    __IO uint16_t CTL1;                        /*!< (@ 0x00000004) control register 1                                         */

