RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint16_t CCSE       : 1;            /*!< [0..0] Commutation control shadow enable                                  */
            uint16_t            : 1;
      __IO uint16_t CCUC       : 1;            /*!< [2..2] Commutation control shadow register update control                 */
      __IO uint16_t DMAS       : 1;            /*!< [3..3] DMA request source selection                                       */
      __IO uint16_t MMC        : 3;            /*!< [6..4] Master mode control                                                */
      __IO uint16_t TI0S       : 1;            /*!< [7..7] Channel 0 trigger input selection                                  */
      __IO uint16_t ISO0       : 1;            /*!< [8..8] Idle state of channel 0 output                                     */
      __IO uint16_t ISO0N      : 1;            /*!< [9..9] Idle state of channel 0 complementary output                       */
      __IO uint16_t ISO1       : 1;            /*!< [10..10] Idle state of channel 1 output                                   */
      __IO uint16_t ISO1N      : 1;            /*!< [11..11] Idle state of channel 1 complementary output                     */
      __IO uint16_t ISO2       : 1;            /*!< [12..12] Idle state of channel 2 output                                   */
      __IO uint16_t ISO2N      : 1;            /*!< [13..13] Idle state of channel 2 complementary output                     */
      __IO uint16_t ISO3       : 1;            /*!< [14..14] Idle state of channel 3 output                                   */
            uint16_t            : 1;
    } CTL1_b;
  } ;
  __I  uint16_t  RESERVED1;

  union {
    __IO uint16_t SMCFG;                       /*!< (@ 0x00000008) slave mode configuration register                          */

    struct {
      __IO uint16_t SMC        : 3;            /*!< [2..0] Slave mode selection                                               */
            uint16_t            : 1;
      __IO uint16_t TRGS       : 3;            /*!< [6..4] Trigger selection                                                  */
      __IO uint16_t MSM        : 1;            /*!< [7..7] Master/Slave mode                                                  */
      __IO uint16_t ETFC       : 4;            /*!< [11..8] External trigger filter control                                   */
      __IO uint16_t ETPSC      : 2;            /*!< [13..12] External trigger prescaler                                       */
      __IO uint16_t SMC1       : 1;            /*!< [14..14] Part of SMC for enable External clock mode1                      */
      __IO uint16_t ETP        : 1;            /*!< [15..15] External trigger polarity                                        */
    } SMCFG_b;
  } ;
  __I  uint16_t  RESERVED2;

  union {
    __IO uint16_t DMAINTEN;                    /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */

    struct {
      __IO uint16_t UPIE       : 1;            /*!< [0..0] Update interrupt enable                                            */
      __IO uint16_t CH0IE      : 1;            /*!< [1..1] Channel 0 capture/compare interrupt enable                         */
      __IO uint16_t CH1IE      : 1;            /*!< [2..2] Channel 1 capture/compare interrupt enable                         */
      __IO uint16_t CH2IE      : 1;            /*!< [3..3] Channel 2 capture/compare interrupt enable                         */
      __IO uint16_t CH3IE      : 1;            /*!< [4..4] Channel 3 capture/compare interrupt enable                         */
      __IO uint16_t CMTIE      : 1;            /*!< [5..5] commutation interrupt enable                                       */
      __IO uint16_t TRGIE      : 1;            /*!< [6..6] Trigger interrupt enable                                           */
      __IO uint16_t BRKIE      : 1;            /*!< [7..7] Break interrupt enable                                             */
      __IO uint16_t UPDEN      : 1;            /*!< [8..8] Update DMA request enable                                          */
      __IO uint16_t CH0DEN     : 1;            /*!< [9..9] Channel 0 capture/compare DMA request enable                       */
      __IO uint16_t CH1DEN     : 1;            /*!< [10..10] Channel 1 capture/compare DMA request enable                     */
      __IO uint16_t CH2DEN     : 1;            /*!< [11..11] Channel 2 capture/compare DMA request enable                     */
      __IO uint16_t CH3DEN     : 1;            /*!< [12..12] Channel 3 capture/compare DMA request enable                     */
      __IO uint16_t CMTDEN     : 1;            /*!< [13..13] Commutation DMA request enable                                   */
      __IO uint16_t TRGDEN     : 1;            /*!< [14..14] Trigger DMA request enable                                       */
            uint16_t            : 1;
    } DMAINTEN_b;
  } ;
  __I  uint16_t  RESERVED3;

  union {
    __IO uint16_t INTF;                        /*!< (@ 0x00000010) Interrupt flag register                                    */

    struct {
      __IO uint16_t UPIF       : 1;            /*!< [0..0] Update interrupt flag                                              */
      __IO uint16_t CH0IF      : 1;            /*!< [1..1] Channel 0 capture/compare interrupt flag                           */
      __IO uint16_t CH1IF      : 1;            /*!< [2..2] Channel 1 capture/compare interrupt flag                           */
      __IO uint16_t CH2IF      : 1;            /*!< [3..3] Channel 2 capture/compare interrupt flag                           */
      __IO uint16_t CH3IF      : 1;            /*!< [4..4] Channel 3 capture/compare interrupt flag                           */
      __IO uint16_t CMTIF      : 1;            /*!< [5..5] Channel commutation interrupt flag                                 */
      __IO uint16_t TRGIF      : 1;            /*!< [6..6] Trigger interrupt flag                                             */
      __IO uint16_t BRKIF      : 1;            /*!< [7..7] Break interrupt flag                                               */
            uint16_t            : 1;
      __IO uint16_t CH0OF      : 1;            /*!< [9..9] Channel 0 over capture flag                                        */
      __IO uint16_t CH1OF      : 1;            /*!< [10..10] Channel 1 over capture flag                                      */
      __IO uint16_t CH2OF      : 1;            /*!< [11..11] Channel 2 over capture flag                                      */
      __IO uint16_t CH3OF      : 1;            /*!< [12..12] Channel 3 over capture flag                                      */
            uint16_t            : 3;
    } INTF_b;
  } ;
  __I  uint16_t  RESERVED4;

  union {
    __O  uint16_t SWEVG;                       /*!< (@ 0x00000014) Software event generation register                         */

