RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __O  uint16_t UPG        : 1;            /*!< [0..0] Update event generation                                            */
      __O  uint16_t CH0G       : 1;            /*!< [1..1] Channel 0 capture or compare event generation                      */
      __O  uint16_t CH1G       : 1;            /*!< [2..2] Channel 1 capture or compare event generation                      */
      __O  uint16_t CH2G       : 1;            /*!< [3..3] Channel 2 capture or compare event generation                      */
      __O  uint16_t CH3G       : 1;            /*!< [4..4] Channel 3 capture or compare event generation                      */
      __O  uint16_t CMTG       : 1;            /*!< [5..5] Channel commutation event generation                               */
      __O  uint16_t TRGG       : 1;            /*!< [6..6] Trigger event generation                                           */
      __O  uint16_t BRKG       : 1;            /*!< [7..7] Break event generation                                             */
            uint16_t            : 8;
    } SWEVG_b;
  } ;
  __I  uint16_t  RESERVED5;

  union {
    union {
      __IO uint16_t CHCTL0_Output;             /*!< (@ 0x00000018) Channel control register 0 (output mode)                   */

      struct {
        __IO uint16_t CH0MS    : 2;            /*!< [1..0] Channel 0 I/O mode selection                                       */
        __IO uint16_t CH0COMFEN : 1;           /*!< [2..2] Channel 0 output compare fast enable                               */
        __IO uint16_t CH0COMSEN : 1;           /*!< [3..3] Channel 0 compare output shadow enable                             */
        __IO uint16_t CH0COMCTL : 3;           /*!< [6..4] Channel 0 compare output control                                   */
        __IO uint16_t CH0COMCEN : 1;           /*!< [7..7] Channel 0 output compare clear enable                              */
        __IO uint16_t CH1MS    : 2;            /*!< [9..8] Channel 1 mode selection                                           */
        __IO uint16_t CH1COMFEN : 1;           /*!< [10..10] Channel 1 output compare fast enable                             */
        __IO uint16_t CH1COMSEN : 1;           /*!< [11..11] Channel 1 output compare shadow enable                           */
        __IO uint16_t CH1COMCTL : 3;           /*!< [14..12] Channel 1 compare output control                                 */
        __IO uint16_t CH1COMCEN : 1;           /*!< [15..15] Channel 1 output compare clear enable                            */
      } CHCTL0_Output_b;
    } ;

    union {
      __IO uint16_t CHCTL0_Input;              /*!< (@ 0x00000018) Channel control register 0 (input mode)                    */

      struct {
        __IO uint16_t CH0MS    : 2;            /*!< [1..0] Channel 0 mode selection                                           */
        __IO uint16_t CH0CAPPSC : 2;           /*!< [3..2] Channel 0 input capture prescaler                                  */
        __IO uint16_t CH0CAPFLT : 4;           /*!< [7..4] Channel 0 input capture filter control                             */
        __IO uint16_t CH1MS    : 2;            /*!< [9..8] Channel 1 mode selection                                           */
        __IO uint16_t CH1CAPPSC : 2;           /*!< [11..10] Channel 1 input capture prescaler                                */
        __IO uint16_t CH1CAPFLT : 4;           /*!< [15..12] Channel 1 input capture filter control                           */
      } CHCTL0_Input_b;
    } ;
  };
  __I  uint16_t  RESERVED6;

  union {
    union {
      __IO uint16_t CHCTL1_Output;             /*!< (@ 0x0000001C) Channel control register 1 (output mode)                   */

      struct {
        __IO uint16_t CH2MS    : 2;            /*!< [1..0] Channel 2 I/O mode selection                                       */
        __IO uint16_t CH2COMFEN : 1;           /*!< [2..2] Channel 2 output compare fast enable                               */
        __IO uint16_t CH2COMSEN : 1;           /*!< [3..3] Channel 2 compare output shadow enable                             */
        __IO uint16_t CH2COMCTL : 3;           /*!< [6..4] Channel 2 compare output control                                   */
        __IO uint16_t CH2COMCEN : 1;           /*!< [7..7] Channel 2 output compare clear enable                              */
        __IO uint16_t CH3MS    : 2;            /*!< [9..8] Channel 3 mode selection                                           */
        __IO uint16_t CH3COMFEN : 1;           /*!< [10..10] Channel 3 output compare fast enable                             */
        __IO uint16_t CH3COMSEN : 1;           /*!< [11..11] Channel 3 output compare shadow enable                           */
        __IO uint16_t CH3COMCTL : 3;           /*!< [14..12] Channel 3 compare output control                                 */
        __IO uint16_t CH3COMCEN : 1;           /*!< [15..15] Channel 3 output compare clear enable                            */
      } CHCTL1_Output_b;
    } ;

    union {
      __IO uint16_t CHCTL1_Input;              /*!< (@ 0x0000001C) Channel control register 1 (input mode)                    */

      struct {
        __IO uint16_t CH2MS    : 2;            /*!< [1..0] Channel 2 mode selection                                           */
        __IO uint16_t CH2CAPPSC : 2;           /*!< [3..2] Channel 2 input capture prescaler                                  */
        __IO uint16_t CH2CAPFLT : 4;           /*!< [7..4] Channel 2 input capture filter control                             */
        __IO uint16_t CH3MS    : 2;            /*!< [9..8] Channel 3 mode selection                                           */
        __IO uint16_t CH3CAPPSC : 2;           /*!< [11..10] Channel 3 input capture prescaler                                */
        __IO uint16_t CH3CAPFLT : 4;           /*!< [15..12] Channel 3 input capture filter control                           */
      } CHCTL1_Input_b;
    } ;
  };
  __I  uint16_t  RESERVED7;

  union {
    __IO uint16_t CHCTL2;                      /*!< (@ 0x00000020) Channel control register 2                                 */

