RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint16_t CH0EN      : 1;            /*!< [0..0] Channel 0 capture/compare function enable                          */
      __IO uint16_t CH0P       : 1;            /*!< [1..1] Channel 0 capture/compare function polarity                        */
      __IO uint16_t CH0NEN     : 1;            /*!< [2..2] Channel 0 complementary output enable                              */
      __IO uint16_t CH0NP      : 1;            /*!< [3..3] Channel 0 complementary output polarity                            */
      __IO uint16_t CH1EN      : 1;            /*!< [4..4] Channel 1 capture/compare function enable                          */
      __IO uint16_t CH1P       : 1;            /*!< [5..5] Channel 1 capture/compare function polarity                        */
      __IO uint16_t CH1NEN     : 1;            /*!< [6..6] Channel 1 complementary output enable                              */
      __IO uint16_t CH1NP      : 1;            /*!< [7..7] Channel 1 complementary output polarity                            */
      __IO uint16_t CH2EN      : 1;            /*!< [8..8] Channel 2 capture/compare function enable                          */
      __IO uint16_t CH2P       : 1;            /*!< [9..9] Channel 2 capture/compare function polarity                        */
      __IO uint16_t CH2NEN     : 1;            /*!< [10..10] Channel 2 complementary output enable                            */
      __IO uint16_t CH2NP      : 1;            /*!< [11..11] Channel 2 complementary output polarity                          */
      __IO uint16_t CH3EN      : 1;            /*!< [12..12] Channel 3 capture/compare function enable                        */
      __IO uint16_t CH3P       : 1;            /*!< [13..13] Channel 3 capture/compare function polarity                      */
            uint16_t            : 2;
    } CHCTL2_b;
  } ;
  __I  uint16_t  RESERVED8;

  union {
    __IO uint16_t CNT;                         /*!< (@ 0x00000024) counter                                                    */

    struct {
      __IO uint16_t CNT        : 16;           /*!< [15..0] current counter value                                             */
    } CNT_b;
  } ;
  __I  uint16_t  RESERVED9;

  union {
    __IO uint16_t PSC;                         /*!< (@ 0x00000028) prescaler                                                  */

    struct {
      __IO uint16_t PSC        : 16;           /*!< [15..0] Prescaler value of the counter clock                              */
    } PSC_b;
  } ;
  __I  uint16_t  RESERVED10;

  union {
    __IO uint16_t CAR;                         /*!< (@ 0x0000002C) Counter auto reload register                               */

    struct {
      __IO uint16_t CARL       : 16;           /*!< [15..0] Counter auto reload value                                         */
    } CAR_b;
  } ;
  __I  uint16_t  RESERVED11;

  union {
    __IO uint16_t CREP;                        /*!< (@ 0x00000030) Counter repetition register                                */

    struct {
      __IO uint16_t CREP       : 8;            /*!< [7..0] Counter repetition value                                           */
            uint16_t            : 8;
    } CREP_b;
  } ;
  __I  uint16_t  RESERVED12;

  union {
    __IO uint16_t CH0CV;                       /*!< (@ 0x00000034) Channel 0 capture/compare value register                   */

    struct {
      __IO uint16_t CH0VAL     : 16;           /*!< [15..0] Capture or compare value of channel0                              */
    } CH0CV_b;
  } ;
  __I  uint16_t  RESERVED13;

  union {
    __IO uint16_t CH1CV;                       /*!< (@ 0x00000038) Channel 1 capture/compare value register                   */

    struct {
      __IO uint16_t CH1VAL     : 16;           /*!< [15..0] Capture or compare value of channel1                              */
    } CH1CV_b;
  } ;
  __I  uint16_t  RESERVED14;

  union {
    __IO uint16_t CH2CV;                       /*!< (@ 0x0000003C) Channel 2 capture/compare value register                   */

    struct {
      __IO uint16_t CH2VAL     : 16;           /*!< [15..0] Capture or compare value of channel 2                             */
    } CH2CV_b;
  } ;
  __I  uint16_t  RESERVED15;

  union {
    __IO uint16_t CH3CV;                       /*!< (@ 0x00000040) Channel 3 capture/compare value register                   */

    struct {
      __IO uint16_t CH3VAL     : 16;           /*!< [15..0] Capture or compare value of channel 3                             */
    } CH3CV_b;
  } ;
  __I  uint16_t  RESERVED16;

  union {
    __IO uint16_t CCHP;                        /*!< (@ 0x00000044) channel complementary protection register                  */

    struct {
      __IO uint16_t DTCFG      : 8;            /*!< [7..0] Dead time configure                                                */
      __IO uint16_t PROT       : 2;            /*!< [9..8] Complementary register protect control                             */
      __IO uint16_t IOS        : 1;            /*!< [10..10] Idle mode off-state configure                                    */
      __IO uint16_t ROS        : 1;            /*!< [11..11] Run mode off-state configure                                     */
      __IO uint16_t BRKEN      : 1;            /*!< [12..12] Break enable                                                     */
      __IO uint16_t BRKP       : 1;            /*!< [13..13] Break polarity                                                   */
      __IO uint16_t OAEN       : 1;            /*!< [14..14] Output automatic enable                                          */
      __IO uint16_t POEN       : 1;            /*!< [15..15] Primary output enable                                            */
    } CCHP_b;
  } ;
  __I  uint16_t  RESERVED17;

  union {
    __IO uint16_t DMACFG;                      /*!< (@ 0x00000048) DMA configuration register                                 */

    struct {
      __IO uint16_t DMATA      : 5;            /*!< [4..0] DMA transfer access start address                                  */
            uint16_t            : 3;
      __IO uint16_t DMATC      : 5;            /*!< [12..8] DMA transfer count                                                */
            uint16_t            : 3;
    } DMACFG_b;
  } ;
  __I  uint16_t  RESERVED18;

  union {
    __IO uint16_t DMATB;                       /*!< (@ 0x0000004C) DMA transfer buffer register                               */

