RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint16_t DMATB      : 16;           /*!< [15..0] DMA transfer buffer                                               */
    } DMATB_b;
  } ;
} TIMER_Type;                                  /*!< Size = 78 (0x4e)                                                          */



/* =========================================================================================================================== */
/* ================                                          USART0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver
      transmitter (USART0)
  */

typedef struct {                                /*!< (@ 0x40013800) USART0 Structure                                           */

  union {
    __IO uint32_t STAT;                        /*!< (@ 0x00000000) Status register                                            */

    struct {
      __I  uint32_t PERR       : 1;            /*!< [0..0] Parity error flag                                                  */
      __I  uint32_t FERR       : 1;            /*!< [1..1] Frame error flag                                                   */
      __I  uint32_t NERR       : 1;            /*!< [2..2] Noise error flag                                                   */
      __I  uint32_t ORERR      : 1;            /*!< [3..3] Overrun error                                                      */
      __I  uint32_t IDLEF      : 1;            /*!< [4..4] IDLE frame detected flag                                           */
      __IO uint32_t RBNE       : 1;            /*!< [5..5] Read data buffer not empty                                         */
      __IO uint32_t TC         : 1;            /*!< [6..6] Transmission complete                                              */
      __I  uint32_t TBE        : 1;            /*!< [7..7] Transmit data buffer empty                                         */
      __IO uint32_t LBDF       : 1;            /*!< [8..8] LIN break detection flag                                           */
      __IO uint32_t CTSF       : 1;            /*!< [9..9] CTS change flag                                                    */
            uint32_t            : 22;
    } STAT_b;
  } ;

  union {
    __IO uint32_t DATA;                        /*!< (@ 0x00000004) Data register                                              */

    struct {
      __IO uint32_t DATA       : 9;            /*!< [8..0] Transmit or read data value                                        */
            uint32_t            : 23;
    } DATA_b;
  } ;

  union {
    __IO uint32_t BAUD;                        /*!< (@ 0x00000008) Baud rate register                                         */

    struct {
      __IO uint32_t FRADIV     : 4;            /*!< [3..0] Fraction part of baud-rate divider                                 */
      __IO uint32_t INTDIV     : 12;           /*!< [15..4] Integer part of baud-rate divider                                 */
            uint32_t            : 16;
    } BAUD_b;
  } ;

  union {
    __IO uint32_t CTL0;                        /*!< (@ 0x0000000C) Control register 0                                         */

    struct {
      __IO uint32_t SBKCMD     : 1;            /*!< [0..0] Send break command                                                 */
      __IO uint32_t RWU        : 1;            /*!< [1..1] Receiver wakeup from mute mode                                     */
      __IO uint32_t REN        : 1;            /*!< [2..2] Receiver enable                                                    */
      __IO uint32_t TEN        : 1;            /*!< [3..3] Transmitter enable                                                 */
      __IO uint32_t IDLEIE     : 1;            /*!< [4..4] IDLE line detected interrupt enable                                */
      __IO uint32_t RBNEIE     : 1;            /*!< [5..5] Read data buffer not empty interrupt and overrun error
                                                     interrupt enable                                                          */
      __IO uint32_t TCIE       : 1;            /*!< [6..6] Transmission complete interrupt enable                             */
      __IO uint32_t TBEIE      : 1;            /*!< [7..7] Transmitter buffer empty interrupt enable                          */
      __IO uint32_t PERRIE     : 1;            /*!< [8..8] Parity error interrupt enable                                      */
      __IO uint32_t PM         : 1;            /*!< [9..9] Parity mode                                                        */
      __IO uint32_t PCEN       : 1;            /*!< [10..10] Parity check function enable                                     */
      __IO uint32_t WM         : 1;            /*!< [11..11] Wakeup method in mute mode                                       */
      __IO uint32_t WL         : 1;            /*!< [12..12] Word length                                                      */
      __IO uint32_t UEN        : 1;            /*!< [13..13] USART enable                                                     */
            uint32_t            : 18;
    } CTL0_b;
  } ;

  union {
    __IO uint32_t CTL1;                        /*!< (@ 0x00000010) Control register 1                                         */

    struct {
      __IO uint32_t ADDR       : 4;            /*!< [3..0] Address of the USART                                               */
            uint32_t            : 1;
      __IO uint32_t LBLEN      : 1;            /*!< [5..5] LIN break frame length                                             */
      __IO uint32_t LBDIE      : 1;            /*!< [6..6] LIN break detection interrupt enable                               */
            uint32_t            : 1;
      __IO uint32_t CLEN       : 1;            /*!< [8..8] CK Length                                                          */
      __IO uint32_t CPH        : 1;            /*!< [9..9] Clock phase                                                        */
      __IO uint32_t CPL        : 1;            /*!< [10..10] Clock polarity                                                   */
      __IO uint32_t CKEN       : 1;            /*!< [11..11] CK pin enable                                                    */
      __IO uint32_t STB        : 2;            /*!< [13..12] STOP bits length                                                 */
      __IO uint32_t LMEN       : 1;            /*!< [14..14] LIN mode enable                                                  */
            uint32_t            : 17;
    } CTL1_b;
  } ;

  union {
    __IO uint32_t CTL2;                        /*!< (@ 0x00000014) Control register 2                                         */

