RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t ERRIE      : 1;            /*!< [0..0] Error interrupt enable                                             */
      __IO uint32_t IREN       : 1;            /*!< [1..1] IrDA mode enable                                                   */
      __IO uint32_t IRLP       : 1;            /*!< [2..2] IrDA low-power                                                     */
      __IO uint32_t HDEN       : 1;            /*!< [3..3] Half-duplex selection                                              */
      __IO uint32_t NKEN       : 1;            /*!< [4..4] Smartcard NACK enable                                              */
      __IO uint32_t SCEN       : 1;            /*!< [5..5] Smartcard mode enable                                              */
      __IO uint32_t DENR       : 1;            /*!< [6..6] DMA request enable for reception                                   */
      __IO uint32_t DENT       : 1;            /*!< [7..7] DMA request enable for transmission                                */
      __IO uint32_t RTSEN      : 1;            /*!< [8..8] RTS enable                                                         */
      __IO uint32_t CTSEN      : 1;            /*!< [9..9] CTS enable                                                         */
      __IO uint32_t CTSIE      : 1;            /*!< [10..10] CTS interrupt enable                                             */
            uint32_t            : 21;
    } CTL2_b;
  } ;

  union {
    __IO uint32_t GP;                          /*!< (@ 0x00000018) Guard time and prescaler register                          */

    struct {
      __IO uint32_t PSC        : 8;            /*!< [7..0] Prescaler value                                                    */
      __IO uint32_t GUAT       : 8;            /*!< [15..8] Guard time value in Smartcard mode                                */
            uint32_t            : 16;
    } GP_b;
  } ;
} USART_Type;                                  /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                           UART3                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal  asynchronous receiver
      transmitter (UART3)
  */

typedef struct {                                /*!< (@ 0x40004C00) UART3 Structure                                            */

  union {
    __IO uint32_t STAT;                        /*!< (@ 0x00000000) Status register                                            */

    struct {
      __I  uint32_t PERR       : 1;            /*!< [0..0] Parity error flag                                                  */
      __I  uint32_t FERR       : 1;            /*!< [1..1] Frame error flag                                                   */
      __I  uint32_t NERR       : 1;            /*!< [2..2] Noise error flag                                                   */
      __I  uint32_t ORERR      : 1;            /*!< [3..3] Overrun error                                                      */
      __I  uint32_t IDLEF      : 1;            /*!< [4..4] IDLE frame detected flag                                           */
      __IO uint32_t RBNE       : 1;            /*!< [5..5] Read data buffer not empty                                         */
      __IO uint32_t TC         : 1;            /*!< [6..6] Transmission complete                                              */
      __I  uint32_t TBE        : 1;            /*!< [7..7] Transmit data buffer empty                                         */
      __IO uint32_t LBDF       : 1;            /*!< [8..8] LIN break detection flag                                           */
            uint32_t            : 23;
    } STAT_b;
  } ;

  union {
    __IO uint32_t DATA;                        /*!< (@ 0x00000004) Data register                                              */

    struct {
      __IO uint32_t DATA       : 9;            /*!< [8..0] Transmit or read data value                                        */
            uint32_t            : 23;
    } DATA_b;
  } ;

  union {
    __IO uint32_t BAUD;                        /*!< (@ 0x00000008) Baud rate register                                         */

    struct {
      __IO uint32_t FRADIV     : 4;            /*!< [3..0] Fraction part of baud-rate divider                                 */
      __IO uint32_t INTDIV     : 12;           /*!< [15..4] Integer part of baud-rate divider                                 */
            uint32_t            : 16;
    } BAUD_b;
  } ;

  union {
    __IO uint32_t CTL0;                        /*!< (@ 0x0000000C) Control register 0                                         */

    struct {
      __IO uint32_t SBKCMD     : 1;            /*!< [0..0] Send break command                                                 */
      __IO uint32_t RWU        : 1;            /*!< [1..1] Receiver wakeup from mute mode                                     */
      __IO uint32_t REN        : 1;            /*!< [2..2] Receiver enable                                                    */
      __IO uint32_t TEN        : 1;            /*!< [3..3] Transmitter enable                                                 */
      __IO uint32_t IDLEIE     : 1;            /*!< [4..4] IDLE line detected interrupt enable                                */
      __IO uint32_t RBNEIE     : 1;            /*!< [5..5] Read data buffer not empty interrupt and overrun error
                                                     interrupt enable                                                          */
      __IO uint32_t TCIE       : 1;            /*!< [6..6] Transmission complete interrupt enable                             */
      __IO uint32_t TBEIE      : 1;            /*!< [7..7] Transmitter buffer empty interrupt enable                          */
      __IO uint32_t PERRIE     : 1;            /*!< [8..8] Parity error interrupt enable                                      */
      __IO uint32_t PM         : 1;            /*!< [9..9] Parity mode                                                        */
      __IO uint32_t PCEN       : 1;            /*!< [10..10] Parity check function enable                                     */
      __IO uint32_t WM         : 1;            /*!< [11..11] Wakeup method in mute mode                                       */
      __IO uint32_t WL         : 1;            /*!< [12..12] Word length                                                      */
      __IO uint32_t UEN        : 1;            /*!< [13..13] USART enable                                                     */
            uint32_t            : 18;
    } CTL0_b;
  } ;

  union {
    __IO uint32_t CTL1;                        /*!< (@ 0x00000010) Control register 1                                         */

