RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t ADDR       : 4;            /*!< [3..0] Address of the USART                                               */
            uint32_t            : 1;
      __IO uint32_t LBLEN      : 1;            /*!< [5..5] LIN break frame length                                             */
      __IO uint32_t LBDIE      : 1;            /*!< [6..6] LIN break detection interrupt enable                               */
            uint32_t            : 5;
      __IO uint32_t STB        : 2;            /*!< [13..12] STOP bits length                                                 */
      __IO uint32_t LMEN       : 1;            /*!< [14..14] LIN mode enable                                                  */
            uint32_t            : 17;
    } CTL1_b;
  } ;

  union {
    __IO uint32_t CTL2;                        /*!< (@ 0x00000014) Control register 2                                         */

    struct {
      __IO uint32_t ERRIE      : 1;            /*!< [0..0] Error interrupt enable                                             */
      __IO uint32_t IREN       : 1;            /*!< [1..1] IrDA mode enable                                                   */
      __IO uint32_t IRLP       : 1;            /*!< [2..2] IrDA low-power                                                     */
      __IO uint32_t HDEN       : 1;            /*!< [3..3] Half-duplex selection                                              */
            uint32_t            : 2;
      __IO uint32_t DENR       : 1;            /*!< [6..6] DMA request enable for reception                                   */
      __IO uint32_t DENT       : 1;            /*!< [7..7] DMA request enable for transmission                                */
            uint32_t            : 24;
    } CTL2_b;
  } ;

  union {
    __IO uint32_t GP;                          /*!< (@ 0x00000018) Guard time and prescaler register                          */

    struct {
      __IO uint32_t PSC        : 8;            /*!< [7..0] Prescaler value                                                    */
            uint32_t            : 24;
    } GP_b;
  } ;
} UART_Type;                                   /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                       USBFS_GLOBAL                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief USB full speed global registers (USBFS_GLOBAL)
  */

typedef struct {                                /*!< (@ 0x50000000) USBFS_GLOBAL Structure                                     */

  union {
    __IO uint32_t GOTGCS;                      /*!< (@ 0x00000000) Global OTG control and status register  (USBFS_GOTGCS)     */

    struct {
      __I  uint32_t SRPS       : 1;            /*!< [0..0] SRP success                                                        */
      __IO uint32_t SRPREQ     : 1;            /*!< [1..1] SRP request                                                        */
            uint32_t            : 6;
      __I  uint32_t HNPS       : 1;            /*!< [8..8] Host success                                                       */
      __IO uint32_t HNPREQ     : 1;            /*!< [9..9] HNP request                                                        */
      __IO uint32_t HHNPEN     : 1;            /*!< [10..10] Host HNP enable                                                  */
      __IO uint32_t DHNPEN     : 1;            /*!< [11..11] Device HNP enabled                                               */
            uint32_t            : 4;
      __I  uint32_t IDPS       : 1;            /*!< [16..16] ID pin status                                                    */
      __I  uint32_t DI         : 1;            /*!< [17..17] Debounce interval                                                */
      __I  uint32_t ASV        : 1;            /*!< [18..18] A-session valid                                                  */
      __I  uint32_t BSV        : 1;            /*!< [19..19] B-session valid                                                  */
            uint32_t            : 12;
    } GOTGCS_b;
  } ;

  union {
    __IO uint32_t GOTGINTF;                    /*!< (@ 0x00000004) Global OTG interrupt flag register (USBFS_GOTGINTF)        */

    struct {
            uint32_t            : 2;
      __IO uint32_t SESEND     : 1;            /*!< [2..2] Session end                                                        */
            uint32_t            : 5;
      __IO uint32_t SRPEND     : 1;            /*!< [8..8] Session request success status change                              */
      __IO uint32_t HNPEND     : 1;            /*!< [9..9] HNP end                                                            */
            uint32_t            : 7;
      __IO uint32_t HNPDET     : 1;            /*!< [17..17] Host negotiation request detected                                */
      __IO uint32_t ADTO       : 1;            /*!< [18..18] A-device timeout                                                 */
      __IO uint32_t DF         : 1;            /*!< [19..19] Debounce finish                                                  */
            uint32_t            : 12;
    } GOTGINTF_b;
  } ;

  union {
    __IO uint32_t GAHBCS;                      /*!< (@ 0x00000008) Global AHB control and status register (USBFS_GAHBCS)      */

    struct {
      __IO uint32_t GINTEN     : 1;            /*!< [0..0] Global interrupt enable                                            */
            uint32_t            : 6;
      __IO uint32_t TXFTH      : 1;            /*!< [7..7] Tx FIFO threshold                                                  */
      __IO uint32_t PTXFTH     : 1;            /*!< [8..8] Periodic Tx FIFO threshold                                         */
            uint32_t            : 23;
    } GAHBCS_b;
  } ;

  union {
    __IO uint32_t GUSBCS;                      /*!< (@ 0x0000000C) Global USB control and status register (USBFS_GUSBCSR)     */

