RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t TOC        : 3;            /*!< [2..0] Timeout calibration                                                */
            uint32_t            : 5;
      __IO uint32_t SRPCEN     : 1;            /*!< [8..8] SRP capability enable                                              */
      __IO uint32_t HNPCEN     : 1;            /*!< [9..9] HNP capability enable                                              */
      __IO uint32_t UTT        : 4;            /*!< [13..10] USB turnaround time                                              */
            uint32_t            : 15;
      __IO uint32_t FHM        : 1;            /*!< [29..29] Force host mode                                                  */
      __IO uint32_t FDM        : 1;            /*!< [30..30] Force device mode                                                */
            uint32_t            : 1;
    } GUSBCS_b;
  } ;

  union {
    __IO uint32_t GRSTCTL;                     /*!< (@ 0x00000010) Global reset control register (USBFS_GRSTCTL)              */

    struct {
      __IO uint32_t CSRST      : 1;            /*!< [0..0] Core soft reset                                                    */
      __IO uint32_t HCSRST     : 1;            /*!< [1..1] HCLK soft reset                                                    */
      __IO uint32_t HFCRST     : 1;            /*!< [2..2] Host frame counter reset                                           */
            uint32_t            : 1;
      __IO uint32_t RXFF       : 1;            /*!< [4..4] RxFIFO flush                                                       */
      __IO uint32_t TXFF       : 1;            /*!< [5..5] TxFIFO flush                                                       */
      __IO uint32_t TXFNUM     : 5;            /*!< [10..6] TxFIFO number                                                     */
            uint32_t            : 21;
    } GRSTCTL_b;
  } ;

  union {
    __IO uint32_t GINTF;                       /*!< (@ 0x00000014) Global interrupt flag register (USBFS_GINTF)               */

    struct {
      __I  uint32_t COPM       : 1;            /*!< [0..0] Current operation mode                                             */
      __IO uint32_t MFIF       : 1;            /*!< [1..1] Mode fault interrupt flag                                          */
      __I  uint32_t OTGIF      : 1;            /*!< [2..2] OTG interrupt flag                                                 */
      __IO uint32_t SOF        : 1;            /*!< [3..3] Start of frame                                                     */
      __I  uint32_t RXFNEIF    : 1;            /*!< [4..4] RxFIFO non-empty interrupt flag                                    */
      __I  uint32_t NPTXFEIF   : 1;            /*!< [5..5] Non-periodic TxFIFO empty interrupt flag                           */
      __I  uint32_t GNPINAK    : 1;            /*!< [6..6] Global Non-Periodic IN NAK effective                               */
      __I  uint32_t GONAK      : 1;            /*!< [7..7] Global OUT NAK effective                                           */
            uint32_t            : 2;
      __IO uint32_t ESP        : 1;            /*!< [10..10] Early suspend                                                    */
      __IO uint32_t SP         : 1;            /*!< [11..11] USB suspend                                                      */
      __IO uint32_t RST        : 1;            /*!< [12..12] USB reset                                                        */
      __IO uint32_t ENUMF      : 1;            /*!< [13..13] Enumeration finished                                             */
      __IO uint32_t ISOOPDIF   : 1;            /*!< [14..14] Isochronous OUT packet dropped interrupt                         */
      __IO uint32_t EOPFIF     : 1;            /*!< [15..15] End of periodic frame interrupt flag                             */
            uint32_t            : 2;
      __I  uint32_t IEPIF      : 1;            /*!< [18..18] IN endpoint interrupt flag                                       */
      __I  uint32_t OEPIF      : 1;            /*!< [19..19] OUT endpoint interrupt flag                                      */
      __IO uint32_t ISOINCIF   : 1;            /*!< [20..20] Isochronous IN transfer Not Complete Interrupt Flag              */
      __IO uint32_t PXNCIF_ISOONCIF : 1;       /*!< [21..21] periodic transfer not complete interrupt flag(Host
                                                     mode)/isochronous OUT transfer not complete interrupt flag(Device
                                                     mode)                                                                     */
            uint32_t            : 2;
      __I  uint32_t HPIF       : 1;            /*!< [24..24] Host port interrupt flag                                         */
      __I  uint32_t HCIF       : 1;            /*!< [25..25] Host channels interrupt flag                                     */
      __I  uint32_t PTXFEIF    : 1;            /*!< [26..26] Periodic TxFIFO empty interrupt flag                             */
            uint32_t            : 1;
      __IO uint32_t IDPSC      : 1;            /*!< [28..28] ID pin status change                                             */
      __IO uint32_t DISCIF     : 1;            /*!< [29..29] Disconnect interrupt flag                                        */
      __IO uint32_t SESIF      : 1;            /*!< [30..30] Session interrupt flag                                           */
      __IO uint32_t WKUPIF     : 1;            /*!< [31..31] Wakeup interrupt flag                                            */
    } GINTF_b;
  } ;

  union {
    __IO uint32_t GINTEN;                      /*!< (@ 0x00000018) Global interrupt enable register (USBFS_GINTEN)            */

    struct {
            uint32_t            : 1;
      __IO uint32_t MFIE       : 1;            /*!< [1..1] Mode fault interrupt enable                                        */
      __IO uint32_t OTGIE      : 1;            /*!< [2..2] OTG interrupt enable                                               */
      __IO uint32_t SOFIE      : 1;            /*!< [3..3] Start of frame interrupt enable                                    */
      __IO uint32_t RXFNEIE    : 1;            /*!< [4..4] Receive FIFO non-empty interrupt enable                            */
      __IO uint32_t NPTXFEIE   : 1;            /*!< [5..5] Non-periodic TxFIFO empty interrupt enable                         */
      __IO uint32_t GNPINAKIE  : 1;            /*!< [6..6] Global non-periodic IN NAK effective interrupt enable              */
      __IO uint32_t GONAKIE    : 1;            /*!< [7..7] Global OUT NAK effective interrupt enable                          */
            uint32_t            : 2;
      __IO uint32_t ESPIE      : 1;            /*!< [10..10] Early suspend interrupt enable                                   */
      __IO uint32_t SPIE       : 1;            /*!< [11..11] USB suspend interrupt enable                                     */
      __IO uint32_t RSTIE      : 1;            /*!< [12..12] USB reset interrupt enable                                       */
      __IO uint32_t ENUMFIE    : 1;            /*!< [13..13] Enumeration finish interrupt enable                              */
      __IO uint32_t ISOOPDIE   : 1;            /*!< [14..14] Isochronous OUT packet dropped interrupt enable                  */
      __IO uint32_t EOPFIE     : 1;            /*!< [15..15] End of periodic frame interrupt enable                           */
            uint32_t            : 2;
      __IO uint32_t IEPIE      : 1;            /*!< [18..18] IN endpoints interrupt enable                                    */
      __IO uint32_t OEPIE      : 1;            /*!< [19..19] OUT endpoints interrupt enable                                   */
      __IO uint32_t ISOINCIE   : 1;            /*!< [20..20] isochronous IN transfer not complete interrupt enable            */
      __IO uint32_t PXNCIE_ISOONCIE : 1;       /*!< [21..21] periodic transfer not compelete Interrupt enable(Host
                                                     mode)/isochronous OUT transfer not complete interrupt enable(Device
                                                     mode)                                                                     */
            uint32_t            : 2;
      __I  uint32_t HPIE       : 1;            /*!< [24..24] Host port interrupt enable                                       */
      __IO uint32_t HCIE       : 1;            /*!< [25..25] Host channels interrupt enable                                   */
      __IO uint32_t PTXFEIE    : 1;            /*!< [26..26] Periodic TxFIFO empty interrupt enable                           */
            uint32_t            : 1;
      __IO uint32_t IDPSCIE    : 1;            /*!< [28..28] ID pin status change interrupt enable                            */
      __IO uint32_t DISCIE     : 1;            /*!< [29..29] Disconnect interrupt enable                                      */
      __IO uint32_t SESIE      : 1;            /*!< [30..30] Session interrupt enable                                         */
      __IO uint32_t WKUPIE     : 1;            /*!< [31..31] Wakeup interrupt enable                                          */
    } GINTEN_b;
  } ;

  union {
    union {
      __I  uint32_t GRSTATR_Device;            /*!< (@ 0x0000001C) Global Receive status read(Device mode)                    */

