RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
      struct {
        __I  uint32_t EPNUM    : 4;            /*!< [3..0] Endpoint number                                                    */
        __I  uint32_t BCOUNT   : 11;           /*!< [14..4] Byte count                                                        */
        __I  uint32_t DPID     : 2;            /*!< [16..15] Data PID                                                         */
        __I  uint32_t RPCKST   : 4;            /*!< [20..17] Recieve packet status                                            */
              uint32_t          : 11;
      } GRSTATR_Device_b;
    } ;

    union {
      __I  uint32_t GRSTATR_Host;              /*!< (@ 0x0000001C) Global Receive status read(Host mode)                      */

      struct {
        __I  uint32_t CNUM     : 4;            /*!< [3..0] Channel number                                                     */
        __I  uint32_t BCOUNT   : 11;           /*!< [14..4] Byte count                                                        */
        __I  uint32_t DPID     : 2;            /*!< [16..15] Data PID                                                         */
        __I  uint32_t RPCKST   : 4;            /*!< [20..17] Reivece packet status                                            */
              uint32_t          : 11;
      } GRSTATR_Host_b;
    } ;
  };

  union {
    union {
      __I  uint32_t GRSTATP_Device;            /*!< (@ 0x00000020) Global Receive status pop(Device mode)                     */

      struct {
        __I  uint32_t EPNUM    : 4;            /*!< [3..0] Endpoint number                                                    */
        __I  uint32_t BCOUNT   : 11;           /*!< [14..4] Byte count                                                        */
        __I  uint32_t DPID     : 2;            /*!< [16..15] Data PID                                                         */
        __I  uint32_t RPCKST   : 4;            /*!< [20..17] Recieve packet status                                            */
              uint32_t          : 11;
      } GRSTATP_Device_b;
    } ;

    union {
      __I  uint32_t GRSTATP_Host;              /*!< (@ 0x00000020) Global Receive status pop(Host mode)                       */

      struct {
        __I  uint32_t CNUM     : 4;            /*!< [3..0] Channel number                                                     */
        __I  uint32_t BCOUNT   : 11;           /*!< [14..4] Byte count                                                        */
        __I  uint32_t DPID     : 2;            /*!< [16..15] Data PID                                                         */
        __I  uint32_t RPCKST   : 4;            /*!< [20..17] Reivece packet status                                            */
              uint32_t          : 11;
      } GRSTATP_Host_b;
    } ;
  };

  union {
    __IO uint32_t GRFLEN;                      /*!< (@ 0x00000024) Global Receive FIFO size register (USBFS_GRFLEN)           */

    struct {
      __IO uint32_t RXFD       : 16;           /*!< [15..0] Rx FIFO depth                                                     */
            uint32_t            : 16;
    } GRFLEN_b;
  } ;

  union {
    union {
      __IO uint32_t HNPTFLEN;                  /*!< (@ 0x00000028) Host non-periodic transmit FIFO length register
                                                                    (Host mode)                                                */

      struct {
        __IO uint32_t HNPTXRSAR : 16;          /*!< [15..0] host non-periodic transmit Tx RAM start address                   */
        __IO uint32_t HNPTXFD  : 16;           /*!< [31..16] host non-periodic TxFIFO depth                                   */
      } HNPTFLEN_b;
    } ;

    union {
      __IO uint32_t DIEP0TFLEN;                /*!< (@ 0x00000028) Device IN endpoint 0 transmit FIFO length (Device
                                                                    mode)                                                      */

      struct {
        __IO uint32_t IEP0TXRSAR : 16;         /*!< [15..0] in endpoint 0 Tx RAM start address                                */
        __IO uint32_t IEP0TXFD : 16;           /*!< [31..16] in endpoint 0 Tx FIFO depth                                      */
      } DIEP0TFLEN_b;
    } ;
  };

  union {
    __I  uint32_t HNPTFQSTAT;                  /*!< (@ 0x0000002C) Host non-periodic transmit FIFO/queue status
                                                                    register (HNPTFQSTAT)                                      */

    struct {
      __I  uint32_t NPTXFS     : 16;           /*!< [15..0] Non-periodic TxFIFO space                                         */
      __I  uint32_t NPTXRQS    : 8;            /*!< [23..16] Non-periodic transmit request queue space                        */
      __I  uint32_t NPTXRQTOP  : 7;            /*!< [30..24] Top of the non-periodic transmit request queue                   */
            uint32_t            : 1;
    } HNPTFQSTAT_b;
  } ;
  __I  uint32_t  RESERVED[2];

  union {
    __IO uint32_t GCCFG;                       /*!< (@ 0x00000038) Global core configuration register (USBFS_GCCFG)           */

    struct {
            uint32_t            : 16;
      __IO uint32_t PWRON      : 1;            /*!< [16..16] Power on                                                         */
            uint32_t            : 1;
      __IO uint32_t VBUSACEN   : 1;            /*!< [18..18] The VBUS A-device Comparer enable                                */
      __IO uint32_t VBUSBCEN   : 1;            /*!< [19..19] The VBUS B-device Comparer enable                                */
      __IO uint32_t SOFOEN     : 1;            /*!< [20..20] SOF output enable                                                */
      __IO uint32_t VBUSIG     : 1;            /*!< [21..21] VBUS ignored                                                     */
            uint32_t            : 10;
    } GCCFG_b;
  } ;

  union {
    __IO uint32_t CID;                         /*!< (@ 0x0000003C) core ID register                                           */

