RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t CID        : 32;           /*!< [31..0] Core ID                                                           */
    } CID_b;
  } ;
  __I  uint32_t  RESERVED1[48];

  union {
    __IO uint32_t HPTFLEN;                     /*!< (@ 0x00000100) Host periodic transmit FIFO length register (HPTFLEN)      */

    struct {
      __IO uint32_t HPTXFSAR   : 16;           /*!< [15..0] Host periodic TxFIFO start address                                */
      __IO uint32_t HPTXFD     : 16;           /*!< [31..16] Host periodic TxFIFO depth                                       */
    } HPTFLEN_b;
  } ;

  union {
    __IO uint32_t DIEP1TFLEN;                  /*!< (@ 0x00000104) device IN endpoint transmit FIFO size register
                                                                    (DIEP1TFLEN)                                               */

    struct {
      __IO uint32_t IEPTXRSAR  : 16;           /*!< [15..0] IN endpoint FIFO transmit RAM start address                       */
      __IO uint32_t IEPTXFD    : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } DIEP1TFLEN_b;
  } ;

  union {
    __IO uint32_t DIEP2TFLEN;                  /*!< (@ 0x00000108) device IN endpoint transmit FIFO size register
                                                                    (DIEP2TFLEN)                                               */

    struct {
      __IO uint32_t IEPTXRSAR  : 16;           /*!< [15..0] IN endpoint FIFO transmit RAM start address                       */
      __IO uint32_t IEPTXFD    : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } DIEP2TFLEN_b;
  } ;

  union {
    __IO uint32_t DIEP3TFLEN;                  /*!< (@ 0x0000010C) device IN endpoint transmit FIFO size register
                                                                    (FS_DIEP3TXFLEN)                                           */

    struct {
      __IO uint32_t IEPTXRSAR  : 16;           /*!< [15..0] IN endpoint FIFO4 transmit RAM start address                      */
      __IO uint32_t IEPTXFD    : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } DIEP3TFLEN_b;
  } ;
} USBFS_GLOBAL_Type;                            /*!< Size = 272 (0x110)                                                        */



/* =========================================================================================================================== */
/* ================                                        USBFS_HOST                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go full speed host (USBFS_HOST)
  */

typedef struct {                                /*!< (@ 0x50000400) USBFS_HOST Structure                                       */

  union {
    __IO uint32_t HCTL;                        /*!< (@ 0x00000000) host configuration register (HCTL)                         */

    struct {
      __IO uint32_t CLKSEL     : 2;            /*!< [1..0] clock select for USB clock                                         */
            uint32_t            : 30;
    } HCTL_b;
  } ;

  union {
    __IO uint32_t HFT;                         /*!< (@ 0x00000004) Host frame interval register                               */

    struct {
      __IO uint32_t FRI        : 16;           /*!< [15..0] Frame interval                                                    */
            uint32_t            : 16;
    } HFT_b;
  } ;

  union {
    __I  uint32_t HFINFR;                      /*!< (@ 0x00000008) FS host frame number/frame time remaining register
                                                                    (HFINFR)                                                   */

    struct {
      __I  uint32_t FRNUM      : 16;           /*!< [15..0] Frame number                                                      */
      __I  uint32_t FRT        : 16;           /*!< [31..16] Frame remaining time                                             */
    } HFINFR_b;
  } ;
  __I  uint32_t  RESERVED;

  union {
    __IO uint32_t HPTFQSTAT;                   /*!< (@ 0x00000010) Host periodic transmit FIFO/queue status register
                                                                    (HPTFQSTAT)                                                */

    struct {
      __I  uint32_t PTXFS      : 16;           /*!< [15..0] Periodic transmit data FIFO space available                       */
      __I  uint32_t PTXREQS    : 8;            /*!< [23..16] Periodic transmit request queue space available                  */
      __I  uint32_t PTXREQT    : 8;            /*!< [31..24] Top of the periodic transmit request queue                       */
    } HPTFQSTAT_b;
  } ;

  union {
    __I  uint32_t HACHINT;                     /*!< (@ 0x00000014) Host all channels interrupt register                       */

    struct {
      __I  uint32_t HACHINT    : 8;            /*!< [7..0] Host all channel interrupts                                        */
            uint32_t            : 24;
    } HACHINT_b;
  } ;

  union {
    __IO uint32_t HACHINTEN;                   /*!< (@ 0x00000018) host all channels interrupt mask register                  */

    struct {
      __IO uint32_t CINTEN     : 8;            /*!< [7..0] Channel interrupt enable                                           */
            uint32_t            : 24;
    } HACHINTEN_b;
  } ;
  __I  uint32_t  RESERVED1[9];

  union {
    __IO uint32_t HPCS;                        /*!< (@ 0x00000040) Host port control and status register (USBFS_HPCS)         */

    struct {
      __I  uint32_t PCST       : 1;            /*!< [0..0] Port connect status                                                */
      __IO uint32_t PCD        : 1;            /*!< [1..1] Port connect detected                                              */
      __IO uint32_t PE         : 1;            /*!< [2..2] Port enable                                                        */
      __IO uint32_t PEDC       : 1;            /*!< [3..3] Port enable/disable change                                         */
            uint32_t            : 2;
      __IO uint32_t PREM       : 1;            /*!< [6..6] Port resume                                                        */
      __IO uint32_t PSP        : 1;            /*!< [7..7] Port suspend                                                       */
      __IO uint32_t PRST       : 1;            /*!< [8..8] Port reset                                                         */
            uint32_t            : 1;
      __I  uint32_t PLST       : 2;            /*!< [11..10] Port line status                                                 */
      __IO uint32_t PP         : 1;            /*!< [12..12] Port power                                                       */
            uint32_t            : 4;
      __I  uint32_t PS         : 2;            /*!< [18..17] Port speed                                                       */
            uint32_t            : 13;
    } HPCS_b;
  } ;
  __I  uint32_t  RESERVED2[47];

  union {
    __IO uint32_t HCH0CTL;                     /*!< (@ 0x00000100) host channel-0 characteristics register (HCH0CTL)          */

