RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t TLEN       : 19;           /*!< [18..0] Transfer length                                                   */
      __IO uint32_t PCNT       : 10;           /*!< [28..19] Packet count                                                     */
      __IO uint32_t DPID       : 2;            /*!< [30..29] Data PID                                                         */
            uint32_t            : 1;
    } HCH3LEN_b;
  } ;
  __I  uint32_t  RESERVED10[3];

  union {
    __IO uint32_t HCH4CTL;                     /*!< (@ 0x00000180) host channel-4 characteristics register (HCH4CTL)          */

    struct {
      __IO uint32_t MPL        : 11;           /*!< [10..0] Maximum packet size                                               */
      __IO uint32_t EPNUM      : 4;            /*!< [14..11] Endpoint number                                                  */
      __IO uint32_t EPDIR      : 1;            /*!< [15..15] Endpoint direction                                               */
            uint32_t            : 1;
      __IO uint32_t LSD        : 1;            /*!< [17..17] Low-speed device                                                 */
      __IO uint32_t EPTYPE     : 2;            /*!< [19..18] Endpoint type                                                    */
            uint32_t            : 2;
      __IO uint32_t DAR        : 7;            /*!< [28..22] Device address                                                   */
      __IO uint32_t ODDFRM     : 1;            /*!< [29..29] Odd frame                                                        */
      __IO uint32_t CDIS       : 1;            /*!< [30..30] Channel disable                                                  */
      __IO uint32_t CEN        : 1;            /*!< [31..31] Channel enable                                                   */
    } HCH4CTL_b;
  } ;
  __I  uint32_t  RESERVED11;

  union {
    __IO uint32_t HCH4INTF;                    /*!< (@ 0x00000188) host channel-4 interrupt register (HCH4INTF)               */

    struct {
      __IO uint32_t TF         : 1;            /*!< [0..0] Transfer finished                                                  */
      __IO uint32_t CH         : 1;            /*!< [1..1] Channel halted                                                     */
            uint32_t            : 1;
      __IO uint32_t STALL      : 1;            /*!< [3..3] STALL response received interrupt                                  */
      __IO uint32_t NAK        : 1;            /*!< [4..4] NAK response received interrupt                                    */
      __IO uint32_t ACK        : 1;            /*!< [5..5] ACK response received/transmitted interrupt                        */
            uint32_t            : 1;
      __IO uint32_t USBER      : 1;            /*!< [7..7] USB bus error                                                      */
      __IO uint32_t BBER       : 1;            /*!< [8..8] Babble error                                                       */
      __IO uint32_t REQOVR     : 1;            /*!< [9..9] Request queue overrun                                              */
      __IO uint32_t DTER       : 1;            /*!< [10..10] Data toggle error                                                */
            uint32_t            : 21;
    } HCH4INTF_b;
  } ;

  union {
    __IO uint32_t HCH4INTEN;                   /*!< (@ 0x0000018C) host channel-4 interrupt enable register (HCH4INTEN)       */

    struct {
      __IO uint32_t TFIE       : 1;            /*!< [0..0] Transfer completed interrupt enable                                */
      __IO uint32_t CHIE       : 1;            /*!< [1..1] Channel halted interrupt enable                                    */
            uint32_t            : 1;
      __IO uint32_t STALLIE    : 1;            /*!< [3..3] STALL interrupt enable                                             */
      __IO uint32_t NAKIE      : 1;            /*!< [4..4] NAK interrupt enable                                               */
      __IO uint32_t ACKIE      : 1;            /*!< [5..5] ACK interrupt enable                                               */
            uint32_t            : 1;
      __IO uint32_t USBERIE    : 1;            /*!< [7..7] USB bus error interrupt enable                                     */
      __IO uint32_t BBERIE     : 1;            /*!< [8..8] Babble error interrupt enable                                      */
      __IO uint32_t REQOVRIE   : 1;            /*!< [9..9] request queue overrun interrupt enable                             */
      __IO uint32_t DTERIE     : 1;            /*!< [10..10] Data toggle error interrupt enable                               */
            uint32_t            : 21;
    } HCH4INTEN_b;
  } ;

  union {
    __IO uint32_t HCH4LEN;                     /*!< (@ 0x00000190) host channel-4 transfer length register                    */

    struct {
      __IO uint32_t TLEN       : 19;           /*!< [18..0] Transfer length                                                   */
      __IO uint32_t PCNT       : 10;           /*!< [28..19] Packet count                                                     */
      __IO uint32_t DPID       : 2;            /*!< [30..29] Data PID                                                         */
            uint32_t            : 1;
    } HCH4LEN_b;
  } ;
  __I  uint32_t  RESERVED12[3];

  union {
    __IO uint32_t HCH5CTL;                     /*!< (@ 0x000001A0) host channel-5 characteristics register (HCH5CTL)          */

    struct {
      __IO uint32_t MPL        : 11;           /*!< [10..0] Maximum packet size                                               */
      __IO uint32_t EPNUM      : 4;            /*!< [14..11] Endpoint number                                                  */
      __IO uint32_t EPDIR      : 1;            /*!< [15..15] Endpoint direction                                               */
            uint32_t            : 1;
      __IO uint32_t LSD        : 1;            /*!< [17..17] Low-speed device                                                 */
      __IO uint32_t EPTYPE     : 2;            /*!< [19..18] Endpoint type                                                    */
            uint32_t            : 2;
      __IO uint32_t DAR        : 7;            /*!< [28..22] Device address                                                   */
      __IO uint32_t ODDFRM     : 1;            /*!< [29..29] Odd frame                                                        */
      __IO uint32_t CDIS       : 1;            /*!< [30..30] Channel disable                                                  */
      __IO uint32_t CEN        : 1;            /*!< [31..31] Channel enable                                                   */
    } HCH5CTL_b;
  } ;
  __I  uint32_t  RESERVED13;

  union {
    __IO uint32_t HCH5INTF;                    /*!< (@ 0x000001A8) host channel-5 interrupt register (HCH5INTF)               */

