RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t TLEN       : 19;           /*!< [18..0] Transfer length                                                   */
      __IO uint32_t PCNT       : 10;           /*!< [28..19] Packet count                                                     */
      __IO uint32_t DPID       : 2;            /*!< [30..29] Data PID                                                         */
            uint32_t            : 1;
    } HCH7LEN_b;
  } ;
} USBFS_HOST_Type;                              /*!< Size = 500 (0x1f4)                                                        */



/* =========================================================================================================================== */
/* ================                                       USBFS_DEVICE                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go full speed device (USBFS_DEVICE)
  */

typedef struct {                                /*!< (@ 0x50000800) USBFS_DEVICE Structure                                     */

  union {
    __IO uint32_t DCFG;                        /*!< (@ 0x00000000) device configuration register (DCFG)                       */

    struct {
      __IO uint32_t DS         : 2;            /*!< [1..0] Device speed                                                       */
      __IO uint32_t NZLSOH     : 1;            /*!< [2..2] Non-zero-length status OUT handshake                               */
            uint32_t            : 1;
      __IO uint32_t DAR        : 7;            /*!< [10..4] Device address                                                    */
      __IO uint32_t EOPFT      : 2;            /*!< [12..11] end of periodic frame time                                       */
            uint32_t            : 19;
    } DCFG_b;
  } ;

  union {
    __IO uint32_t DCTL;                        /*!< (@ 0x00000004) device control register (DCTL)                             */

    struct {
      __IO uint32_t RWKUP      : 1;            /*!< [0..0] Remote wakeup                                                      */
      __IO uint32_t SD         : 1;            /*!< [1..1] Soft disconnect                                                    */
      __I  uint32_t GINS       : 1;            /*!< [2..2] Global IN NAK status                                               */
      __I  uint32_t GONS       : 1;            /*!< [3..3] Global OUT NAK status                                              */
            uint32_t            : 3;
      __O  uint32_t SGINAK     : 1;            /*!< [7..7] Set global IN NAK                                                  */
      __O  uint32_t CGINAK     : 1;            /*!< [8..8] Clear global IN NAK                                                */
      __O  uint32_t SGONAK     : 1;            /*!< [9..9] Set global OUT NAK                                                 */
      __O  uint32_t CGONAK     : 1;            /*!< [10..10] Clear global OUT NAK                                             */
      __IO uint32_t POIF       : 1;            /*!< [11..11] Power-on initialization flag                                     */
            uint32_t            : 20;
    } DCTL_b;
  } ;

  union {
    __I  uint32_t DSTAT;                       /*!< (@ 0x00000008) device status register (DSTAT)                             */

    struct {
      __I  uint32_t SPST       : 1;            /*!< [0..0] Suspend status                                                     */
      __I  uint32_t ES         : 2;            /*!< [2..1] Enumerated speed                                                   */
            uint32_t            : 5;
      __I  uint32_t FNRSOF     : 14;           /*!< [21..8] Frame number of the received SOF                                  */
            uint32_t            : 10;
    } DSTAT_b;
  } ;
  __I  uint32_t  RESERVED;

  union {
    __IO uint32_t DIEPINTEN;                   /*!< (@ 0x00000010) device IN endpoint common interrupt mask register
                                                                    (DIEPINTEN)                                                */

    struct {
      __IO uint32_t TFEN       : 1;            /*!< [0..0] Transfer finished interrupt enable                                 */
      __IO uint32_t EPDISEN    : 1;            /*!< [1..1] Endpoint disabled interrupt enable                                 */
            uint32_t            : 1;
      __IO uint32_t CITOEN     : 1;            /*!< [3..3] Control IN timeout condition interrupt enable (Non-isochronous
                                                     endpoints)                                                                */
      __IO uint32_t EPTXFUDEN  : 1;            /*!< [4..4] Endpoint Tx FIFO underrun interrupt enable bit                     */
            uint32_t            : 1;
      __IO uint32_t IEPNEEN    : 1;            /*!< [6..6] IN endpoint NAK effective interrupt enable                         */
            uint32_t            : 25;
    } DIEPINTEN_b;
  } ;

  union {
    __IO uint32_t DOEPINTEN;                   /*!< (@ 0x00000014) device OUT endpoint common interrupt enable register
                                                                    (DOEPINTEN)                                                */

    struct {
      __IO uint32_t TFEN       : 1;            /*!< [0..0] Transfer finished interrupt enable                                 */
      __IO uint32_t EPDISEN    : 1;            /*!< [1..1] Endpoint disabled interrupt enable                                 */
            uint32_t            : 1;
      __IO uint32_t STPFEN     : 1;            /*!< [3..3] SETUP phase finished interrupt enable                              */
      __IO uint32_t EPRXFOVREN : 1;            /*!< [4..4] Endpoint Rx FIFO overrun interrupt enable                          */
            uint32_t            : 1;
      __IO uint32_t BTBSTPEN   : 1;            /*!< [6..6] Back-to-back SETUP packets interrupt enable                        */
            uint32_t            : 25;
    } DOEPINTEN_b;
  } ;

  union {
    __I  uint32_t DAEPINT;                     /*!< (@ 0x00000018) device all endpoints interrupt register (DAEPINT)          */

