RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __I  uint32_t IEPITB     : 4;            /*!< [3..0] Device all IN endpoint interrupt bits                              */
            uint32_t            : 12;
      __I  uint32_t OEPITB     : 4;            /*!< [19..16] Device all OUT endpoint interrupt bits                           */
            uint32_t            : 12;
    } DAEPINT_b;
  } ;

  union {
    __IO uint32_t DAEPINTEN;                   /*!< (@ 0x0000001C) Device all endpoints interrupt enable register
                                                                    (DAEPINTEN)                                                */

    struct {
      __IO uint32_t IEPIE      : 4;            /*!< [3..0] IN EP interrupt interrupt enable bits                              */
            uint32_t            : 12;
      __IO uint32_t OEPIE      : 4;            /*!< [19..16] OUT endpoint interrupt enable bits                               */
            uint32_t            : 12;
    } DAEPINTEN_b;
  } ;
  __I  uint32_t  RESERVED1[2];

  union {
    __IO uint32_t DVBUSDT;                     /*!< (@ 0x00000028) device VBUS discharge time register                        */

    struct {
      __IO uint32_t DVBUSDT    : 16;           /*!< [15..0] Device VBUS discharge time                                        */
            uint32_t            : 16;
    } DVBUSDT_b;
  } ;

  union {
    __IO uint32_t DVBUSPT;                     /*!< (@ 0x0000002C) device VBUS pulsing time register                          */

    struct {
      __IO uint32_t DVBUSPT    : 12;           /*!< [11..0] Device VBUS pulsing time                                          */
            uint32_t            : 20;
    } DVBUSPT_b;
  } ;
  __I  uint32_t  RESERVED2;

  union {
    __IO uint32_t DIEPFEINTEN;                 /*!< (@ 0x00000034) device IN endpoint FIFO empty interrupt enable
                                                                    register                                                   */

    struct {
      __IO uint32_t IEPTXFEIE  : 4;            /*!< [3..0] IN EP Tx FIFO empty interrupt enable bits                          */
            uint32_t            : 28;
    } DIEPFEINTEN_b;
  } ;
  __I  uint32_t  RESERVED3[50];

  union {
    __IO uint32_t DIEP0CTL;                    /*!< (@ 0x00000100) device IN endpoint 0 control register (DIEP0CTL)           */

    struct {
      __IO uint32_t MPL        : 2;            /*!< [1..0] Maximum packet length                                              */
            uint32_t            : 13;
      __I  uint32_t EPACT      : 1;            /*!< [15..15] endpoint active                                                  */
            uint32_t            : 1;
      __I  uint32_t NAKS       : 1;            /*!< [17..17] NAK status                                                       */
      __I  uint32_t EPTYPE     : 2;            /*!< [19..18] Endpoint type                                                    */
            uint32_t            : 1;
      __IO uint32_t STALL      : 1;            /*!< [21..21] STALL handshake                                                  */
      __IO uint32_t TXFNUM     : 4;            /*!< [25..22] TxFIFO number                                                    */
      __O  uint32_t CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __O  uint32_t SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
            uint32_t            : 2;
      __IO uint32_t EPD        : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IO uint32_t EPEN       : 1;            /*!< [31..31] Endpoint enable                                                  */
    } DIEP0CTL_b;
  } ;
  __I  uint32_t  RESERVED4;

  union {
    __IO uint32_t DIEP0INTF;                   /*!< (@ 0x00000108) device endpoint-0 interrupt register                       */

    struct {
      __IO uint32_t TF         : 1;            /*!< [0..0] Transfer finished                                                  */
      __IO uint32_t EPDIS      : 1;            /*!< [1..1] Endpoint finished                                                  */
            uint32_t            : 1;
      __IO uint32_t CITO       : 1;            /*!< [3..3] Control in timeout interrupt                                       */
      __IO uint32_t EPTXFUD    : 1;            /*!< [4..4] Endpoint Tx FIFO underrun                                          */
            uint32_t            : 1;
      __IO uint32_t IEPNE      : 1;            /*!< [6..6] IN endpoint NAK effective                                          */
      __I  uint32_t TXFE       : 1;            /*!< [7..7] Transmit FIFO empty                                                */
            uint32_t            : 24;
    } DIEP0INTF_b;
  } ;
  __I  uint32_t  RESERVED5;

  union {
    __IO uint32_t DIEP0LEN;                    /*!< (@ 0x00000110) device IN endpoint-0 transfer length register              */

    struct {
      __IO uint32_t TLEN       : 7;            /*!< [6..0] Transfer length                                                    */
            uint32_t            : 12;
      __IO uint32_t PCNT       : 2;            /*!< [20..19] Packet count                                                     */
            uint32_t            : 11;
    } DIEP0LEN_b;
  } ;
  __I  uint32_t  RESERVED6;

  union {
    __I  uint32_t DIEP0TFSTAT;                 /*!< (@ 0x00000118) device IN endpoint 0 transmit FIFO status register         */

    struct {
      __I  uint32_t IEPTFS     : 16;           /*!< [15..0] IN endpoint TxFIFO space remaining                                */
            uint32_t            : 16;
    } DIEP0TFSTAT_b;
  } ;
  __I  uint32_t  RESERVED7;

  union {
    __IO uint32_t DIEP1CTL;                    /*!< (@ 0x00000120) device in endpoint-1 control register                      */

