RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t MPL        : 11;           /*!< [10..0] maximum packet length                                             */
            uint32_t            : 4;
      __IO uint32_t EPACT      : 1;            /*!< [15..15] Endpoint active                                                  */
      __I  uint32_t EOFRM_DPID : 1;            /*!< [16..16] EOFRM/DPID                                                       */
      __I  uint32_t NAKS       : 1;            /*!< [17..17] NAK status                                                       */
      __IO uint32_t EPTYPE     : 2;            /*!< [19..18] Endpoint type                                                    */
            uint32_t            : 1;
      __IO uint32_t STALL      : 1;            /*!< [21..21] STALL handshake                                                  */
      __IO uint32_t TXFNUM     : 4;            /*!< [25..22] Tx FIFO number                                                   */
      __O  uint32_t CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __O  uint32_t SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
      __O  uint32_t SD0PID_SEVENFRM : 1;       /*!< [28..28] SD0PID/SEVNFRM                                                   */
      __O  uint32_t SD1PID_SODDFRM : 1;        /*!< [29..29] Set DATA1 PID/Set odd frame                                      */
      __IO uint32_t EPD        : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IO uint32_t EPEN       : 1;            /*!< [31..31] Endpoint enable                                                  */
    } DIEP1CTL_b;
  } ;
  __I  uint32_t  RESERVED8;

  union {
    __IO uint32_t DIEP1INTF;                   /*!< (@ 0x00000128) device endpoint-1 interrupt register                       */

    struct {
      __IO uint32_t TF         : 1;            /*!< [0..0] Transfer finished                                                  */
      __IO uint32_t EPDIS      : 1;            /*!< [1..1] Endpoint finished                                                  */
            uint32_t            : 1;
      __IO uint32_t CITO       : 1;            /*!< [3..3] Control in timeout interrupt                                       */
      __IO uint32_t EPTXFUD    : 1;            /*!< [4..4] Endpoint Tx FIFO underrun                                          */
            uint32_t            : 1;
      __IO uint32_t IEPNE      : 1;            /*!< [6..6] IN endpoint NAK effective                                          */
      __I  uint32_t TXFE       : 1;            /*!< [7..7] Transmit FIFO empty                                                */
            uint32_t            : 24;
    } DIEP1INTF_b;
  } ;
  __I  uint32_t  RESERVED9;

  union {
    __IO uint32_t DIEP1LEN;                    /*!< (@ 0x00000130) device IN endpoint-1 transfer length register              */

    struct {
      __IO uint32_t TLEN       : 19;           /*!< [18..0] Transfer length                                                   */
      __IO uint32_t PCNT       : 10;           /*!< [28..19] Packet count                                                     */
      __IO uint32_t MCPF       : 2;            /*!< [30..29] Multi packet count per frame                                     */
            uint32_t            : 1;
    } DIEP1LEN_b;
  } ;
  __I  uint32_t  RESERVED10;

  union {
    __I  uint32_t DIEP1TFSTAT;                 /*!< (@ 0x00000138) device IN endpoint 1 transmit FIFO status register         */

    struct {
      __I  uint32_t IEPTFS     : 16;           /*!< [15..0] IN endpoint TxFIFO space remaining                                */
            uint32_t            : 16;
    } DIEP1TFSTAT_b;
  } ;
  __I  uint32_t  RESERVED11;

  union {
    __IO uint32_t DIEP2CTL;                    /*!< (@ 0x00000140) device endpoint-2 control register                         */

    struct {
      __IO uint32_t MPL        : 11;           /*!< [10..0] maximum packet length                                             */
            uint32_t            : 4;
      __IO uint32_t EPACT      : 1;            /*!< [15..15] Endpoint active                                                  */
      __I  uint32_t EOFRM_DPID : 1;            /*!< [16..16] EOFRM/DPID                                                       */
      __I  uint32_t NAKS       : 1;            /*!< [17..17] NAK status                                                       */
      __IO uint32_t EPTYPE     : 2;            /*!< [19..18] Endpoint type                                                    */
            uint32_t            : 1;
      __IO uint32_t STALL      : 1;            /*!< [21..21] STALL handshake                                                  */
      __IO uint32_t TXFNUM     : 4;            /*!< [25..22] Tx FIFO number                                                   */
      __O  uint32_t CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __O  uint32_t SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
      __O  uint32_t SD0PID_SEVENFRM : 1;       /*!< [28..28] SD0PID/SEVNFRM                                                   */
      __O  uint32_t SD1PID_SODDFRM : 1;        /*!< [29..29] Set DATA1 PID/Set odd frame                                      */
      __IO uint32_t EPD        : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IO uint32_t EPEN       : 1;            /*!< [31..31] Endpoint enable                                                  */
    } DIEP2CTL_b;
  } ;
  __I  uint32_t  RESERVED12;

  union {
    __IO uint32_t DIEP2INTF;                   /*!< (@ 0x00000148) device endpoint-2 interrupt register                       */

