RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __I  uint32_t MPL        : 2;            /*!< [1..0] Maximum packet length                                              */
            uint32_t            : 13;
      __I  uint32_t EPACT      : 1;            /*!< [15..15] Endpoint active                                                  */
            uint32_t            : 1;
      __I  uint32_t NAKS       : 1;            /*!< [17..17] NAK status                                                       */
      __I  uint32_t EPTYPE     : 2;            /*!< [19..18] Endpoint type                                                    */
      __IO uint32_t SNOOP      : 1;            /*!< [20..20] Snoop mode                                                       */
      __IO uint32_t STALL      : 1;            /*!< [21..21] STALL handshake                                                  */
            uint32_t            : 4;
      __O  uint32_t CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __O  uint32_t SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
            uint32_t            : 2;
      __I  uint32_t EPD        : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IO uint32_t EPEN       : 1;            /*!< [31..31] Endpoint enable                                                  */
    } DOEP0CTL_b;
  } ;
  __I  uint32_t  RESERVED20;

  union {
    __IO uint32_t DOEP0INTF;                   /*!< (@ 0x00000308) device out endpoint-0 interrupt flag  register             */

    struct {
      __IO uint32_t TF         : 1;            /*!< [0..0] Transfer finished                                                  */
      __IO uint32_t EPDIS      : 1;            /*!< [1..1] Endpoint disabled                                                  */
            uint32_t            : 1;
      __IO uint32_t STPF       : 1;            /*!< [3..3] Setup phase finished                                               */
      __IO uint32_t EPRXFOVR   : 1;            /*!< [4..4] Endpoint Rx FIFO overrun                                           */
            uint32_t            : 1;
      __IO uint32_t BTBSTP     : 1;            /*!< [6..6] Back-to-back SETUP packets                                         */
            uint32_t            : 25;
    } DOEP0INTF_b;
  } ;
  __I  uint32_t  RESERVED21;

  union {
    __IO uint32_t DOEP0LEN;                    /*!< (@ 0x00000310) device OUT endpoint-0 transfer length register             */

    struct {
      __IO uint32_t TLEN       : 7;            /*!< [6..0] Transfer length                                                    */
            uint32_t            : 12;
      __IO uint32_t PCNT       : 1;            /*!< [19..19] Packet count                                                     */
            uint32_t            : 9;
      __IO uint32_t STPCNT     : 2;            /*!< [30..29] SETUP packet count                                               */
            uint32_t            : 1;
    } DOEP0LEN_b;
  } ;
  __I  uint32_t  RESERVED22[3];

  union {
    __IO uint32_t DOEP1CTL;                    /*!< (@ 0x00000320) device endpoint-1 control register                         */

    struct {
      __IO uint32_t MPL        : 11;           /*!< [10..0] maximum packet length                                             */
            uint32_t            : 4;
      __IO uint32_t EPACT      : 1;            /*!< [15..15] Endpoint active                                                  */
      __I  uint32_t EOFRM_DPID : 1;            /*!< [16..16] EOFRM/DPID                                                       */
      __I  uint32_t NAKS       : 1;            /*!< [17..17] NAK status                                                       */
      __IO uint32_t EPTYPE     : 2;            /*!< [19..18] Endpoint type                                                    */
      __IO uint32_t SNOOP      : 1;            /*!< [20..20] Snoop mode                                                       */
      __IO uint32_t STALL      : 1;            /*!< [21..21] STALL handshake                                                  */
            uint32_t            : 4;
      __O  uint32_t CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __O  uint32_t SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
      __O  uint32_t SD0PID_SEVENFRM : 1;       /*!< [28..28] SD0PID/SEVENFRM                                                  */
      __O  uint32_t SD1PID_SODDFRM : 1;        /*!< [29..29] SD1PID/SODDFRM                                                   */
      __IO uint32_t EPD        : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IO uint32_t EPEN       : 1;            /*!< [31..31] Endpoint enable                                                  */
    } DOEP1CTL_b;
  } ;
  __I  uint32_t  RESERVED23;

  union {
    __IO uint32_t DOEP1INTF;                   /*!< (@ 0x00000328) device out endpoint-1 interrupt flag  register             */

    struct {
      __IO uint32_t TF         : 1;            /*!< [0..0] Transfer finished                                                  */
      __IO uint32_t EPDIS      : 1;            /*!< [1..1] Endpoint disabled                                                  */
            uint32_t            : 1;
      __IO uint32_t STPF       : 1;            /*!< [3..3] Setup phase finished                                               */
      __IO uint32_t EPRXFOVR   : 1;            /*!< [4..4] Endpoint Rx FIFO overrun                                           */
            uint32_t            : 1;
      __IO uint32_t BTBSTP     : 1;            /*!< [6..6] Back-to-back SETUP packets                                         */
            uint32_t            : 25;
    } DOEP1INTF_b;
  } ;
  __I  uint32_t  RESERVED24;

  union {
    __IO uint32_t DOEP1LEN;                    /*!< (@ 0x00000330) device OUT endpoint-1 transfer length register             */

