RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t TLEN       : 19;           /*!< [18..0] Transfer length                                                   */
      __IO uint32_t PCNT       : 10;           /*!< [28..19] Packet count                                                     */
      __IO uint32_t STPCNT_RXDPID : 2;         /*!< [30..29] SETUP packet count/Received data PID                             */
            uint32_t            : 1;
    } DOEP1LEN_b;
  } ;
  __I  uint32_t  RESERVED25[3];

  union {
    __IO uint32_t DOEP2CTL;                    /*!< (@ 0x00000340) device endpoint-2 control register                         */

    struct {
      __IO uint32_t MPL        : 11;           /*!< [10..0] maximum packet length                                             */
            uint32_t            : 4;
      __IO uint32_t EPACT      : 1;            /*!< [15..15] Endpoint active                                                  */
      __I  uint32_t EOFRM_DPID : 1;            /*!< [16..16] EOFRM/DPID                                                       */
      __I  uint32_t NAKS       : 1;            /*!< [17..17] NAK status                                                       */
      __IO uint32_t EPTYPE     : 2;            /*!< [19..18] Endpoint type                                                    */
      __IO uint32_t SNOOP      : 1;            /*!< [20..20] Snoop mode                                                       */
      __IO uint32_t STALL      : 1;            /*!< [21..21] STALL handshake                                                  */
            uint32_t            : 4;
      __O  uint32_t CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __O  uint32_t SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
      __O  uint32_t SD0PID_SEVENFRM : 1;       /*!< [28..28] SD0PID/SEVENFRM                                                  */
      __O  uint32_t SD1PID_SODDFRM : 1;        /*!< [29..29] SD1PID/SODDFRM                                                   */
      __IO uint32_t EPD        : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IO uint32_t EPEN       : 1;            /*!< [31..31] Endpoint enable                                                  */
    } DOEP2CTL_b;
  } ;
  __I  uint32_t  RESERVED26;

  union {
    __IO uint32_t DOEP2INTF;                   /*!< (@ 0x00000348) device out endpoint-2 interrupt flag  register             */

    struct {
      __IO uint32_t TF         : 1;            /*!< [0..0] Transfer finished                                                  */
      __IO uint32_t EPDIS      : 1;            /*!< [1..1] Endpoint disabled                                                  */
            uint32_t            : 1;
      __IO uint32_t STPF       : 1;            /*!< [3..3] Setup phase finished                                               */
      __IO uint32_t EPRXFOVR   : 1;            /*!< [4..4] Endpoint Rx FIFO overrun                                           */
            uint32_t            : 1;
      __IO uint32_t BTBSTP     : 1;            /*!< [6..6] Back-to-back SETUP packets                                         */
            uint32_t            : 25;
    } DOEP2INTF_b;
  } ;
  __I  uint32_t  RESERVED27;

  union {
    __IO uint32_t DOEP2LEN;                    /*!< (@ 0x00000350) device OUT endpoint-2 transfer length register             */

    struct {
      __IO uint32_t TLEN       : 19;           /*!< [18..0] Transfer length                                                   */
      __IO uint32_t PCNT       : 10;           /*!< [28..19] Packet count                                                     */
      __IO uint32_t STPCNT_RXDPID : 2;         /*!< [30..29] SETUP packet count/Received data PID                             */
            uint32_t            : 1;
    } DOEP2LEN_b;
  } ;
  __I  uint32_t  RESERVED28[3];

  union {
    __IO uint32_t DOEP3CTL;                    /*!< (@ 0x00000360) device endpoint-3 control register                         */

    struct {
      __IO uint32_t MPL        : 11;           /*!< [10..0] maximum packet length                                             */
            uint32_t            : 4;
      __IO uint32_t EPACT      : 1;            /*!< [15..15] Endpoint active                                                  */
      __I  uint32_t EOFRM_DPID : 1;            /*!< [16..16] EOFRM/DPID                                                       */
      __I  uint32_t NAKS       : 1;            /*!< [17..17] NAK status                                                       */
      __IO uint32_t EPTYPE     : 2;            /*!< [19..18] Endpoint type                                                    */
      __IO uint32_t SNOOP      : 1;            /*!< [20..20] Snoop mode                                                       */
      __IO uint32_t STALL      : 1;            /*!< [21..21] STALL handshake                                                  */
            uint32_t            : 4;
      __O  uint32_t CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __O  uint32_t SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
      __O  uint32_t SD0PID_SEVENFRM : 1;       /*!< [28..28] SD0PID/SEVENFRM                                                  */
      __O  uint32_t SD1PID_SODDFRM : 1;        /*!< [29..29] SD1PID/SODDFRM                                                   */
      __IO uint32_t EPD        : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IO uint32_t EPEN       : 1;            /*!< [31..31] Endpoint enable                                                  */
    } DOEP3CTL_b;
  } ;
  __I  uint32_t  RESERVED29;

  union {
    __IO uint32_t DOEP3INTF;                   /*!< (@ 0x00000368) device out endpoint-3 interrupt flag  register             */

