RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
    struct {
      __IO uint32_t TF         : 1;            /*!< [0..0] Transfer finished                                                  */
      __IO uint32_t EPDIS      : 1;            /*!< [1..1] Endpoint disabled                                                  */
            uint32_t            : 1;
      __IO uint32_t STPF       : 1;            /*!< [3..3] Setup phase finished                                               */
      __IO uint32_t EPRXFOVR   : 1;            /*!< [4..4] Endpoint Rx FIFO overrun                                           */
            uint32_t            : 1;
      __IO uint32_t BTBSTP     : 1;            /*!< [6..6] Back-to-back SETUP packets                                         */
            uint32_t            : 25;
    } DOEP3INTF_b;
  } ;
  __I  uint32_t  RESERVED30;

  union {
    __IO uint32_t DOEP3LEN;                    /*!< (@ 0x00000370) device OUT endpoint-3 transfer length register             */

    struct {
      __IO uint32_t TLEN       : 19;           /*!< [18..0] Transfer length                                                   */
      __IO uint32_t PCNT       : 10;           /*!< [28..19] Packet count                                                     */
      __IO uint32_t STPCNT_RXDPID : 2;         /*!< [30..29] SETUP packet count/Received data PID                             */
            uint32_t            : 1;
    } DOEP3LEN_b;
  } ;
} USBFS_DEVICE_Type;                            /*!< Size = 884 (0x374)                                                        */



/* =========================================================================================================================== */
/* ================                                       USBFS_PWRCLK                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go full speed (USBFS_PWRCLK)
  */

typedef struct {                                /*!< (@ 0x50000E00) USBFS_PWRCLK Structure                                     */

  union {
    __IO uint32_t PWRCLKCTL;                   /*!< (@ 0x00000000) power and clock gating control register (PWRCLKCTL)        */

    struct {
      __IO uint32_t SUCLK      : 1;            /*!< [0..0] Stop the USB clock                                                 */
      __IO uint32_t SHCLK      : 1;            /*!< [1..1] Stop HCLK                                                          */
            uint32_t            : 30;
    } PWRCLKCTL_b;
  } ;
} USBFS_PWRCLK_Type;                            /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           WWDGT                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Window watchdog timer (WWDGT)
  */

typedef struct {                                /*!< (@ 0x40002C00) WWDGT Structure                                            */

  union {
    __IO uint32_t CTL;                         /*!< (@ 0x00000000) Control register                                           */

    struct {
      __IO uint32_t CNT        : 7;            /*!< [6..0] 7-bit counter                                                      */
      __IO uint32_t WDGTEN     : 1;            /*!< [7..7] Activation bit                                                     */
            uint32_t            : 24;
    } CTL_b;
  } ;

  union {
    __IO uint32_t CFG;                         /*!< (@ 0x00000004) Configuration register                                     */

    struct {
      __IO uint32_t WIN        : 7;            /*!< [6..0] 7-bit window value                                                 */
      __IO uint32_t PSC        : 2;            /*!< [8..7] Prescaler                                                          */
      __IO uint32_t EWIE       : 1;            /*!< [9..9] Early wakeup interrupt                                             */
            uint32_t            : 22;
    } CFG_b;
  } ;

  union {
    __IO uint32_t STAT;                        /*!< (@ 0x00000008) Status register                                            */

    struct {
      __IO uint32_t EWIF       : 1;            /*!< [0..0] Early wakeup interrupt flag                                        */
            uint32_t            : 31;
    } STAT_b;
  } ;
} WWDGT_Type;                                   /*!< Size = 12 (0xc)                                                           */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

//#define ADC0_BASE                   0x40012400UL
//#define ADC1_BASE                   0x40012800UL
//#define AFIO_BASE                   0x40010000UL
//#define BKP_BASE                    0x40006C00UL
//#define CAN0_BASE                   0x40006400UL
//#define CAN1_BASE                   0x40006800UL
//#define CRC_BASE                    0x40023000UL
//#define DAC_BASE                    0x40007400UL
//#define DBG_BASE                    0xE0042000UL
//#define DMA0_BASE                   0x40020000UL
//#define DMA1_BASE                   0x40020400UL
//#define EXMC_BASE                   0xA0000000UL
//#define EXTI_BASE                   0x40010400UL
//#define FMC_BASE                    0x40022000UL
//#define FWDGT_BASE                  0x40003000UL
//#define GPIOA_BASE                  0x40010800UL
//#define GPIOB_BASE                  0x40010C00UL
//#define GPIOC_BASE                  0x40011000UL
//#define GPIOD_BASE                  0x40011400UL
//#define GPIOE_BASE                  0x40011800UL
#define I2C0_BASE                   0x40005400UL
#define I2C1_BASE                   0x40005800UL
//#define ECLIC_BASE                  0xD2000000UL
//#define PMU_BASE                    0x40007000UL
//#define RCU_BASE                    0x40021000UL
//#define RTC_BASE                    0x40002800UL
#define SPI0_BASE                   0x40013000UL
#define SPI1_BASE                   0x40003800UL
#define SPI2_BASE                   0x40003C00UL
#define TIMER0_BASE                 0x40012C00UL
#define TIMER1_BASE                 0x40000000UL
#define TIMER2_BASE                 0x40000400UL
#define TIMER3_BASE                 0x40000800UL
#define TIMER4_BASE                 0x40000C00UL
#define TIMER5_BASE                 0x40001000UL
#define TIMER6_BASE                 0x40001400UL
#define USART0_BASE                 0x40013800UL
#define USART1_BASE                 0x40004400UL
#define USART2_BASE                 0x40004800UL
//#define UART3_BASE                  0x40004C00UL
//#define UART4_BASE                  0x40005000UL
//#define USBFS_GLOBAL_BASE           0x50000000UL
//#define USBFS_HOST_BASE             0x50000400UL
//#define USBFS_DEVICE_BASE           0x50000800UL
//#define USBFS_PWRCLK_BASE           0x50000E00UL
//#define WWDGT_BASE                  0x40002C00UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define ADC0                        ((ADC0_Type*)              ADC0_BASE)
#define ADC1                        ((ADC1_Type*)              ADC1_BASE)
#define AFIO                        ((AFIO_Type*)              AFIO_BASE)
#define BKP                         ((BKP_Type*)               BKP_BASE)
#define CAN0                        ((CAN0_Type*)              CAN0_BASE)
#define CAN1                        ((CAN0_Type*)              CAN1_BASE)
#define CRC                         ((CRC_Type*)               CRC_BASE)
#define DAC                         ((DAC_Type*)               DAC_BASE)
#define DBG                         ((DBG_Type*)               DBG_BASE)
#define DMA0                        ((DMA0_Type*)              DMA0_BASE)
#define DMA1                        ((DMA1_Type*)              DMA1_BASE)
#define EXMC                        ((EXMC_Type*)              EXMC_BASE)
#define EXTI                        ((EXTI_Type*)              EXTI_BASE)
#define FMC                         ((FMC_Type*)               FMC_BASE)
#define FWDGT                       ((FWDGT_Type*)             FWDGT_BASE)
#define GPIOA                       ((GPIO_Type*)              GPIOA_BASE)
#define GPIOB                       ((GPIO_Type*)              GPIOB_BASE)
#define GPIOC                       ((GPIO_Type*)              GPIOC_BASE)
#define GPIOD                       ((GPIO_Type*)              GPIOD_BASE)
#define GPIOE                       ((GPIO_Type*)              GPIOE_BASE)
#define I2C0                        ((I2C_Type*)               I2C0_BASE)
#define I2C1                        ((I2C_Type*)               I2C1_BASE)
#define ECLIC                       ((ECLIC_Type*)             ECLIC_BASE)
#define PMU                         ((PMU_Type*)               PMU_BASE)
#define RCU                         ((RCU_Type*)               RCU_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define SPI0                        ((SPI_Type*)              SPI0_BASE)
#define SPI1                        ((SPI_Type*)              SPI1_BASE)
#define SPI2                        ((SPI_Type*)              SPI2_BASE)
#define TIMER0                      ((TIMER_Type*)            TIMER0_BASE)
#define TIMER1                      ((TIMER_Type*)            TIMER1_BASE)
#define TIMER2                      ((TIMER_Type*)            TIMER2_BASE)
#define TIMER3                      ((TIMER_Type*)            TIMER3_BASE)
#define TIMER4                      ((TIMER_Type*)            TIMER4_BASE)
#define TIMER5                      ((TIMER_Type*)            TIMER5_BASE)
#define TIMER6                      ((TIMER_Type*)            TIMER6_BASE)
#define USART0                      ((USART_Type*)             USART0_BASE)
#define USART1                      ((USART_Type*)             USART1_BASE)
#define USART2                      ((USART_Type*)             USART2_BASE)
#define UART3                       ((UART_Type*)              UART3_BASE)
#define UART4                       ((UART_Type*)              UART4_BASE)
#define USBFS_GLOBAL                ((USBFS_GLOBAL_Type*)      USBFS_GLOBAL_BASE)
#define USBFS_HOST                  ((USBFS_HOST_Type*)        USBFS_HOST_BASE)
#define USBFS_DEVICE                ((USBFS_DEVICE_Type*)      USBFS_DEVICE_BASE)
#define USBFS_PWRCLK                ((USBFS_PWRCLK_Type*)      USBFS_PWRCLK_BASE)
#define WWDGT                       ((WWDGT_Type*)             WWDGT_BASE)

