RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define ADC1_ISQ_ISQ3_Pos                 (15UL)                    /*!< ISQ3 (Bit 15)                                         */
#define ADC1_ISQ_ISQ3_Msk                 (0xf8000UL)               /*!< ISQ3 (Bitfield-Mask: 0x1f)                            */
#define ADC1_ISQ_ISQ2_Pos                 (10UL)                    /*!< ISQ2 (Bit 10)                                         */
#define ADC1_ISQ_ISQ2_Msk                 (0x7c00UL)                /*!< ISQ2 (Bitfield-Mask: 0x1f)                            */
#define ADC1_ISQ_ISQ1_Pos                 (5UL)                     /*!< ISQ1 (Bit 5)                                          */
#define ADC1_ISQ_ISQ1_Msk                 (0x3e0UL)                 /*!< ISQ1 (Bitfield-Mask: 0x1f)                            */
#define ADC1_ISQ_ISQ0_Pos                 (0UL)                     /*!< ISQ0 (Bit 0)                                          */
#define ADC1_ISQ_ISQ0_Msk                 (0x1fUL)                  /*!< ISQ0 (Bitfield-Mask: 0x1f)                            */
/* ========================================================  IDATA0  ========================================================= */
#define ADC1_IDATA0_IDATAn_Pos            (0UL)                     /*!< IDATAn (Bit 0)                                        */
#define ADC1_IDATA0_IDATAn_Msk            (0xffffUL)                /*!< IDATAn (Bitfield-Mask: 0xffff)                        */
/* ========================================================  IDATA1  ========================================================= */
#define ADC1_IDATA1_IDATAn_Pos            (0UL)                     /*!< IDATAn (Bit 0)                                        */
#define ADC1_IDATA1_IDATAn_Msk            (0xffffUL)                /*!< IDATAn (Bitfield-Mask: 0xffff)                        */
/* ========================================================  IDATA2  ========================================================= */
#define ADC1_IDATA2_IDATAn_Pos            (0UL)                     /*!< IDATAn (Bit 0)                                        */
#define ADC1_IDATA2_IDATAn_Msk            (0xffffUL)                /*!< IDATAn (Bitfield-Mask: 0xffff)                        */
/* ========================================================  IDATA3  ========================================================= */
#define ADC1_IDATA3_IDATAn_Pos            (0UL)                     /*!< IDATAn (Bit 0)                                        */
#define ADC1_IDATA3_IDATAn_Msk            (0xffffUL)                /*!< IDATAn (Bitfield-Mask: 0xffff)                        */
/* =========================================================  RDATA  ========================================================= */
#define ADC1_RDATA_RDATA_Pos              (0UL)                     /*!< RDATA (Bit 0)                                         */
#define ADC1_RDATA_RDATA_Msk              (0xffffUL)                /*!< RDATA (Bitfield-Mask: 0xffff)                         */


/* =========================================================================================================================== */
/* ================                                           AFIO                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  EC  =========================================================== */
#define AFIO_EC_EOE_Pos                   (7UL)                     /*!< EOE (Bit 7)                                           */
#define AFIO_EC_EOE_Msk                   (0x80UL)                  /*!< EOE (Bitfield-Mask: 0x01)                             */
#define AFIO_EC_PORT_Pos                  (4UL)                     /*!< PORT (Bit 4)                                          */
#define AFIO_EC_PORT_Msk                  (0x70UL)                  /*!< PORT (Bitfield-Mask: 0x07)                            */
#define AFIO_EC_PIN_Pos                   (0UL)                     /*!< PIN (Bit 0)                                           */
#define AFIO_EC_PIN_Msk                   (0xfUL)                   /*!< PIN (Bitfield-Mask: 0x0f)                             */
/* =========================================================  PCF0  ========================================================== */
#define AFIO_PCF0_TIMER1ITI1_REMAP_Pos    (29UL)                    /*!< TIMER1ITI1_REMAP (Bit 29)                             */
#define AFIO_PCF0_TIMER1ITI1_REMAP_Msk    (0x20000000UL)            /*!< TIMER1ITI1_REMAP (Bitfield-Mask: 0x01)                */
#define AFIO_PCF0_SPI2_REMAP_Pos          (28UL)                    /*!< SPI2_REMAP (Bit 28)                                   */
#define AFIO_PCF0_SPI2_REMAP_Msk          (0x10000000UL)            /*!< SPI2_REMAP (Bitfield-Mask: 0x01)                      */
#define AFIO_PCF0_SWJ_CFG_Pos             (24UL)                    /*!< SWJ_CFG (Bit 24)                                      */
#define AFIO_PCF0_SWJ_CFG_Msk             (0x7000000UL)             /*!< SWJ_CFG (Bitfield-Mask: 0x07)                         */
#define AFIO_PCF0_CAN1_REMAP_Pos          (22UL)                    /*!< CAN1_REMAP (Bit 22)                                   */
#define AFIO_PCF0_CAN1_REMAP_Msk          (0x400000UL)              /*!< CAN1_REMAP (Bitfield-Mask: 0x01)                      */
#define AFIO_PCF0_TIMER4CH3_IREMAP_Pos    (16UL)                    /*!< TIMER4CH3_IREMAP (Bit 16)                             */
#define AFIO_PCF0_TIMER4CH3_IREMAP_Msk    (0x10000UL)               /*!< TIMER4CH3_IREMAP (Bitfield-Mask: 0x01)                */
#define AFIO_PCF0_PD01_REMAP_Pos          (15UL)                    /*!< PD01_REMAP (Bit 15)                                   */
#define AFIO_PCF0_PD01_REMAP_Msk          (0x8000UL)                /*!< PD01_REMAP (Bitfield-Mask: 0x01)                      */
#define AFIO_PCF0_CAN0_REMAP_Pos          (13UL)                    /*!< CAN0_REMAP (Bit 13)                                   */
#define AFIO_PCF0_CAN0_REMAP_Msk          (0x6000UL)                /*!< CAN0_REMAP (Bitfield-Mask: 0x03)                      */
#define AFIO_PCF0_TIMER3_REMAP_Pos        (12UL)                    /*!< TIMER3_REMAP (Bit 12)                                 */
#define AFIO_PCF0_TIMER3_REMAP_Msk        (0x1000UL)                /*!< TIMER3_REMAP (Bitfield-Mask: 0x01)                    */
#define AFIO_PCF0_TIMER2_REMAP_Pos        (10UL)                    /*!< TIMER2_REMAP (Bit 10)                                 */
#define AFIO_PCF0_TIMER2_REMAP_Msk        (0xc00UL)                 /*!< TIMER2_REMAP (Bitfield-Mask: 0x03)                    */
#define AFIO_PCF0_TIMER1_REMAP_Pos        (8UL)                     /*!< TIMER1_REMAP (Bit 8)                                  */
#define AFIO_PCF0_TIMER1_REMAP_Msk        (0x300UL)                 /*!< TIMER1_REMAP (Bitfield-Mask: 0x03)                    */
#define AFIO_PCF0_TIMER0_REMAP_Pos        (6UL)                     /*!< TIMER0_REMAP (Bit 6)                                  */
#define AFIO_PCF0_TIMER0_REMAP_Msk        (0xc0UL)                  /*!< TIMER0_REMAP (Bitfield-Mask: 0x03)                    */
#define AFIO_PCF0_USART2_REMAP_Pos        (4UL)                     /*!< USART2_REMAP (Bit 4)                                  */
#define AFIO_PCF0_USART2_REMAP_Msk        (0x30UL)                  /*!< USART2_REMAP (Bitfield-Mask: 0x03)                    */
#define AFIO_PCF0_USART1_REMAP_Pos        (3UL)                     /*!< USART1_REMAP (Bit 3)                                  */
#define AFIO_PCF0_USART1_REMAP_Msk        (0x8UL)                   /*!< USART1_REMAP (Bitfield-Mask: 0x01)                    */
#define AFIO_PCF0_USART0_REMAP_Pos        (2UL)                     /*!< USART0_REMAP (Bit 2)                                  */
#define AFIO_PCF0_USART0_REMAP_Msk        (0x4UL)                   /*!< USART0_REMAP (Bitfield-Mask: 0x01)                    */
#define AFIO_PCF0_I2C0_REMAP_Pos          (1UL)                     /*!< I2C0_REMAP (Bit 1)                                    */
#define AFIO_PCF0_I2C0_REMAP_Msk          (0x2UL)                   /*!< I2C0_REMAP (Bitfield-Mask: 0x01)                      */
#define AFIO_PCF0_SPI0_REMAP_Pos          (0UL)                     /*!< SPI0_REMAP (Bit 0)                                    */
#define AFIO_PCF0_SPI0_REMAP_Msk          (0x1UL)                   /*!< SPI0_REMAP (Bitfield-Mask: 0x01)                      */
/* ========================================================  EXTISS0  ======================================================== */
#define AFIO_EXTISS0_EXTI3_SS_Pos         (12UL)                    /*!< EXTI3_SS (Bit 12)                                     */
#define AFIO_EXTISS0_EXTI3_SS_Msk         (0xf000UL)                /*!< EXTI3_SS (Bitfield-Mask: 0x0f)                        */
#define AFIO_EXTISS0_EXTI2_SS_Pos         (8UL)                     /*!< EXTI2_SS (Bit 8)                                      */
#define AFIO_EXTISS0_EXTI2_SS_Msk         (0xf00UL)                 /*!< EXTI2_SS (Bitfield-Mask: 0x0f)                        */
#define AFIO_EXTISS0_EXTI1_SS_Pos         (4UL)                     /*!< EXTI1_SS (Bit 4)                                      */
#define AFIO_EXTISS0_EXTI1_SS_Msk         (0xf0UL)                  /*!< EXTI1_SS (Bitfield-Mask: 0x0f)                        */
#define AFIO_EXTISS0_EXTI0_SS_Pos         (0UL)                     /*!< EXTI0_SS (Bit 0)                                      */
#define AFIO_EXTISS0_EXTI0_SS_Msk         (0xfUL)                   /*!< EXTI0_SS (Bitfield-Mask: 0x0f)                        */
/* ========================================================  EXTISS1  ======================================================== */
#define AFIO_EXTISS1_EXTI7_SS_Pos         (12UL)                    /*!< EXTI7_SS (Bit 12)                                     */
#define AFIO_EXTISS1_EXTI7_SS_Msk         (0xf000UL)                /*!< EXTI7_SS (Bitfield-Mask: 0x0f)                        */
#define AFIO_EXTISS1_EXTI6_SS_Pos         (8UL)                     /*!< EXTI6_SS (Bit 8)                                      */
#define AFIO_EXTISS1_EXTI6_SS_Msk         (0xf00UL)                 /*!< EXTI6_SS (Bitfield-Mask: 0x0f)                        */
#define AFIO_EXTISS1_EXTI5_SS_Pos         (4UL)                     /*!< EXTI5_SS (Bit 4)                                      */
#define AFIO_EXTISS1_EXTI5_SS_Msk         (0xf0UL)                  /*!< EXTI5_SS (Bitfield-Mask: 0x0f)                        */
#define AFIO_EXTISS1_EXTI4_SS_Pos         (0UL)                     /*!< EXTI4_SS (Bit 0)                                      */
#define AFIO_EXTISS1_EXTI4_SS_Msk         (0xfUL)                   /*!< EXTI4_SS (Bitfield-Mask: 0x0f)                        */
/* ========================================================  EXTISS2  ======================================================== */
#define AFIO_EXTISS2_EXTI11_SS_Pos        (12UL)                    /*!< EXTI11_SS (Bit 12)                                    */
#define AFIO_EXTISS2_EXTI11_SS_Msk        (0xf000UL)                /*!< EXTI11_SS (Bitfield-Mask: 0x0f)                       */
#define AFIO_EXTISS2_EXTI10_SS_Pos        (8UL)                     /*!< EXTI10_SS (Bit 8)                                     */
#define AFIO_EXTISS2_EXTI10_SS_Msk        (0xf00UL)                 /*!< EXTI10_SS (Bitfield-Mask: 0x0f)                       */
#define AFIO_EXTISS2_EXTI9_SS_Pos         (4UL)                     /*!< EXTI9_SS (Bit 4)                                      */
#define AFIO_EXTISS2_EXTI9_SS_Msk         (0xf0UL)                  /*!< EXTI9_SS (Bitfield-Mask: 0x0f)                        */
#define AFIO_EXTISS2_EXTI8_SS_Pos         (0UL)                     /*!< EXTI8_SS (Bit 0)                                      */
#define AFIO_EXTISS2_EXTI8_SS_Msk         (0xfUL)                   /*!< EXTI8_SS (Bitfield-Mask: 0x0f)                        */
/* ========================================================  EXTISS3  ======================================================== */
#define AFIO_EXTISS3_EXTI15_SS_Pos        (12UL)                    /*!< EXTI15_SS (Bit 12)                                    */
#define AFIO_EXTISS3_EXTI15_SS_Msk        (0xf000UL)                /*!< EXTI15_SS (Bitfield-Mask: 0x0f)                       */
#define AFIO_EXTISS3_EXTI14_SS_Pos        (8UL)                     /*!< EXTI14_SS (Bit 8)                                     */
#define AFIO_EXTISS3_EXTI14_SS_Msk        (0xf00UL)                 /*!< EXTI14_SS (Bitfield-Mask: 0x0f)                       */
#define AFIO_EXTISS3_EXTI13_SS_Pos        (4UL)                     /*!< EXTI13_SS (Bit 4)                                     */
#define AFIO_EXTISS3_EXTI13_SS_Msk        (0xf0UL)                  /*!< EXTI13_SS (Bitfield-Mask: 0x0f)                       */
#define AFIO_EXTISS3_EXTI12_SS_Pos        (0UL)                     /*!< EXTI12_SS (Bit 0)                                     */
#define AFIO_EXTISS3_EXTI12_SS_Msk        (0xfUL)                   /*!< EXTI12_SS (Bitfield-Mask: 0x0f)                       */
/* =========================================================  PCF1  ========================================================== */
#define AFIO_PCF1_EXMC_NADV_Pos           (10UL)                    /*!< EXMC_NADV (Bit 10)                                    */
#define AFIO_PCF1_EXMC_NADV_Msk           (0x400UL)                 /*!< EXMC_NADV (Bitfield-Mask: 0x01)                       */


/* =========================================================================================================================== */
/* ================                                            BKP                                            ================ */
/* =========================================================================================================================== */

