RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* =========================================================  DATA0  ========================================================= */
#define BKP_DATA0_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA0_DATA_Msk                (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* =========================================================  DATA1  ========================================================= */
#define BKP_DATA1_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA1_DATA_Msk                (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* =========================================================  DATA2  ========================================================= */
#define BKP_DATA2_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA2_DATA_Msk                (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* =========================================================  DATA3  ========================================================= */
#define BKP_DATA3_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA3_DATA_Msk                (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* =========================================================  DATA4  ========================================================= */
#define BKP_DATA4_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA4_DATA_Msk                (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* =========================================================  DATA5  ========================================================= */
#define BKP_DATA5_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA5_DATA_Msk                (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* =========================================================  DATA6  ========================================================= */
#define BKP_DATA6_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA6_DATA_Msk                (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* =========================================================  DATA7  ========================================================= */
#define BKP_DATA7_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA7_DATA_Msk                (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* =========================================================  DATA8  ========================================================= */
#define BKP_DATA8_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA8_DATA_Msk                (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* =========================================================  DATA9  ========================================================= */
#define BKP_DATA9_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA9_DATA_Msk                (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA10  ========================================================= */
#define BKP_DATA10_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA10_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA11  ========================================================= */
#define BKP_DATA11_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA11_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA12  ========================================================= */
#define BKP_DATA12_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA12_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA13  ========================================================= */
#define BKP_DATA13_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA13_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA14  ========================================================= */
#define BKP_DATA14_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA14_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA15  ========================================================= */
#define BKP_DATA15_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA15_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA16  ========================================================= */
#define BKP_DATA16_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA16_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA17  ========================================================= */
#define BKP_DATA17_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA17_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA18  ========================================================= */
#define BKP_DATA18_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA18_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA19  ========================================================= */
#define BKP_DATA19_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA19_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA20  ========================================================= */
#define BKP_DATA20_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA20_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA21  ========================================================= */
#define BKP_DATA21_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA21_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA22  ========================================================= */
#define BKP_DATA22_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA22_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA23  ========================================================= */
#define BKP_DATA23_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA23_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA24  ========================================================= */
#define BKP_DATA24_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA24_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA25  ========================================================= */
#define BKP_DATA25_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA25_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA26  ========================================================= */
#define BKP_DATA26_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA26_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA27  ========================================================= */
#define BKP_DATA27_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA27_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA28  ========================================================= */
#define BKP_DATA28_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA28_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA29  ========================================================= */
#define BKP_DATA29_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA29_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA30  ========================================================= */
#define BKP_DATA30_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA30_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA31  ========================================================= */
#define BKP_DATA31_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA31_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA32  ========================================================= */
#define BKP_DATA32_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA32_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA33  ========================================================= */
#define BKP_DATA33_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA33_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA34  ========================================================= */
#define BKP_DATA34_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA34_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA35  ========================================================= */
#define BKP_DATA35_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA35_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA36  ========================================================= */
#define BKP_DATA36_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA36_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA37  ========================================================= */
#define BKP_DATA37_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA37_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA38  ========================================================= */
#define BKP_DATA38_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA38_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA39  ========================================================= */
#define BKP_DATA39_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA39_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA40  ========================================================= */
#define BKP_DATA40_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA40_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  DATA41  ========================================================= */
#define BKP_DATA41_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define BKP_DATA41_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* =========================================================  OCTL  ========================================================== */
#define BKP_OCTL_ROSEL_Pos                (9UL)                     /*!< ROSEL (Bit 9)                                         */
#define BKP_OCTL_ROSEL_Msk                (0x200UL)                 /*!< ROSEL (Bitfield-Mask: 0x01)                           */
#define BKP_OCTL_ASOEN_Pos                (8UL)                     /*!< ASOEN (Bit 8)                                         */
#define BKP_OCTL_ASOEN_Msk                (0x100UL)                 /*!< ASOEN (Bitfield-Mask: 0x01)                           */
#define BKP_OCTL_COEN_Pos                 (7UL)                     /*!< COEN (Bit 7)                                          */
#define BKP_OCTL_COEN_Msk                 (0x80UL)                  /*!< COEN (Bitfield-Mask: 0x01)                            */
#define BKP_OCTL_RCCV_Pos                 (0UL)                     /*!< RCCV (Bit 0)                                          */
#define BKP_OCTL_RCCV_Msk                 (0x7fUL)                  /*!< RCCV (Bitfield-Mask: 0x7f)                            */
/* =========================================================  TPCTL  ========================================================= */
#define BKP_TPCTL_TPAL_Pos                (1UL)                     /*!< TPAL (Bit 1)                                          */
#define BKP_TPCTL_TPAL_Msk                (0x2UL)                   /*!< TPAL (Bitfield-Mask: 0x01)                            */
#define BKP_TPCTL_TPEN_Pos                (0UL)                     /*!< TPEN (Bit 0)                                          */
#define BKP_TPCTL_TPEN_Msk                (0x1UL)                   /*!< TPEN (Bitfield-Mask: 0x01)                            */
/* =========================================================  TPCS  ========================================================== */
#define BKP_TPCS_TIF_Pos                  (9UL)                     /*!< TIF (Bit 9)                                           */
#define BKP_TPCS_TIF_Msk                  (0x200UL)                 /*!< TIF (Bitfield-Mask: 0x01)                             */
#define BKP_TPCS_TEF_Pos                  (8UL)                     /*!< TEF (Bit 8)                                           */
#define BKP_TPCS_TEF_Msk                  (0x100UL)                 /*!< TEF (Bitfield-Mask: 0x01)                             */
#define BKP_TPCS_TPIE_Pos                 (2UL)                     /*!< TPIE (Bit 2)                                          */
#define BKP_TPCS_TPIE_Msk                 (0x4UL)                   /*!< TPIE (Bitfield-Mask: 0x01)                            */
#define BKP_TPCS_TIR_Pos                  (1UL)                     /*!< TIR (Bit 1)                                           */
#define BKP_TPCS_TIR_Msk                  (0x2UL)                   /*!< TIR (Bitfield-Mask: 0x01)                             */
#define BKP_TPCS_TER_Pos                  (0UL)                     /*!< TER (Bit 0)                                           */
#define BKP_TPCS_TER_Msk                  (0x1UL)                   /*!< TER (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                           CAN0                                            ================ */
/* =========================================================================================================================== */

