RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* ==========================================================  CTL  ========================================================== */
#define CAN0_CTL_DFZ_Pos                  (16UL)                    /*!< DFZ (Bit 16)                                          */
#define CAN0_CTL_DFZ_Msk                  (0x10000UL)               /*!< DFZ (Bitfield-Mask: 0x01)                             */
#define CAN0_CTL_SWRST_Pos                (15UL)                    /*!< SWRST (Bit 15)                                        */
#define CAN0_CTL_SWRST_Msk                (0x8000UL)                /*!< SWRST (Bitfield-Mask: 0x01)                           */
#define CAN0_CTL_TTC_Pos                  (7UL)                     /*!< TTC (Bit 7)                                           */
#define CAN0_CTL_TTC_Msk                  (0x80UL)                  /*!< TTC (Bitfield-Mask: 0x01)                             */
#define CAN0_CTL_ABOR_Pos                 (6UL)                     /*!< ABOR (Bit 6)                                          */
#define CAN0_CTL_ABOR_Msk                 (0x40UL)                  /*!< ABOR (Bitfield-Mask: 0x01)                            */
#define CAN0_CTL_AWU_Pos                  (5UL)                     /*!< AWU (Bit 5)                                           */
#define CAN0_CTL_AWU_Msk                  (0x20UL)                  /*!< AWU (Bitfield-Mask: 0x01)                             */
#define CAN0_CTL_ARD_Pos                  (4UL)                     /*!< ARD (Bit 4)                                           */
#define CAN0_CTL_ARD_Msk                  (0x10UL)                  /*!< ARD (Bitfield-Mask: 0x01)                             */
#define CAN0_CTL_RFOD_Pos                 (3UL)                     /*!< RFOD (Bit 3)                                          */
#define CAN0_CTL_RFOD_Msk                 (0x8UL)                   /*!< RFOD (Bitfield-Mask: 0x01)                            */
#define CAN0_CTL_TFO_Pos                  (2UL)                     /*!< TFO (Bit 2)                                           */
#define CAN0_CTL_TFO_Msk                  (0x4UL)                   /*!< TFO (Bitfield-Mask: 0x01)                             */
#define CAN0_CTL_SLPWMOD_Pos              (1UL)                     /*!< SLPWMOD (Bit 1)                                       */
#define CAN0_CTL_SLPWMOD_Msk              (0x2UL)                   /*!< SLPWMOD (Bitfield-Mask: 0x01)                         */
#define CAN0_CTL_IWMOD_Pos                (0UL)                     /*!< IWMOD (Bit 0)                                         */
#define CAN0_CTL_IWMOD_Msk                (0x1UL)                   /*!< IWMOD (Bitfield-Mask: 0x01)                           */
/* =========================================================  STAT  ========================================================== */
#define CAN0_STAT_RXL_Pos                 (11UL)                    /*!< RXL (Bit 11)                                          */
#define CAN0_STAT_RXL_Msk                 (0x800UL)                 /*!< RXL (Bitfield-Mask: 0x01)                             */
#define CAN0_STAT_LASTRX_Pos              (10UL)                    /*!< LASTRX (Bit 10)                                       */
#define CAN0_STAT_LASTRX_Msk              (0x400UL)                 /*!< LASTRX (Bitfield-Mask: 0x01)                          */
#define CAN0_STAT_RS_Pos                  (9UL)                     /*!< RS (Bit 9)                                            */
#define CAN0_STAT_RS_Msk                  (0x200UL)                 /*!< RS (Bitfield-Mask: 0x01)                              */
#define CAN0_STAT_TS_Pos                  (8UL)                     /*!< TS (Bit 8)                                            */
#define CAN0_STAT_TS_Msk                  (0x100UL)                 /*!< TS (Bitfield-Mask: 0x01)                              */
#define CAN0_STAT_SLPIF_Pos               (4UL)                     /*!< SLPIF (Bit 4)                                         */
#define CAN0_STAT_SLPIF_Msk               (0x10UL)                  /*!< SLPIF (Bitfield-Mask: 0x01)                           */
#define CAN0_STAT_WUIF_Pos                (3UL)                     /*!< WUIF (Bit 3)                                          */
#define CAN0_STAT_WUIF_Msk                (0x8UL)                   /*!< WUIF (Bitfield-Mask: 0x01)                            */
#define CAN0_STAT_ERRIF_Pos               (2UL)                     /*!< ERRIF (Bit 2)                                         */
#define CAN0_STAT_ERRIF_Msk               (0x4UL)                   /*!< ERRIF (Bitfield-Mask: 0x01)                           */
#define CAN0_STAT_SLPWS_Pos               (1UL)                     /*!< SLPWS (Bit 1)                                         */
#define CAN0_STAT_SLPWS_Msk               (0x2UL)                   /*!< SLPWS (Bitfield-Mask: 0x01)                           */
#define CAN0_STAT_IWS_Pos                 (0UL)                     /*!< IWS (Bit 0)                                           */
#define CAN0_STAT_IWS_Msk                 (0x1UL)                   /*!< IWS (Bitfield-Mask: 0x01)                             */
/* =========================================================  TSTAT  ========================================================= */
#define CAN0_TSTAT_TMLS2_Pos              (31UL)                    /*!< TMLS2 (Bit 31)                                        */
#define CAN0_TSTAT_TMLS2_Msk              (0x80000000UL)            /*!< TMLS2 (Bitfield-Mask: 0x01)                           */
#define CAN0_TSTAT_TMLS1_Pos              (30UL)                    /*!< TMLS1 (Bit 30)                                        */
#define CAN0_TSTAT_TMLS1_Msk              (0x40000000UL)            /*!< TMLS1 (Bitfield-Mask: 0x01)                           */
#define CAN0_TSTAT_TMLS0_Pos              (29UL)                    /*!< TMLS0 (Bit 29)                                        */
#define CAN0_TSTAT_TMLS0_Msk              (0x20000000UL)            /*!< TMLS0 (Bitfield-Mask: 0x01)                           */
#define CAN0_TSTAT_TME2_Pos               (28UL)                    /*!< TME2 (Bit 28)                                         */
#define CAN0_TSTAT_TME2_Msk               (0x10000000UL)            /*!< TME2 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_TME1_Pos               (27UL)                    /*!< TME1 (Bit 27)                                         */
#define CAN0_TSTAT_TME1_Msk               (0x8000000UL)             /*!< TME1 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_TME0_Pos               (26UL)                    /*!< TME0 (Bit 26)                                         */
#define CAN0_TSTAT_TME0_Msk               (0x4000000UL)             /*!< TME0 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_NUM_Pos                (24UL)                    /*!< NUM (Bit 24)                                          */
#define CAN0_TSTAT_NUM_Msk                (0x3000000UL)             /*!< NUM (Bitfield-Mask: 0x03)                             */
#define CAN0_TSTAT_MST2_Pos               (23UL)                    /*!< MST2 (Bit 23)                                         */
#define CAN0_TSTAT_MST2_Msk               (0x800000UL)              /*!< MST2 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_MTE2_Pos               (19UL)                    /*!< MTE2 (Bit 19)                                         */
#define CAN0_TSTAT_MTE2_Msk               (0x80000UL)               /*!< MTE2 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_MAL2_Pos               (18UL)                    /*!< MAL2 (Bit 18)                                         */
#define CAN0_TSTAT_MAL2_Msk               (0x40000UL)               /*!< MAL2 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_MTFNERR2_Pos           (17UL)                    /*!< MTFNERR2 (Bit 17)                                     */
#define CAN0_TSTAT_MTFNERR2_Msk           (0x20000UL)               /*!< MTFNERR2 (Bitfield-Mask: 0x01)                        */
#define CAN0_TSTAT_MTF2_Pos               (16UL)                    /*!< MTF2 (Bit 16)                                         */
#define CAN0_TSTAT_MTF2_Msk               (0x10000UL)               /*!< MTF2 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_MST1_Pos               (15UL)                    /*!< MST1 (Bit 15)                                         */
#define CAN0_TSTAT_MST1_Msk               (0x8000UL)                /*!< MST1 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_MTE1_Pos               (11UL)                    /*!< MTE1 (Bit 11)                                         */
#define CAN0_TSTAT_MTE1_Msk               (0x800UL)                 /*!< MTE1 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_MAL1_Pos               (10UL)                    /*!< MAL1 (Bit 10)                                         */
#define CAN0_TSTAT_MAL1_Msk               (0x400UL)                 /*!< MAL1 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_MTFNERR1_Pos           (9UL)                     /*!< MTFNERR1 (Bit 9)                                      */
#define CAN0_TSTAT_MTFNERR1_Msk           (0x200UL)                 /*!< MTFNERR1 (Bitfield-Mask: 0x01)                        */
#define CAN0_TSTAT_MTF1_Pos               (8UL)                     /*!< MTF1 (Bit 8)                                          */
#define CAN0_TSTAT_MTF1_Msk               (0x100UL)                 /*!< MTF1 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_MST0_Pos               (7UL)                     /*!< MST0 (Bit 7)                                          */
#define CAN0_TSTAT_MST0_Msk               (0x80UL)                  /*!< MST0 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_MTE0_Pos               (3UL)                     /*!< MTE0 (Bit 3)                                          */
#define CAN0_TSTAT_MTE0_Msk               (0x8UL)                   /*!< MTE0 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_MAL0_Pos               (2UL)                     /*!< MAL0 (Bit 2)                                          */
#define CAN0_TSTAT_MAL0_Msk               (0x4UL)                   /*!< MAL0 (Bitfield-Mask: 0x01)                            */
#define CAN0_TSTAT_MTFNERR0_Pos           (1UL)                     /*!< MTFNERR0 (Bit 1)                                      */
#define CAN0_TSTAT_MTFNERR0_Msk           (0x2UL)                   /*!< MTFNERR0 (Bitfield-Mask: 0x01)                        */
#define CAN0_TSTAT_MTF0_Pos               (0UL)                     /*!< MTF0 (Bit 0)                                          */
#define CAN0_TSTAT_MTF0_Msk               (0x1UL)                   /*!< MTF0 (Bitfield-Mask: 0x01)                            */
/* ========================================================  RFIFO0  ========================================================= */
#define CAN0_RFIFO0_RFD0_Pos              (5UL)                     /*!< RFD0 (Bit 5)                                          */
#define CAN0_RFIFO0_RFD0_Msk              (0x20UL)                  /*!< RFD0 (Bitfield-Mask: 0x01)                            */
#define CAN0_RFIFO0_RFO0_Pos              (4UL)                     /*!< RFO0 (Bit 4)                                          */
#define CAN0_RFIFO0_RFO0_Msk              (0x10UL)                  /*!< RFO0 (Bitfield-Mask: 0x01)                            */
#define CAN0_RFIFO0_RFF0_Pos              (3UL)                     /*!< RFF0 (Bit 3)                                          */
#define CAN0_RFIFO0_RFF0_Msk              (0x8UL)                   /*!< RFF0 (Bitfield-Mask: 0x01)                            */
#define CAN0_RFIFO0_RFL0_Pos              (0UL)                     /*!< RFL0 (Bit 0)                                          */
#define CAN0_RFIFO0_RFL0_Msk              (0x3UL)                   /*!< RFL0 (Bitfield-Mask: 0x03)                            */
/* ========================================================  RFIFO1  ========================================================= */
#define CAN0_RFIFO1_RFD1_Pos              (5UL)                     /*!< RFD1 (Bit 5)                                          */
#define CAN0_RFIFO1_RFD1_Msk              (0x20UL)                  /*!< RFD1 (Bitfield-Mask: 0x01)                            */
#define CAN0_RFIFO1_RFO1_Pos              (4UL)                     /*!< RFO1 (Bit 4)                                          */
#define CAN0_RFIFO1_RFO1_Msk              (0x10UL)                  /*!< RFO1 (Bitfield-Mask: 0x01)                            */
#define CAN0_RFIFO1_RFF1_Pos              (3UL)                     /*!< RFF1 (Bit 3)                                          */
#define CAN0_RFIFO1_RFF1_Msk              (0x8UL)                   /*!< RFF1 (Bitfield-Mask: 0x01)                            */
#define CAN0_RFIFO1_RFL1_Pos              (0UL)                     /*!< RFL1 (Bit 0)                                          */
#define CAN0_RFIFO1_RFL1_Msk              (0x3UL)                   /*!< RFL1 (Bitfield-Mask: 0x03)                            */
/* =========================================================  INTEN  ========================================================= */
#define CAN0_INTEN_SLPWIE_Pos             (17UL)                    /*!< SLPWIE (Bit 17)                                       */
#define CAN0_INTEN_SLPWIE_Msk             (0x20000UL)               /*!< SLPWIE (Bitfield-Mask: 0x01)                          */
#define CAN0_INTEN_WIE_Pos                (16UL)                    /*!< WIE (Bit 16)                                          */
#define CAN0_INTEN_WIE_Msk                (0x10000UL)               /*!< WIE (Bitfield-Mask: 0x01)                             */
#define CAN0_INTEN_ERRIE_Pos              (15UL)                    /*!< ERRIE (Bit 15)                                        */
#define CAN0_INTEN_ERRIE_Msk              (0x8000UL)                /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define CAN0_INTEN_ERRNIE_Pos             (11UL)                    /*!< ERRNIE (Bit 11)                                       */
#define CAN0_INTEN_ERRNIE_Msk             (0x800UL)                 /*!< ERRNIE (Bitfield-Mask: 0x01)                          */
#define CAN0_INTEN_BOIE_Pos               (10UL)                    /*!< BOIE (Bit 10)                                         */
#define CAN0_INTEN_BOIE_Msk               (0x400UL)                 /*!< BOIE (Bitfield-Mask: 0x01)                            */
#define CAN0_INTEN_PERRIE_Pos             (9UL)                     /*!< PERRIE (Bit 9)                                        */
#define CAN0_INTEN_PERRIE_Msk             (0x200UL)                 /*!< PERRIE (Bitfield-Mask: 0x01)                          */
#define CAN0_INTEN_WERRIE_Pos             (8UL)                     /*!< WERRIE (Bit 8)                                        */
#define CAN0_INTEN_WERRIE_Msk             (0x100UL)                 /*!< WERRIE (Bitfield-Mask: 0x01)                          */
#define CAN0_INTEN_RFOIE1_Pos             (6UL)                     /*!< RFOIE1 (Bit 6)                                        */
#define CAN0_INTEN_RFOIE1_Msk             (0x40UL)                  /*!< RFOIE1 (Bitfield-Mask: 0x01)                          */
#define CAN0_INTEN_RFFIE1_Pos             (5UL)                     /*!< RFFIE1 (Bit 5)                                        */
#define CAN0_INTEN_RFFIE1_Msk             (0x20UL)                  /*!< RFFIE1 (Bitfield-Mask: 0x01)                          */
#define CAN0_INTEN_RFNEIE1_Pos            (4UL)                     /*!< RFNEIE1 (Bit 4)                                       */
#define CAN0_INTEN_RFNEIE1_Msk            (0x10UL)                  /*!< RFNEIE1 (Bitfield-Mask: 0x01)                         */
#define CAN0_INTEN_RFOIE0_Pos             (3UL)                     /*!< RFOIE0 (Bit 3)                                        */
#define CAN0_INTEN_RFOIE0_Msk             (0x8UL)                   /*!< RFOIE0 (Bitfield-Mask: 0x01)                          */
#define CAN0_INTEN_RFFIE0_Pos             (2UL)                     /*!< RFFIE0 (Bit 2)                                        */
#define CAN0_INTEN_RFFIE0_Msk             (0x4UL)                   /*!< RFFIE0 (Bitfield-Mask: 0x01)                          */
#define CAN0_INTEN_RFNEIE0_Pos            (1UL)                     /*!< RFNEIE0 (Bit 1)                                       */
#define CAN0_INTEN_RFNEIE0_Msk            (0x2UL)                   /*!< RFNEIE0 (Bitfield-Mask: 0x01)                         */
#define CAN0_INTEN_TMEIE_Pos              (0UL)                     /*!< TMEIE (Bit 0)                                         */
#define CAN0_INTEN_TMEIE_Msk              (0x1UL)                   /*!< TMEIE (Bitfield-Mask: 0x01)                           */
/* ==========================================================  ERR  ========================================================== */
#define CAN0_ERR_RECNT_Pos                (24UL)                    /*!< RECNT (Bit 24)                                        */
#define CAN0_ERR_RECNT_Msk                (0xff000000UL)            /*!< RECNT (Bitfield-Mask: 0xff)                           */
#define CAN0_ERR_TECNT_Pos                (16UL)                    /*!< TECNT (Bit 16)                                        */
#define CAN0_ERR_TECNT_Msk                (0xff0000UL)              /*!< TECNT (Bitfield-Mask: 0xff)                           */
#define CAN0_ERR_ERRN_Pos                 (4UL)                     /*!< ERRN (Bit 4)                                          */
#define CAN0_ERR_ERRN_Msk                 (0x70UL)                  /*!< ERRN (Bitfield-Mask: 0x07)                            */
#define CAN0_ERR_BOERR_Pos                (2UL)                     /*!< BOERR (Bit 2)                                         */
#define CAN0_ERR_BOERR_Msk                (0x4UL)                   /*!< BOERR (Bitfield-Mask: 0x01)                           */
#define CAN0_ERR_PERR_Pos                 (1UL)                     /*!< PERR (Bit 1)                                          */
#define CAN0_ERR_PERR_Msk                 (0x2UL)                   /*!< PERR (Bitfield-Mask: 0x01)                            */
#define CAN0_ERR_WERR_Pos                 (0UL)                     /*!< WERR (Bit 0)                                          */
#define CAN0_ERR_WERR_Msk                 (0x1UL)                   /*!< WERR (Bitfield-Mask: 0x01)                            */
/* ==========================================================  BT  =========================================================== */
#define CAN0_BT_SCMOD_Pos                 (31UL)                    /*!< SCMOD (Bit 31)                                        */
#define CAN0_BT_SCMOD_Msk                 (0x80000000UL)            /*!< SCMOD (Bitfield-Mask: 0x01)                           */
#define CAN0_BT_LCMOD_Pos                 (30UL)                    /*!< LCMOD (Bit 30)                                        */
#define CAN0_BT_LCMOD_Msk                 (0x40000000UL)            /*!< LCMOD (Bitfield-Mask: 0x01)                           */
#define CAN0_BT_SJW_Pos                   (24UL)                    /*!< SJW (Bit 24)                                          */
#define CAN0_BT_SJW_Msk                   (0x3000000UL)             /*!< SJW (Bitfield-Mask: 0x03)                             */
#define CAN0_BT_BS2_Pos                   (20UL)                    /*!< BS2 (Bit 20)                                          */
#define CAN0_BT_BS2_Msk                   (0x700000UL)              /*!< BS2 (Bitfield-Mask: 0x07)                             */
#define CAN0_BT_BS1_Pos                   (16UL)                    /*!< BS1 (Bit 16)                                          */
#define CAN0_BT_BS1_Msk                   (0xf0000UL)               /*!< BS1 (Bitfield-Mask: 0x0f)                             */
#define CAN0_BT_BAUDPSC_Pos               (0UL)                     /*!< BAUDPSC (Bit 0)                                       */
#define CAN0_BT_BAUDPSC_Msk               (0x3ffUL)                 /*!< BAUDPSC (Bitfield-Mask: 0x3ff)                        */
/* =========================================================  TMI0  ========================================================== */
#define CAN0_TMI0_SFID_EFID_Pos           (21UL)                    /*!< SFID_EFID (Bit 21)                                    */
#define CAN0_TMI0_SFID_EFID_Msk           (0xffe00000UL)            /*!< SFID_EFID (Bitfield-Mask: 0x7ff)                      */
#define CAN0_TMI0_EFID_Pos                (3UL)                     /*!< EFID (Bit 3)                                          */
#define CAN0_TMI0_EFID_Msk                (0x1ffff8UL)              /*!< EFID (Bitfield-Mask: 0x3ffff)                         */
#define CAN0_TMI0_FF_Pos                  (2UL)                     /*!< FF (Bit 2)                                            */
#define CAN0_TMI0_FF_Msk                  (0x4UL)                   /*!< FF (Bitfield-Mask: 0x01)                              */
#define CAN0_TMI0_FT_Pos                  (1UL)                     /*!< FT (Bit 1)                                            */
#define CAN0_TMI0_FT_Msk                  (0x2UL)                   /*!< FT (Bitfield-Mask: 0x01)                              */
#define CAN0_TMI0_TEN_Pos                 (0UL)                     /*!< TEN (Bit 0)                                           */
#define CAN0_TMI0_TEN_Msk                 (0x1UL)                   /*!< TEN (Bitfield-Mask: 0x01)                             */
/* =========================================================  TMP0  ========================================================== */
#define CAN0_TMP0_TS_Pos                  (16UL)                    /*!< TS (Bit 16)                                           */
#define CAN0_TMP0_TS_Msk                  (0xffff0000UL)            /*!< TS (Bitfield-Mask: 0xffff)                            */
#define CAN0_TMP0_TSEN_Pos                (8UL)                     /*!< TSEN (Bit 8)                                          */
#define CAN0_TMP0_TSEN_Msk                (0x100UL)                 /*!< TSEN (Bitfield-Mask: 0x01)                            */
#define CAN0_TMP0_DLENC_Pos               (0UL)                     /*!< DLENC (Bit 0)                                         */
#define CAN0_TMP0_DLENC_Msk               (0xfUL)                   /*!< DLENC (Bitfield-Mask: 0x0f)                           */
/* =======================================================  TMDATA00  ======================================================== */
#define CAN0_TMDATA00_DB3_Pos             (24UL)                    /*!< DB3 (Bit 24)                                          */
#define CAN0_TMDATA00_DB3_Msk             (0xff000000UL)            /*!< DB3 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA00_DB2_Pos             (16UL)                    /*!< DB2 (Bit 16)                                          */
#define CAN0_TMDATA00_DB2_Msk             (0xff0000UL)              /*!< DB2 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA00_DB1_Pos             (8UL)                     /*!< DB1 (Bit 8)                                           */
#define CAN0_TMDATA00_DB1_Msk             (0xff00UL)                /*!< DB1 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA00_DB0_Pos             (0UL)                     /*!< DB0 (Bit 0)                                           */
