RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define CAN0_TMDATA00_DB0_Msk             (0xffUL)                  /*!< DB0 (Bitfield-Mask: 0xff)                             */
/* =======================================================  TMDATA10  ======================================================== */
#define CAN0_TMDATA10_DB7_Pos             (24UL)                    /*!< DB7 (Bit 24)                                          */
#define CAN0_TMDATA10_DB7_Msk             (0xff000000UL)            /*!< DB7 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA10_DB6_Pos             (16UL)                    /*!< DB6 (Bit 16)                                          */
#define CAN0_TMDATA10_DB6_Msk             (0xff0000UL)              /*!< DB6 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA10_DB5_Pos             (8UL)                     /*!< DB5 (Bit 8)                                           */
#define CAN0_TMDATA10_DB5_Msk             (0xff00UL)                /*!< DB5 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA10_DB4_Pos             (0UL)                     /*!< DB4 (Bit 0)                                           */
#define CAN0_TMDATA10_DB4_Msk             (0xffUL)                  /*!< DB4 (Bitfield-Mask: 0xff)                             */
/* =========================================================  TMI1  ========================================================== */
#define CAN0_TMI1_SFID_EFID_Pos           (21UL)                    /*!< SFID_EFID (Bit 21)                                    */
#define CAN0_TMI1_SFID_EFID_Msk           (0xffe00000UL)            /*!< SFID_EFID (Bitfield-Mask: 0x7ff)                      */
#define CAN0_TMI1_EFID_Pos                (3UL)                     /*!< EFID (Bit 3)                                          */
#define CAN0_TMI1_EFID_Msk                (0x1ffff8UL)              /*!< EFID (Bitfield-Mask: 0x3ffff)                         */
#define CAN0_TMI1_FF_Pos                  (2UL)                     /*!< FF (Bit 2)                                            */
#define CAN0_TMI1_FF_Msk                  (0x4UL)                   /*!< FF (Bitfield-Mask: 0x01)                              */
#define CAN0_TMI1_FT_Pos                  (1UL)                     /*!< FT (Bit 1)                                            */
#define CAN0_TMI1_FT_Msk                  (0x2UL)                   /*!< FT (Bitfield-Mask: 0x01)                              */
#define CAN0_TMI1_TEN_Pos                 (0UL)                     /*!< TEN (Bit 0)                                           */
#define CAN0_TMI1_TEN_Msk                 (0x1UL)                   /*!< TEN (Bitfield-Mask: 0x01)                             */
/* =========================================================  TMP1  ========================================================== */
#define CAN0_TMP1_TS_Pos                  (16UL)                    /*!< TS (Bit 16)                                           */
#define CAN0_TMP1_TS_Msk                  (0xffff0000UL)            /*!< TS (Bitfield-Mask: 0xffff)                            */
#define CAN0_TMP1_TSEN_Pos                (8UL)                     /*!< TSEN (Bit 8)                                          */
#define CAN0_TMP1_TSEN_Msk                (0x100UL)                 /*!< TSEN (Bitfield-Mask: 0x01)                            */
#define CAN0_TMP1_DLENC_Pos               (0UL)                     /*!< DLENC (Bit 0)                                         */
#define CAN0_TMP1_DLENC_Msk               (0xfUL)                   /*!< DLENC (Bitfield-Mask: 0x0f)                           */
/* =======================================================  TMDATA01  ======================================================== */
#define CAN0_TMDATA01_DB3_Pos             (24UL)                    /*!< DB3 (Bit 24)                                          */
#define CAN0_TMDATA01_DB3_Msk             (0xff000000UL)            /*!< DB3 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA01_DB2_Pos             (16UL)                    /*!< DB2 (Bit 16)                                          */
#define CAN0_TMDATA01_DB2_Msk             (0xff0000UL)              /*!< DB2 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA01_DB1_Pos             (8UL)                     /*!< DB1 (Bit 8)                                           */
#define CAN0_TMDATA01_DB1_Msk             (0xff00UL)                /*!< DB1 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA01_DB0_Pos             (0UL)                     /*!< DB0 (Bit 0)                                           */
#define CAN0_TMDATA01_DB0_Msk             (0xffUL)                  /*!< DB0 (Bitfield-Mask: 0xff)                             */
/* =======================================================  TMDATA11  ======================================================== */
#define CAN0_TMDATA11_DB7_Pos             (24UL)                    /*!< DB7 (Bit 24)                                          */
#define CAN0_TMDATA11_DB7_Msk             (0xff000000UL)            /*!< DB7 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA11_DB6_Pos             (16UL)                    /*!< DB6 (Bit 16)                                          */
#define CAN0_TMDATA11_DB6_Msk             (0xff0000UL)              /*!< DB6 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA11_DB5_Pos             (8UL)                     /*!< DB5 (Bit 8)                                           */
#define CAN0_TMDATA11_DB5_Msk             (0xff00UL)                /*!< DB5 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA11_DB4_Pos             (0UL)                     /*!< DB4 (Bit 0)                                           */
#define CAN0_TMDATA11_DB4_Msk             (0xffUL)                  /*!< DB4 (Bitfield-Mask: 0xff)                             */
/* =========================================================  TMI2  ========================================================== */
#define CAN0_TMI2_SFID_EFID_Pos           (21UL)                    /*!< SFID_EFID (Bit 21)                                    */
#define CAN0_TMI2_SFID_EFID_Msk           (0xffe00000UL)            /*!< SFID_EFID (Bitfield-Mask: 0x7ff)                      */
#define CAN0_TMI2_EFID_Pos                (3UL)                     /*!< EFID (Bit 3)                                          */
#define CAN0_TMI2_EFID_Msk                (0x1ffff8UL)              /*!< EFID (Bitfield-Mask: 0x3ffff)                         */
#define CAN0_TMI2_FF_Pos                  (2UL)                     /*!< FF (Bit 2)                                            */
#define CAN0_TMI2_FF_Msk                  (0x4UL)                   /*!< FF (Bitfield-Mask: 0x01)                              */
#define CAN0_TMI2_FT_Pos                  (1UL)                     /*!< FT (Bit 1)                                            */
#define CAN0_TMI2_FT_Msk                  (0x2UL)                   /*!< FT (Bitfield-Mask: 0x01)                              */
#define CAN0_TMI2_TEN_Pos                 (0UL)                     /*!< TEN (Bit 0)                                           */
#define CAN0_TMI2_TEN_Msk                 (0x1UL)                   /*!< TEN (Bitfield-Mask: 0x01)                             */
/* =========================================================  TMP2  ========================================================== */
#define CAN0_TMP2_TS_Pos                  (16UL)                    /*!< TS (Bit 16)                                           */
#define CAN0_TMP2_TS_Msk                  (0xffff0000UL)            /*!< TS (Bitfield-Mask: 0xffff)                            */
#define CAN0_TMP2_TSEN_Pos                (8UL)                     /*!< TSEN (Bit 8)                                          */
#define CAN0_TMP2_TSEN_Msk                (0x100UL)                 /*!< TSEN (Bitfield-Mask: 0x01)                            */
#define CAN0_TMP2_DLENC_Pos               (0UL)                     /*!< DLENC (Bit 0)                                         */
#define CAN0_TMP2_DLENC_Msk               (0xfUL)                   /*!< DLENC (Bitfield-Mask: 0x0f)                           */
/* =======================================================  TMDATA02  ======================================================== */
#define CAN0_TMDATA02_DB3_Pos             (24UL)                    /*!< DB3 (Bit 24)                                          */
#define CAN0_TMDATA02_DB3_Msk             (0xff000000UL)            /*!< DB3 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA02_DB2_Pos             (16UL)                    /*!< DB2 (Bit 16)                                          */
#define CAN0_TMDATA02_DB2_Msk             (0xff0000UL)              /*!< DB2 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA02_DB1_Pos             (8UL)                     /*!< DB1 (Bit 8)                                           */
#define CAN0_TMDATA02_DB1_Msk             (0xff00UL)                /*!< DB1 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA02_DB0_Pos             (0UL)                     /*!< DB0 (Bit 0)                                           */
#define CAN0_TMDATA02_DB0_Msk             (0xffUL)                  /*!< DB0 (Bitfield-Mask: 0xff)                             */
/* =======================================================  TMDATA12  ======================================================== */
#define CAN0_TMDATA12_DB7_Pos             (24UL)                    /*!< DB7 (Bit 24)                                          */
#define CAN0_TMDATA12_DB7_Msk             (0xff000000UL)            /*!< DB7 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA12_DB6_Pos             (16UL)                    /*!< DB6 (Bit 16)                                          */
#define CAN0_TMDATA12_DB6_Msk             (0xff0000UL)              /*!< DB6 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA12_DB5_Pos             (8UL)                     /*!< DB5 (Bit 8)                                           */
#define CAN0_TMDATA12_DB5_Msk             (0xff00UL)                /*!< DB5 (Bitfield-Mask: 0xff)                             */
#define CAN0_TMDATA12_DB4_Pos             (0UL)                     /*!< DB4 (Bit 0)                                           */
#define CAN0_TMDATA12_DB4_Msk             (0xffUL)                  /*!< DB4 (Bitfield-Mask: 0xff)                             */
/* =======================================================  RFIFOMI0  ======================================================== */
#define CAN0_RFIFOMI0_SFID_EFID_Pos       (21UL)                    /*!< SFID_EFID (Bit 21)                                    */
#define CAN0_RFIFOMI0_SFID_EFID_Msk       (0xffe00000UL)            /*!< SFID_EFID (Bitfield-Mask: 0x7ff)                      */
#define CAN0_RFIFOMI0_EFID_Pos            (3UL)                     /*!< EFID (Bit 3)                                          */
#define CAN0_RFIFOMI0_EFID_Msk            (0x1ffff8UL)              /*!< EFID (Bitfield-Mask: 0x3ffff)                         */
#define CAN0_RFIFOMI0_FF_Pos              (2UL)                     /*!< FF (Bit 2)                                            */
#define CAN0_RFIFOMI0_FF_Msk              (0x4UL)                   /*!< FF (Bitfield-Mask: 0x01)                              */
#define CAN0_RFIFOMI0_FT_Pos              (1UL)                     /*!< FT (Bit 1)                                            */
#define CAN0_RFIFOMI0_FT_Msk              (0x2UL)                   /*!< FT (Bitfield-Mask: 0x01)                              */
/* =======================================================  RFIFOMP0  ======================================================== */
#define CAN0_RFIFOMP0_TS_Pos              (16UL)                    /*!< TS (Bit 16)                                           */
#define CAN0_RFIFOMP0_TS_Msk              (0xffff0000UL)            /*!< TS (Bitfield-Mask: 0xffff)                            */
#define CAN0_RFIFOMP0_FI_Pos              (8UL)                     /*!< FI (Bit 8)                                            */
#define CAN0_RFIFOMP0_FI_Msk              (0xff00UL)                /*!< FI (Bitfield-Mask: 0xff)                              */
#define CAN0_RFIFOMP0_DLENC_Pos           (0UL)                     /*!< DLENC (Bit 0)                                         */
#define CAN0_RFIFOMP0_DLENC_Msk           (0xfUL)                   /*!< DLENC (Bitfield-Mask: 0x0f)                           */
/* =====================================================  RFIFOMDATA00  ====================================================== */
#define CAN0_RFIFOMDATA00_DB3_Pos         (24UL)                    /*!< DB3 (Bit 24)                                          */
#define CAN0_RFIFOMDATA00_DB3_Msk         (0xff000000UL)            /*!< DB3 (Bitfield-Mask: 0xff)                             */
#define CAN0_RFIFOMDATA00_DB2_Pos         (16UL)                    /*!< DB2 (Bit 16)                                          */
#define CAN0_RFIFOMDATA00_DB2_Msk         (0xff0000UL)              /*!< DB2 (Bitfield-Mask: 0xff)                             */
#define CAN0_RFIFOMDATA00_DB1_Pos         (8UL)                     /*!< DB1 (Bit 8)                                           */
#define CAN0_RFIFOMDATA00_DB1_Msk         (0xff00UL)                /*!< DB1 (Bitfield-Mask: 0xff)                             */
#define CAN0_RFIFOMDATA00_DB0_Pos         (0UL)                     /*!< DB0 (Bit 0)                                           */
#define CAN0_RFIFOMDATA00_DB0_Msk         (0xffUL)                  /*!< DB0 (Bitfield-Mask: 0xff)                             */
/* =====================================================  RFIFOMDATA10  ====================================================== */
#define CAN0_RFIFOMDATA10_DB7_Pos         (24UL)                    /*!< DB7 (Bit 24)                                          */
#define CAN0_RFIFOMDATA10_DB7_Msk         (0xff000000UL)            /*!< DB7 (Bitfield-Mask: 0xff)                             */
#define CAN0_RFIFOMDATA10_DB6_Pos         (16UL)                    /*!< DB6 (Bit 16)                                          */
#define CAN0_RFIFOMDATA10_DB6_Msk         (0xff0000UL)              /*!< DB6 (Bitfield-Mask: 0xff)                             */
#define CAN0_RFIFOMDATA10_DB5_Pos         (8UL)                     /*!< DB5 (Bit 8)                                           */
#define CAN0_RFIFOMDATA10_DB5_Msk         (0xff00UL)                /*!< DB5 (Bitfield-Mask: 0xff)                             */
#define CAN0_RFIFOMDATA10_DB4_Pos         (0UL)                     /*!< DB4 (Bit 0)                                           */
#define CAN0_RFIFOMDATA10_DB4_Msk         (0xffUL)                  /*!< DB4 (Bitfield-Mask: 0xff)                             */
/* =======================================================  RFIFOMI1  ======================================================== */
#define CAN0_RFIFOMI1_SFID_EFID_Pos       (21UL)                    /*!< SFID_EFID (Bit 21)                                    */
#define CAN0_RFIFOMI1_SFID_EFID_Msk       (0xffe00000UL)            /*!< SFID_EFID (Bitfield-Mask: 0x7ff)                      */
#define CAN0_RFIFOMI1_EFID_Pos            (3UL)                     /*!< EFID (Bit 3)                                          */
#define CAN0_RFIFOMI1_EFID_Msk            (0x1ffff8UL)              /*!< EFID (Bitfield-Mask: 0x3ffff)                         */
#define CAN0_RFIFOMI1_FF_Pos              (2UL)                     /*!< FF (Bit 2)                                            */
#define CAN0_RFIFOMI1_FF_Msk              (0x4UL)                   /*!< FF (Bitfield-Mask: 0x01)                              */
#define CAN0_RFIFOMI1_FT_Pos              (1UL)                     /*!< FT (Bit 1)                                            */
#define CAN0_RFIFOMI1_FT_Msk              (0x2UL)                   /*!< FT (Bitfield-Mask: 0x01)                              */
/* =======================================================  RFIFOMP1  ======================================================== */
#define CAN0_RFIFOMP1_TS_Pos              (16UL)                    /*!< TS (Bit 16)                                           */
#define CAN0_RFIFOMP1_TS_Msk              (0xffff0000UL)            /*!< TS (Bitfield-Mask: 0xffff)                            */
#define CAN0_RFIFOMP1_FI_Pos              (8UL)                     /*!< FI (Bit 8)                                            */
#define CAN0_RFIFOMP1_FI_Msk              (0xff00UL)                /*!< FI (Bitfield-Mask: 0xff)                              */
#define CAN0_RFIFOMP1_DLENC_Pos           (0UL)                     /*!< DLENC (Bit 0)                                         */
#define CAN0_RFIFOMP1_DLENC_Msk           (0xfUL)                   /*!< DLENC (Bitfield-Mask: 0x0f)                           */
/* =====================================================  RFIFOMDATA01  ====================================================== */
#define CAN0_RFIFOMDATA01_DB3_Pos         (24UL)                    /*!< DB3 (Bit 24)                                          */
#define CAN0_RFIFOMDATA01_DB3_Msk         (0xff000000UL)            /*!< DB3 (Bitfield-Mask: 0xff)                             */
#define CAN0_RFIFOMDATA01_DB2_Pos         (16UL)                    /*!< DB2 (Bit 16)                                          */
#define CAN0_RFIFOMDATA01_DB2_Msk         (0xff0000UL)              /*!< DB2 (Bitfield-Mask: 0xff)                             */
#define CAN0_RFIFOMDATA01_DB1_Pos         (8UL)                     /*!< DB1 (Bit 8)                                           */
#define CAN0_RFIFOMDATA01_DB1_Msk         (0xff00UL)                /*!< DB1 (Bitfield-Mask: 0xff)                             */
#define CAN0_RFIFOMDATA01_DB0_Pos         (0UL)                     /*!< DB0 (Bit 0)                                           */
#define CAN0_RFIFOMDATA01_DB0_Msk         (0xffUL)                  /*!< DB0 (Bitfield-Mask: 0xff)                             */
/* =====================================================  RFIFOMDATA11  ====================================================== */
#define CAN0_RFIFOMDATA11_DB7_Pos         (24UL)                    /*!< DB7 (Bit 24)                                          */
#define CAN0_RFIFOMDATA11_DB7_Msk         (0xff000000UL)            /*!< DB7 (Bitfield-Mask: 0xff)                             */
#define CAN0_RFIFOMDATA11_DB6_Pos         (16UL)                    /*!< DB6 (Bit 16)                                          */
#define CAN0_RFIFOMDATA11_DB6_Msk         (0xff0000UL)              /*!< DB6 (Bitfield-Mask: 0xff)                             */
#define CAN0_RFIFOMDATA11_DB5_Pos         (8UL)                     /*!< DB5 (Bit 8)                                           */
#define CAN0_RFIFOMDATA11_DB5_Msk         (0xff00UL)                /*!< DB5 (Bitfield-Mask: 0xff)                             */
#define CAN0_RFIFOMDATA11_DB4_Pos         (0UL)                     /*!< DB4 (Bit 0)                                           */
#define CAN0_RFIFOMDATA11_DB4_Msk         (0xffUL)                  /*!< DB4 (Bitfield-Mask: 0xff)                             */
/* =========================================================  FCTL  ========================================================== */
#define CAN0_FCTL_HBC1F_Pos               (8UL)                     /*!< HBC1F (Bit 8)                                         */
#define CAN0_FCTL_HBC1F_Msk               (0x3f00UL)                /*!< HBC1F (Bitfield-Mask: 0x3f)                           */
#define CAN0_FCTL_FLD_Pos                 (0UL)                     /*!< FLD (Bit 0)                                           */
#define CAN0_FCTL_FLD_Msk                 (0x1UL)                   /*!< FLD (Bitfield-Mask: 0x01)                             */
/* =========================================================  FMCFG  ========================================================= */
#define CAN0_FMCFG_FMOD27_Pos             (27UL)                    /*!< FMOD27 (Bit 27)                                       */
#define CAN0_FMCFG_FMOD27_Msk             (0x8000000UL)             /*!< FMOD27 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD26_Pos             (26UL)                    /*!< FMOD26 (Bit 26)                                       */
#define CAN0_FMCFG_FMOD26_Msk             (0x4000000UL)             /*!< FMOD26 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD25_Pos             (25UL)                    /*!< FMOD25 (Bit 25)                                       */
#define CAN0_FMCFG_FMOD25_Msk             (0x2000000UL)             /*!< FMOD25 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD24_Pos             (24UL)                    /*!< FMOD24 (Bit 24)                                       */
#define CAN0_FMCFG_FMOD24_Msk             (0x1000000UL)             /*!< FMOD24 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD23_Pos             (23UL)                    /*!< FMOD23 (Bit 23)                                       */
#define CAN0_FMCFG_FMOD23_Msk             (0x800000UL)              /*!< FMOD23 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD22_Pos             (22UL)                    /*!< FMOD22 (Bit 22)                                       */
#define CAN0_FMCFG_FMOD22_Msk             (0x400000UL)              /*!< FMOD22 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD21_Pos             (21UL)                    /*!< FMOD21 (Bit 21)                                       */
#define CAN0_FMCFG_FMOD21_Msk             (0x200000UL)              /*!< FMOD21 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD20_Pos             (20UL)                    /*!< FMOD20 (Bit 20)                                       */
#define CAN0_FMCFG_FMOD20_Msk             (0x100000UL)              /*!< FMOD20 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD19_Pos             (19UL)                    /*!< FMOD19 (Bit 19)                                       */
#define CAN0_FMCFG_FMOD19_Msk             (0x80000UL)               /*!< FMOD19 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD18_Pos             (18UL)                    /*!< FMOD18 (Bit 18)                                       */
#define CAN0_FMCFG_FMOD18_Msk             (0x40000UL)               /*!< FMOD18 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD17_Pos             (17UL)                    /*!< FMOD17 (Bit 17)                                       */
#define CAN0_FMCFG_FMOD17_Msk             (0x20000UL)               /*!< FMOD17 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD16_Pos             (16UL)                    /*!< FMOD16 (Bit 16)                                       */
#define CAN0_FMCFG_FMOD16_Msk             (0x10000UL)               /*!< FMOD16 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD15_Pos             (15UL)                    /*!< FMOD15 (Bit 15)                                       */
#define CAN0_FMCFG_FMOD15_Msk             (0x8000UL)                /*!< FMOD15 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD14_Pos             (14UL)                    /*!< FMOD14 (Bit 14)                                       */
#define CAN0_FMCFG_FMOD14_Msk             (0x4000UL)                /*!< FMOD14 (Bitfield-Mask: 0x01)                          */
