RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define CAN0_FMCFG_FMOD13_Pos             (13UL)                    /*!< FMOD13 (Bit 13)                                       */
#define CAN0_FMCFG_FMOD13_Msk             (0x2000UL)                /*!< FMOD13 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD12_Pos             (12UL)                    /*!< FMOD12 (Bit 12)                                       */
#define CAN0_FMCFG_FMOD12_Msk             (0x1000UL)                /*!< FMOD12 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD11_Pos             (11UL)                    /*!< FMOD11 (Bit 11)                                       */
#define CAN0_FMCFG_FMOD11_Msk             (0x800UL)                 /*!< FMOD11 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD10_Pos             (10UL)                    /*!< FMOD10 (Bit 10)                                       */
#define CAN0_FMCFG_FMOD10_Msk             (0x400UL)                 /*!< FMOD10 (Bitfield-Mask: 0x01)                          */
#define CAN0_FMCFG_FMOD9_Pos              (9UL)                     /*!< FMOD9 (Bit 9)                                         */
#define CAN0_FMCFG_FMOD9_Msk              (0x200UL)                 /*!< FMOD9 (Bitfield-Mask: 0x01)                           */
#define CAN0_FMCFG_FMOD8_Pos              (8UL)                     /*!< FMOD8 (Bit 8)                                         */
#define CAN0_FMCFG_FMOD8_Msk              (0x100UL)                 /*!< FMOD8 (Bitfield-Mask: 0x01)                           */
#define CAN0_FMCFG_FMOD7_Pos              (7UL)                     /*!< FMOD7 (Bit 7)                                         */
#define CAN0_FMCFG_FMOD7_Msk              (0x80UL)                  /*!< FMOD7 (Bitfield-Mask: 0x01)                           */
#define CAN0_FMCFG_FMOD6_Pos              (6UL)                     /*!< FMOD6 (Bit 6)                                         */
#define CAN0_FMCFG_FMOD6_Msk              (0x40UL)                  /*!< FMOD6 (Bitfield-Mask: 0x01)                           */
#define CAN0_FMCFG_FMOD5_Pos              (5UL)                     /*!< FMOD5 (Bit 5)                                         */
#define CAN0_FMCFG_FMOD5_Msk              (0x20UL)                  /*!< FMOD5 (Bitfield-Mask: 0x01)                           */
#define CAN0_FMCFG_FMOD4_Pos              (4UL)                     /*!< FMOD4 (Bit 4)                                         */
#define CAN0_FMCFG_FMOD4_Msk              (0x10UL)                  /*!< FMOD4 (Bitfield-Mask: 0x01)                           */
#define CAN0_FMCFG_FMOD3_Pos              (3UL)                     /*!< FMOD3 (Bit 3)                                         */
#define CAN0_FMCFG_FMOD3_Msk              (0x8UL)                   /*!< FMOD3 (Bitfield-Mask: 0x01)                           */
#define CAN0_FMCFG_FMOD2_Pos              (2UL)                     /*!< FMOD2 (Bit 2)                                         */
#define CAN0_FMCFG_FMOD2_Msk              (0x4UL)                   /*!< FMOD2 (Bitfield-Mask: 0x01)                           */
#define CAN0_FMCFG_FMOD1_Pos              (1UL)                     /*!< FMOD1 (Bit 1)                                         */
#define CAN0_FMCFG_FMOD1_Msk              (0x2UL)                   /*!< FMOD1 (Bitfield-Mask: 0x01)                           */
#define CAN0_FMCFG_FMOD0_Pos              (0UL)                     /*!< FMOD0 (Bit 0)                                         */
#define CAN0_FMCFG_FMOD0_Msk              (0x1UL)                   /*!< FMOD0 (Bitfield-Mask: 0x01)                           */
/* =========================================================  FSCFG  ========================================================= */
#define CAN0_FSCFG_FS0_Pos                (0UL)                     /*!< FS0 (Bit 0)                                           */
#define CAN0_FSCFG_FS0_Msk                (0x1UL)                   /*!< FS0 (Bitfield-Mask: 0x01)                             */
#define CAN0_FSCFG_FS1_Pos                (1UL)                     /*!< FS1 (Bit 1)                                           */
#define CAN0_FSCFG_FS1_Msk                (0x2UL)                   /*!< FS1 (Bitfield-Mask: 0x01)                             */
#define CAN0_FSCFG_FS2_Pos                (2UL)                     /*!< FS2 (Bit 2)                                           */
#define CAN0_FSCFG_FS2_Msk                (0x4UL)                   /*!< FS2 (Bitfield-Mask: 0x01)                             */
#define CAN0_FSCFG_FS3_Pos                (3UL)                     /*!< FS3 (Bit 3)                                           */
#define CAN0_FSCFG_FS3_Msk                (0x8UL)                   /*!< FS3 (Bitfield-Mask: 0x01)                             */
#define CAN0_FSCFG_FS4_Pos                (4UL)                     /*!< FS4 (Bit 4)                                           */
#define CAN0_FSCFG_FS4_Msk                (0x10UL)                  /*!< FS4 (Bitfield-Mask: 0x01)                             */
#define CAN0_FSCFG_FS5_Pos                (5UL)                     /*!< FS5 (Bit 5)                                           */
#define CAN0_FSCFG_FS5_Msk                (0x20UL)                  /*!< FS5 (Bitfield-Mask: 0x01)                             */
#define CAN0_FSCFG_FS6_Pos                (6UL)                     /*!< FS6 (Bit 6)                                           */
#define CAN0_FSCFG_FS6_Msk                (0x40UL)                  /*!< FS6 (Bitfield-Mask: 0x01)                             */
#define CAN0_FSCFG_FS7_Pos                (7UL)                     /*!< FS7 (Bit 7)                                           */
#define CAN0_FSCFG_FS7_Msk                (0x80UL)                  /*!< FS7 (Bitfield-Mask: 0x01)                             */
#define CAN0_FSCFG_FS8_Pos                (8UL)                     /*!< FS8 (Bit 8)                                           */
#define CAN0_FSCFG_FS8_Msk                (0x100UL)                 /*!< FS8 (Bitfield-Mask: 0x01)                             */
#define CAN0_FSCFG_FS9_Pos                (9UL)                     /*!< FS9 (Bit 9)                                           */
#define CAN0_FSCFG_FS9_Msk                (0x200UL)                 /*!< FS9 (Bitfield-Mask: 0x01)                             */
#define CAN0_FSCFG_FS10_Pos               (10UL)                    /*!< FS10 (Bit 10)                                         */
#define CAN0_FSCFG_FS10_Msk               (0x400UL)                 /*!< FS10 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS11_Pos               (11UL)                    /*!< FS11 (Bit 11)                                         */
#define CAN0_FSCFG_FS11_Msk               (0x800UL)                 /*!< FS11 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS12_Pos               (12UL)                    /*!< FS12 (Bit 12)                                         */
#define CAN0_FSCFG_FS12_Msk               (0x1000UL)                /*!< FS12 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS13_Pos               (13UL)                    /*!< FS13 (Bit 13)                                         */
#define CAN0_FSCFG_FS13_Msk               (0x2000UL)                /*!< FS13 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS14_Pos               (14UL)                    /*!< FS14 (Bit 14)                                         */
#define CAN0_FSCFG_FS14_Msk               (0x4000UL)                /*!< FS14 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS15_Pos               (15UL)                    /*!< FS15 (Bit 15)                                         */
#define CAN0_FSCFG_FS15_Msk               (0x8000UL)                /*!< FS15 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS16_Pos               (16UL)                    /*!< FS16 (Bit 16)                                         */
#define CAN0_FSCFG_FS16_Msk               (0x10000UL)               /*!< FS16 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS17_Pos               (17UL)                    /*!< FS17 (Bit 17)                                         */
#define CAN0_FSCFG_FS17_Msk               (0x20000UL)               /*!< FS17 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS18_Pos               (18UL)                    /*!< FS18 (Bit 18)                                         */
#define CAN0_FSCFG_FS18_Msk               (0x40000UL)               /*!< FS18 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS19_Pos               (19UL)                    /*!< FS19 (Bit 19)                                         */
#define CAN0_FSCFG_FS19_Msk               (0x80000UL)               /*!< FS19 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS20_Pos               (20UL)                    /*!< FS20 (Bit 20)                                         */
#define CAN0_FSCFG_FS20_Msk               (0x100000UL)              /*!< FS20 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS21_Pos               (21UL)                    /*!< FS21 (Bit 21)                                         */
#define CAN0_FSCFG_FS21_Msk               (0x200000UL)              /*!< FS21 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS22_Pos               (22UL)                    /*!< FS22 (Bit 22)                                         */
#define CAN0_FSCFG_FS22_Msk               (0x400000UL)              /*!< FS22 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS23_Pos               (23UL)                    /*!< FS23 (Bit 23)                                         */
#define CAN0_FSCFG_FS23_Msk               (0x800000UL)              /*!< FS23 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS24_Pos               (24UL)                    /*!< FS24 (Bit 24)                                         */
#define CAN0_FSCFG_FS24_Msk               (0x1000000UL)             /*!< FS24 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS25_Pos               (25UL)                    /*!< FS25 (Bit 25)                                         */
#define CAN0_FSCFG_FS25_Msk               (0x2000000UL)             /*!< FS25 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS26_Pos               (26UL)                    /*!< FS26 (Bit 26)                                         */
#define CAN0_FSCFG_FS26_Msk               (0x4000000UL)             /*!< FS26 (Bitfield-Mask: 0x01)                            */
#define CAN0_FSCFG_FS27_Pos               (27UL)                    /*!< FS27 (Bit 27)                                         */
#define CAN0_FSCFG_FS27_Msk               (0x8000000UL)             /*!< FS27 (Bitfield-Mask: 0x01)                            */
/* ========================================================  FAFIFO  ========================================================= */
#define CAN0_FAFIFO_FAF0_Pos              (0UL)                     /*!< FAF0 (Bit 0)                                          */
#define CAN0_FAFIFO_FAF0_Msk              (0x1UL)                   /*!< FAF0 (Bitfield-Mask: 0x01)                            */
#define CAN0_FAFIFO_FAF1_Pos              (1UL)                     /*!< FAF1 (Bit 1)                                          */
#define CAN0_FAFIFO_FAF1_Msk              (0x2UL)                   /*!< FAF1 (Bitfield-Mask: 0x01)                            */
#define CAN0_FAFIFO_FAF2_Pos              (2UL)                     /*!< FAF2 (Bit 2)                                          */
#define CAN0_FAFIFO_FAF2_Msk              (0x4UL)                   /*!< FAF2 (Bitfield-Mask: 0x01)                            */
#define CAN0_FAFIFO_FAF3_Pos              (3UL)                     /*!< FAF3 (Bit 3)                                          */
#define CAN0_FAFIFO_FAF3_Msk              (0x8UL)                   /*!< FAF3 (Bitfield-Mask: 0x01)                            */
#define CAN0_FAFIFO_FAF4_Pos              (4UL)                     /*!< FAF4 (Bit 4)                                          */
#define CAN0_FAFIFO_FAF4_Msk              (0x10UL)                  /*!< FAF4 (Bitfield-Mask: 0x01)                            */
#define CAN0_FAFIFO_FAF5_Pos              (5UL)                     /*!< FAF5 (Bit 5)                                          */
#define CAN0_FAFIFO_FAF5_Msk              (0x20UL)                  /*!< FAF5 (Bitfield-Mask: 0x01)                            */
#define CAN0_FAFIFO_FAF6_Pos              (6UL)                     /*!< FAF6 (Bit 6)                                          */
#define CAN0_FAFIFO_FAF6_Msk              (0x40UL)                  /*!< FAF6 (Bitfield-Mask: 0x01)                            */
#define CAN0_FAFIFO_FAF7_Pos              (7UL)                     /*!< FAF7 (Bit 7)                                          */
#define CAN0_FAFIFO_FAF7_Msk              (0x80UL)                  /*!< FAF7 (Bitfield-Mask: 0x01)                            */
#define CAN0_FAFIFO_FAF8_Pos              (8UL)                     /*!< FAF8 (Bit 8)                                          */
#define CAN0_FAFIFO_FAF8_Msk              (0x100UL)                 /*!< FAF8 (Bitfield-Mask: 0x01)                            */
#define CAN0_FAFIFO_FAF9_Pos              (9UL)                     /*!< FAF9 (Bit 9)                                          */
#define CAN0_FAFIFO_FAF9_Msk              (0x200UL)                 /*!< FAF9 (Bitfield-Mask: 0x01)                            */
#define CAN0_FAFIFO_FAF10_Pos             (10UL)                    /*!< FAF10 (Bit 10)                                        */
#define CAN0_FAFIFO_FAF10_Msk             (0x400UL)                 /*!< FAF10 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF11_Pos             (11UL)                    /*!< FAF11 (Bit 11)                                        */
#define CAN0_FAFIFO_FAF11_Msk             (0x800UL)                 /*!< FAF11 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF12_Pos             (12UL)                    /*!< FAF12 (Bit 12)                                        */
#define CAN0_FAFIFO_FAF12_Msk             (0x1000UL)                /*!< FAF12 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF13_Pos             (13UL)                    /*!< FAF13 (Bit 13)                                        */
#define CAN0_FAFIFO_FAF13_Msk             (0x2000UL)                /*!< FAF13 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF14_Pos             (14UL)                    /*!< FAF14 (Bit 14)                                        */
#define CAN0_FAFIFO_FAF14_Msk             (0x4000UL)                /*!< FAF14 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF15_Pos             (15UL)                    /*!< FAF15 (Bit 15)                                        */
#define CAN0_FAFIFO_FAF15_Msk             (0x8000UL)                /*!< FAF15 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF16_Pos             (16UL)                    /*!< FAF16 (Bit 16)                                        */
#define CAN0_FAFIFO_FAF16_Msk             (0x10000UL)               /*!< FAF16 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF17_Pos             (17UL)                    /*!< FAF17 (Bit 17)                                        */
#define CAN0_FAFIFO_FAF17_Msk             (0x20000UL)               /*!< FAF17 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF18_Pos             (18UL)                    /*!< FAF18 (Bit 18)                                        */
#define CAN0_FAFIFO_FAF18_Msk             (0x40000UL)               /*!< FAF18 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF19_Pos             (19UL)                    /*!< FAF19 (Bit 19)                                        */
#define CAN0_FAFIFO_FAF19_Msk             (0x80000UL)               /*!< FAF19 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF20_Pos             (20UL)                    /*!< FAF20 (Bit 20)                                        */
#define CAN0_FAFIFO_FAF20_Msk             (0x100000UL)              /*!< FAF20 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF21_Pos             (21UL)                    /*!< FAF21 (Bit 21)                                        */
#define CAN0_FAFIFO_FAF21_Msk             (0x200000UL)              /*!< FAF21 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF22_Pos             (22UL)                    /*!< FAF22 (Bit 22)                                        */
#define CAN0_FAFIFO_FAF22_Msk             (0x400000UL)              /*!< FAF22 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF23_Pos             (23UL)                    /*!< FAF23 (Bit 23)                                        */
#define CAN0_FAFIFO_FAF23_Msk             (0x800000UL)              /*!< FAF23 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF24_Pos             (24UL)                    /*!< FAF24 (Bit 24)                                        */
#define CAN0_FAFIFO_FAF24_Msk             (0x1000000UL)             /*!< FAF24 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF25_Pos             (25UL)                    /*!< FAF25 (Bit 25)                                        */
#define CAN0_FAFIFO_FAF25_Msk             (0x2000000UL)             /*!< FAF25 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF26_Pos             (26UL)                    /*!< FAF26 (Bit 26)                                        */
#define CAN0_FAFIFO_FAF26_Msk             (0x4000000UL)             /*!< FAF26 (Bitfield-Mask: 0x01)                           */
#define CAN0_FAFIFO_FAF27_Pos             (27UL)                    /*!< FAF27 (Bit 27)                                        */
#define CAN0_FAFIFO_FAF27_Msk             (0x8000000UL)             /*!< FAF27 (Bitfield-Mask: 0x01)                           */
/* ==========================================================  FW  =========================================================== */
#define CAN0_FW_FW0_Pos                   (0UL)                     /*!< FW0 (Bit 0)                                           */
#define CAN0_FW_FW0_Msk                   (0x1UL)                   /*!< FW0 (Bitfield-Mask: 0x01)                             */
#define CAN0_FW_FW1_Pos                   (1UL)                     /*!< FW1 (Bit 1)                                           */
#define CAN0_FW_FW1_Msk                   (0x2UL)                   /*!< FW1 (Bitfield-Mask: 0x01)                             */
#define CAN0_FW_FW2_Pos                   (2UL)                     /*!< FW2 (Bit 2)                                           */
#define CAN0_FW_FW2_Msk                   (0x4UL)                   /*!< FW2 (Bitfield-Mask: 0x01)                             */
#define CAN0_FW_FW3_Pos                   (3UL)                     /*!< FW3 (Bit 3)                                           */
#define CAN0_FW_FW3_Msk                   (0x8UL)                   /*!< FW3 (Bitfield-Mask: 0x01)                             */
#define CAN0_FW_FW4_Pos                   (4UL)                     /*!< FW4 (Bit 4)                                           */
#define CAN0_FW_FW4_Msk                   (0x10UL)                  /*!< FW4 (Bitfield-Mask: 0x01)                             */
#define CAN0_FW_FW5_Pos                   (5UL)                     /*!< FW5 (Bit 5)                                           */
#define CAN0_FW_FW5_Msk                   (0x20UL)                  /*!< FW5 (Bitfield-Mask: 0x01)                             */
#define CAN0_FW_FW6_Pos                   (6UL)                     /*!< FW6 (Bit 6)                                           */
#define CAN0_FW_FW6_Msk                   (0x40UL)                  /*!< FW6 (Bitfield-Mask: 0x01)                             */
#define CAN0_FW_FW7_Pos                   (7UL)                     /*!< FW7 (Bit 7)                                           */
#define CAN0_FW_FW7_Msk                   (0x80UL)                  /*!< FW7 (Bitfield-Mask: 0x01)                             */
#define CAN0_FW_FW8_Pos                   (8UL)                     /*!< FW8 (Bit 8)                                           */
#define CAN0_FW_FW8_Msk                   (0x100UL)                 /*!< FW8 (Bitfield-Mask: 0x01)                             */
#define CAN0_FW_FW9_Pos                   (9UL)                     /*!< FW9 (Bit 9)                                           */
#define CAN0_FW_FW9_Msk                   (0x200UL)                 /*!< FW9 (Bitfield-Mask: 0x01)                             */
#define CAN0_FW_FW10_Pos                  (10UL)                    /*!< FW10 (Bit 10)                                         */
#define CAN0_FW_FW10_Msk                  (0x400UL)                 /*!< FW10 (Bitfield-Mask: 0x01)                            */
#define CAN0_FW_FW11_Pos                  (11UL)                    /*!< FW11 (Bit 11)                                         */
#define CAN0_FW_FW11_Msk                  (0x800UL)                 /*!< FW11 (Bitfield-Mask: 0x01)                            */
#define CAN0_FW_FW12_Pos                  (12UL)                    /*!< FW12 (Bit 12)                                         */
#define CAN0_FW_FW12_Msk                  (0x1000UL)                /*!< FW12 (Bitfield-Mask: 0x01)                            */
#define CAN0_FW_FW13_Pos                  (13UL)                    /*!< FW13 (Bit 13)                                         */
#define CAN0_FW_FW13_Msk                  (0x2000UL)                /*!< FW13 (Bitfield-Mask: 0x01)                            */
#define CAN0_FW_FW14_Pos                  (14UL)                    /*!< FW14 (Bit 14)                                         */
#define CAN0_FW_FW14_Msk                  (0x4000UL)                /*!< FW14 (Bitfield-Mask: 0x01)                            */
#define CAN0_FW_FW15_Pos                  (15UL)                    /*!< FW15 (Bit 15)                                         */
#define CAN0_FW_FW15_Msk                  (0x8000UL)                /*!< FW15 (Bitfield-Mask: 0x01)                            */
#define CAN0_FW_FW16_Pos                  (16UL)                    /*!< FW16 (Bit 16)                                         */
#define CAN0_FW_FW16_Msk                  (0x10000UL)               /*!< FW16 (Bitfield-Mask: 0x01)                            */
#define CAN0_FW_FW17_Pos                  (17UL)                    /*!< FW17 (Bit 17)                                         */
#define CAN0_FW_FW17_Msk                  (0x20000UL)               /*!< FW17 (Bitfield-Mask: 0x01)                            */
#define CAN0_FW_FW18_Pos                  (18UL)                    /*!< FW18 (Bit 18)                                         */
#define CAN0_FW_FW18_Msk                  (0x40000UL)               /*!< FW18 (Bitfield-Mask: 0x01)                            */
#define CAN0_FW_FW19_Pos                  (19UL)                    /*!< FW19 (Bit 19)                                         */
#define CAN0_FW_FW19_Msk                  (0x80000UL)               /*!< FW19 (Bitfield-Mask: 0x01)                            */
#define CAN0_FW_FW20_Pos                  (20UL)                    /*!< FW20 (Bit 20)                                         */
