RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define CAN0_F6DATA1_FD29_Msk             (0x20000000UL)            /*!< FD29 (Bitfield-Mask: 0x01)                            */
#define CAN0_F6DATA1_FD30_Pos             (30UL)                    /*!< FD30 (Bit 30)                                         */
#define CAN0_F6DATA1_FD30_Msk             (0x40000000UL)            /*!< FD30 (Bitfield-Mask: 0x01)                            */
#define CAN0_F6DATA1_FD31_Pos             (31UL)                    /*!< FD31 (Bit 31)                                         */
#define CAN0_F6DATA1_FD31_Msk             (0x80000000UL)            /*!< FD31 (Bitfield-Mask: 0x01)                            */
/* ========================================================  F7DATA0  ======================================================== */
#define CAN0_F7DATA0_FD0_Pos              (0UL)                     /*!< FD0 (Bit 0)                                           */
#define CAN0_F7DATA0_FD0_Msk              (0x1UL)                   /*!< FD0 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA0_FD1_Pos              (1UL)                     /*!< FD1 (Bit 1)                                           */
#define CAN0_F7DATA0_FD1_Msk              (0x2UL)                   /*!< FD1 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA0_FD2_Pos              (2UL)                     /*!< FD2 (Bit 2)                                           */
#define CAN0_F7DATA0_FD2_Msk              (0x4UL)                   /*!< FD2 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA0_FD3_Pos              (3UL)                     /*!< FD3 (Bit 3)                                           */
#define CAN0_F7DATA0_FD3_Msk              (0x8UL)                   /*!< FD3 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA0_FD4_Pos              (4UL)                     /*!< FD4 (Bit 4)                                           */
#define CAN0_F7DATA0_FD4_Msk              (0x10UL)                  /*!< FD4 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA0_FD5_Pos              (5UL)                     /*!< FD5 (Bit 5)                                           */
#define CAN0_F7DATA0_FD5_Msk              (0x20UL)                  /*!< FD5 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA0_FD6_Pos              (6UL)                     /*!< FD6 (Bit 6)                                           */
#define CAN0_F7DATA0_FD6_Msk              (0x40UL)                  /*!< FD6 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA0_FD7_Pos              (7UL)                     /*!< FD7 (Bit 7)                                           */
#define CAN0_F7DATA0_FD7_Msk              (0x80UL)                  /*!< FD7 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA0_FD8_Pos              (8UL)                     /*!< FD8 (Bit 8)                                           */
#define CAN0_F7DATA0_FD8_Msk              (0x100UL)                 /*!< FD8 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA0_FD9_Pos              (9UL)                     /*!< FD9 (Bit 9)                                           */
#define CAN0_F7DATA0_FD9_Msk              (0x200UL)                 /*!< FD9 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA0_FD10_Pos             (10UL)                    /*!< FD10 (Bit 10)                                         */
#define CAN0_F7DATA0_FD10_Msk             (0x400UL)                 /*!< FD10 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD11_Pos             (11UL)                    /*!< FD11 (Bit 11)                                         */
#define CAN0_F7DATA0_FD11_Msk             (0x800UL)                 /*!< FD11 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD12_Pos             (12UL)                    /*!< FD12 (Bit 12)                                         */
#define CAN0_F7DATA0_FD12_Msk             (0x1000UL)                /*!< FD12 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD13_Pos             (13UL)                    /*!< FD13 (Bit 13)                                         */
#define CAN0_F7DATA0_FD13_Msk             (0x2000UL)                /*!< FD13 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD14_Pos             (14UL)                    /*!< FD14 (Bit 14)                                         */
#define CAN0_F7DATA0_FD14_Msk             (0x4000UL)                /*!< FD14 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD15_Pos             (15UL)                    /*!< FD15 (Bit 15)                                         */
#define CAN0_F7DATA0_FD15_Msk             (0x8000UL)                /*!< FD15 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD16_Pos             (16UL)                    /*!< FD16 (Bit 16)                                         */
#define CAN0_F7DATA0_FD16_Msk             (0x10000UL)               /*!< FD16 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD17_Pos             (17UL)                    /*!< FD17 (Bit 17)                                         */
#define CAN0_F7DATA0_FD17_Msk             (0x20000UL)               /*!< FD17 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD18_Pos             (18UL)                    /*!< FD18 (Bit 18)                                         */
#define CAN0_F7DATA0_FD18_Msk             (0x40000UL)               /*!< FD18 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD19_Pos             (19UL)                    /*!< FD19 (Bit 19)                                         */
#define CAN0_F7DATA0_FD19_Msk             (0x80000UL)               /*!< FD19 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD20_Pos             (20UL)                    /*!< FD20 (Bit 20)                                         */
#define CAN0_F7DATA0_FD20_Msk             (0x100000UL)              /*!< FD20 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD21_Pos             (21UL)                    /*!< FD21 (Bit 21)                                         */
#define CAN0_F7DATA0_FD21_Msk             (0x200000UL)              /*!< FD21 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD22_Pos             (22UL)                    /*!< FD22 (Bit 22)                                         */
#define CAN0_F7DATA0_FD22_Msk             (0x400000UL)              /*!< FD22 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD23_Pos             (23UL)                    /*!< FD23 (Bit 23)                                         */
#define CAN0_F7DATA0_FD23_Msk             (0x800000UL)              /*!< FD23 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD24_Pos             (24UL)                    /*!< FD24 (Bit 24)                                         */
#define CAN0_F7DATA0_FD24_Msk             (0x1000000UL)             /*!< FD24 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD25_Pos             (25UL)                    /*!< FD25 (Bit 25)                                         */
#define CAN0_F7DATA0_FD25_Msk             (0x2000000UL)             /*!< FD25 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD26_Pos             (26UL)                    /*!< FD26 (Bit 26)                                         */
#define CAN0_F7DATA0_FD26_Msk             (0x4000000UL)             /*!< FD26 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD27_Pos             (27UL)                    /*!< FD27 (Bit 27)                                         */
#define CAN0_F7DATA0_FD27_Msk             (0x8000000UL)             /*!< FD27 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD28_Pos             (28UL)                    /*!< FD28 (Bit 28)                                         */
#define CAN0_F7DATA0_FD28_Msk             (0x10000000UL)            /*!< FD28 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD29_Pos             (29UL)                    /*!< FD29 (Bit 29)                                         */
#define CAN0_F7DATA0_FD29_Msk             (0x20000000UL)            /*!< FD29 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD30_Pos             (30UL)                    /*!< FD30 (Bit 30)                                         */
#define CAN0_F7DATA0_FD30_Msk             (0x40000000UL)            /*!< FD30 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA0_FD31_Pos             (31UL)                    /*!< FD31 (Bit 31)                                         */
#define CAN0_F7DATA0_FD31_Msk             (0x80000000UL)            /*!< FD31 (Bitfield-Mask: 0x01)                            */
/* ========================================================  F7DATA1  ======================================================== */
#define CAN0_F7DATA1_FD0_Pos              (0UL)                     /*!< FD0 (Bit 0)                                           */
#define CAN0_F7DATA1_FD0_Msk              (0x1UL)                   /*!< FD0 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA1_FD1_Pos              (1UL)                     /*!< FD1 (Bit 1)                                           */
#define CAN0_F7DATA1_FD1_Msk              (0x2UL)                   /*!< FD1 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA1_FD2_Pos              (2UL)                     /*!< FD2 (Bit 2)                                           */
#define CAN0_F7DATA1_FD2_Msk              (0x4UL)                   /*!< FD2 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA1_FD3_Pos              (3UL)                     /*!< FD3 (Bit 3)                                           */
#define CAN0_F7DATA1_FD3_Msk              (0x8UL)                   /*!< FD3 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA1_FD4_Pos              (4UL)                     /*!< FD4 (Bit 4)                                           */
#define CAN0_F7DATA1_FD4_Msk              (0x10UL)                  /*!< FD4 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA1_FD5_Pos              (5UL)                     /*!< FD5 (Bit 5)                                           */
#define CAN0_F7DATA1_FD5_Msk              (0x20UL)                  /*!< FD5 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA1_FD6_Pos              (6UL)                     /*!< FD6 (Bit 6)                                           */
#define CAN0_F7DATA1_FD6_Msk              (0x40UL)                  /*!< FD6 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA1_FD7_Pos              (7UL)                     /*!< FD7 (Bit 7)                                           */
#define CAN0_F7DATA1_FD7_Msk              (0x80UL)                  /*!< FD7 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA1_FD8_Pos              (8UL)                     /*!< FD8 (Bit 8)                                           */
#define CAN0_F7DATA1_FD8_Msk              (0x100UL)                 /*!< FD8 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA1_FD9_Pos              (9UL)                     /*!< FD9 (Bit 9)                                           */
#define CAN0_F7DATA1_FD9_Msk              (0x200UL)                 /*!< FD9 (Bitfield-Mask: 0x01)                             */
#define CAN0_F7DATA1_FD10_Pos             (10UL)                    /*!< FD10 (Bit 10)                                         */
#define CAN0_F7DATA1_FD10_Msk             (0x400UL)                 /*!< FD10 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD11_Pos             (11UL)                    /*!< FD11 (Bit 11)                                         */
#define CAN0_F7DATA1_FD11_Msk             (0x800UL)                 /*!< FD11 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD12_Pos             (12UL)                    /*!< FD12 (Bit 12)                                         */
#define CAN0_F7DATA1_FD12_Msk             (0x1000UL)                /*!< FD12 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD13_Pos             (13UL)                    /*!< FD13 (Bit 13)                                         */
#define CAN0_F7DATA1_FD13_Msk             (0x2000UL)                /*!< FD13 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD14_Pos             (14UL)                    /*!< FD14 (Bit 14)                                         */
#define CAN0_F7DATA1_FD14_Msk             (0x4000UL)                /*!< FD14 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD15_Pos             (15UL)                    /*!< FD15 (Bit 15)                                         */
#define CAN0_F7DATA1_FD15_Msk             (0x8000UL)                /*!< FD15 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD16_Pos             (16UL)                    /*!< FD16 (Bit 16)                                         */
#define CAN0_F7DATA1_FD16_Msk             (0x10000UL)               /*!< FD16 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD17_Pos             (17UL)                    /*!< FD17 (Bit 17)                                         */
#define CAN0_F7DATA1_FD17_Msk             (0x20000UL)               /*!< FD17 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD18_Pos             (18UL)                    /*!< FD18 (Bit 18)                                         */
#define CAN0_F7DATA1_FD18_Msk             (0x40000UL)               /*!< FD18 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD19_Pos             (19UL)                    /*!< FD19 (Bit 19)                                         */
#define CAN0_F7DATA1_FD19_Msk             (0x80000UL)               /*!< FD19 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD20_Pos             (20UL)                    /*!< FD20 (Bit 20)                                         */
#define CAN0_F7DATA1_FD20_Msk             (0x100000UL)              /*!< FD20 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD21_Pos             (21UL)                    /*!< FD21 (Bit 21)                                         */
#define CAN0_F7DATA1_FD21_Msk             (0x200000UL)              /*!< FD21 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD22_Pos             (22UL)                    /*!< FD22 (Bit 22)                                         */
#define CAN0_F7DATA1_FD22_Msk             (0x400000UL)              /*!< FD22 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD23_Pos             (23UL)                    /*!< FD23 (Bit 23)                                         */
#define CAN0_F7DATA1_FD23_Msk             (0x800000UL)              /*!< FD23 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD24_Pos             (24UL)                    /*!< FD24 (Bit 24)                                         */
#define CAN0_F7DATA1_FD24_Msk             (0x1000000UL)             /*!< FD24 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD25_Pos             (25UL)                    /*!< FD25 (Bit 25)                                         */
#define CAN0_F7DATA1_FD25_Msk             (0x2000000UL)             /*!< FD25 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD26_Pos             (26UL)                    /*!< FD26 (Bit 26)                                         */
#define CAN0_F7DATA1_FD26_Msk             (0x4000000UL)             /*!< FD26 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD27_Pos             (27UL)                    /*!< FD27 (Bit 27)                                         */
#define CAN0_F7DATA1_FD27_Msk             (0x8000000UL)             /*!< FD27 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD28_Pos             (28UL)                    /*!< FD28 (Bit 28)                                         */
#define CAN0_F7DATA1_FD28_Msk             (0x10000000UL)            /*!< FD28 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD29_Pos             (29UL)                    /*!< FD29 (Bit 29)                                         */
#define CAN0_F7DATA1_FD29_Msk             (0x20000000UL)            /*!< FD29 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD30_Pos             (30UL)                    /*!< FD30 (Bit 30)                                         */
#define CAN0_F7DATA1_FD30_Msk             (0x40000000UL)            /*!< FD30 (Bitfield-Mask: 0x01)                            */
#define CAN0_F7DATA1_FD31_Pos             (31UL)                    /*!< FD31 (Bit 31)                                         */
#define CAN0_F7DATA1_FD31_Msk             (0x80000000UL)            /*!< FD31 (Bitfield-Mask: 0x01)                            */
/* ========================================================  F8DATA0  ======================================================== */
#define CAN0_F8DATA0_FD0_Pos              (0UL)                     /*!< FD0 (Bit 0)                                           */
#define CAN0_F8DATA0_FD0_Msk              (0x1UL)                   /*!< FD0 (Bitfield-Mask: 0x01)                             */
#define CAN0_F8DATA0_FD1_Pos              (1UL)                     /*!< FD1 (Bit 1)                                           */
#define CAN0_F8DATA0_FD1_Msk              (0x2UL)                   /*!< FD1 (Bitfield-Mask: 0x01)                             */
#define CAN0_F8DATA0_FD2_Pos              (2UL)                     /*!< FD2 (Bit 2)                                           */
#define CAN0_F8DATA0_FD2_Msk              (0x4UL)                   /*!< FD2 (Bitfield-Mask: 0x01)                             */
#define CAN0_F8DATA0_FD3_Pos              (3UL)                     /*!< FD3 (Bit 3)                                           */
#define CAN0_F8DATA0_FD3_Msk              (0x8UL)                   /*!< FD3 (Bitfield-Mask: 0x01)                             */
#define CAN0_F8DATA0_FD4_Pos              (4UL)                     /*!< FD4 (Bit 4)                                           */
#define CAN0_F8DATA0_FD4_Msk              (0x10UL)                  /*!< FD4 (Bitfield-Mask: 0x01)                             */
#define CAN0_F8DATA0_FD5_Pos              (5UL)                     /*!< FD5 (Bit 5)                                           */
#define CAN0_F8DATA0_FD5_Msk              (0x20UL)                  /*!< FD5 (Bitfield-Mask: 0x01)                             */
#define CAN0_F8DATA0_FD6_Pos              (6UL)                     /*!< FD6 (Bit 6)                                           */
#define CAN0_F8DATA0_FD6_Msk              (0x40UL)                  /*!< FD6 (Bitfield-Mask: 0x01)                             */
#define CAN0_F8DATA0_FD7_Pos              (7UL)                     /*!< FD7 (Bit 7)                                           */
#define CAN0_F8DATA0_FD7_Msk              (0x80UL)                  /*!< FD7 (Bitfield-Mask: 0x01)                             */
#define CAN0_F8DATA0_FD8_Pos              (8UL)                     /*!< FD8 (Bit 8)                                           */
#define CAN0_F8DATA0_FD8_Msk              (0x100UL)                 /*!< FD8 (Bitfield-Mask: 0x01)                             */
#define CAN0_F8DATA0_FD9_Pos              (9UL)                     /*!< FD9 (Bit 9)                                           */
#define CAN0_F8DATA0_FD9_Msk              (0x200UL)                 /*!< FD9 (Bitfield-Mask: 0x01)                             */
#define CAN0_F8DATA0_FD10_Pos             (10UL)                    /*!< FD10 (Bit 10)                                         */
#define CAN0_F8DATA0_FD10_Msk             (0x400UL)                 /*!< FD10 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD11_Pos             (11UL)                    /*!< FD11 (Bit 11)                                         */
#define CAN0_F8DATA0_FD11_Msk             (0x800UL)                 /*!< FD11 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD12_Pos             (12UL)                    /*!< FD12 (Bit 12)                                         */
#define CAN0_F8DATA0_FD12_Msk             (0x1000UL)                /*!< FD12 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD13_Pos             (13UL)                    /*!< FD13 (Bit 13)                                         */
#define CAN0_F8DATA0_FD13_Msk             (0x2000UL)                /*!< FD13 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD14_Pos             (14UL)                    /*!< FD14 (Bit 14)                                         */
#define CAN0_F8DATA0_FD14_Msk             (0x4000UL)                /*!< FD14 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD15_Pos             (15UL)                    /*!< FD15 (Bit 15)                                         */
#define CAN0_F8DATA0_FD15_Msk             (0x8000UL)                /*!< FD15 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD16_Pos             (16UL)                    /*!< FD16 (Bit 16)                                         */
#define CAN0_F8DATA0_FD16_Msk             (0x10000UL)               /*!< FD16 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD17_Pos             (17UL)                    /*!< FD17 (Bit 17)                                         */
#define CAN0_F8DATA0_FD17_Msk             (0x20000UL)               /*!< FD17 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD18_Pos             (18UL)                    /*!< FD18 (Bit 18)                                         */
#define CAN0_F8DATA0_FD18_Msk             (0x40000UL)               /*!< FD18 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD19_Pos             (19UL)                    /*!< FD19 (Bit 19)                                         */
#define CAN0_F8DATA0_FD19_Msk             (0x80000UL)               /*!< FD19 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD20_Pos             (20UL)                    /*!< FD20 (Bit 20)                                         */
#define CAN0_F8DATA0_FD20_Msk             (0x100000UL)              /*!< FD20 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD21_Pos             (21UL)                    /*!< FD21 (Bit 21)                                         */
#define CAN0_F8DATA0_FD21_Msk             (0x200000UL)              /*!< FD21 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD22_Pos             (22UL)                    /*!< FD22 (Bit 22)                                         */
#define CAN0_F8DATA0_FD22_Msk             (0x400000UL)              /*!< FD22 (Bitfield-Mask: 0x01)                            */
#define CAN0_F8DATA0_FD23_Pos             (23UL)                    /*!< FD23 (Bit 23)                                         */
#define CAN0_F8DATA0_FD23_Msk             (0x800000UL)              /*!< FD23 (Bitfield-Mask: 0x01)                            */
