RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* ==========================================================  CTL  ========================================================== */
#define DAC_CTL_DEN0_Pos                  (0UL)                     /*!< DEN0 (Bit 0)                                          */
#define DAC_CTL_DEN0_Msk                  (0x1UL)                   /*!< DEN0 (Bitfield-Mask: 0x01)                            */
#define DAC_CTL_DBOFF0_Pos                (1UL)                     /*!< DBOFF0 (Bit 1)                                        */
#define DAC_CTL_DBOFF0_Msk                (0x2UL)                   /*!< DBOFF0 (Bitfield-Mask: 0x01)                          */
#define DAC_CTL_DTEN0_Pos                 (2UL)                     /*!< DTEN0 (Bit 2)                                         */
#define DAC_CTL_DTEN0_Msk                 (0x4UL)                   /*!< DTEN0 (Bitfield-Mask: 0x01)                           */
#define DAC_CTL_DTSEL0_Pos                (3UL)                     /*!< DTSEL0 (Bit 3)                                        */
#define DAC_CTL_DTSEL0_Msk                (0x38UL)                  /*!< DTSEL0 (Bitfield-Mask: 0x07)                          */
#define DAC_CTL_DWM0_Pos                  (6UL)                     /*!< DWM0 (Bit 6)                                          */
#define DAC_CTL_DWM0_Msk                  (0xc0UL)                  /*!< DWM0 (Bitfield-Mask: 0x03)                            */
#define DAC_CTL_DWBW0_Pos                 (8UL)                     /*!< DWBW0 (Bit 8)                                         */
#define DAC_CTL_DWBW0_Msk                 (0xf00UL)                 /*!< DWBW0 (Bitfield-Mask: 0x0f)                           */
#define DAC_CTL_DDMAEN0_Pos               (12UL)                    /*!< DDMAEN0 (Bit 12)                                      */
#define DAC_CTL_DDMAEN0_Msk               (0x1000UL)                /*!< DDMAEN0 (Bitfield-Mask: 0x01)                         */
#define DAC_CTL_DEN1_Pos                  (16UL)                    /*!< DEN1 (Bit 16)                                         */
#define DAC_CTL_DEN1_Msk                  (0x10000UL)               /*!< DEN1 (Bitfield-Mask: 0x01)                            */
#define DAC_CTL_DBOFF1_Pos                (17UL)                    /*!< DBOFF1 (Bit 17)                                       */
#define DAC_CTL_DBOFF1_Msk                (0x20000UL)               /*!< DBOFF1 (Bitfield-Mask: 0x01)                          */
#define DAC_CTL_DTEN1_Pos                 (18UL)                    /*!< DTEN1 (Bit 18)                                        */
#define DAC_CTL_DTEN1_Msk                 (0x40000UL)               /*!< DTEN1 (Bitfield-Mask: 0x01)                           */
#define DAC_CTL_DTSEL1_Pos                (19UL)                    /*!< DTSEL1 (Bit 19)                                       */
#define DAC_CTL_DTSEL1_Msk                (0x380000UL)              /*!< DTSEL1 (Bitfield-Mask: 0x07)                          */
#define DAC_CTL_DWM1_Pos                  (22UL)                    /*!< DWM1 (Bit 22)                                         */
#define DAC_CTL_DWM1_Msk                  (0xc00000UL)              /*!< DWM1 (Bitfield-Mask: 0x03)                            */
#define DAC_CTL_DWBW1_Pos                 (24UL)                    /*!< DWBW1 (Bit 24)                                        */
#define DAC_CTL_DWBW1_Msk                 (0xf000000UL)             /*!< DWBW1 (Bitfield-Mask: 0x0f)                           */
#define DAC_CTL_DDMAEN1_Pos               (28UL)                    /*!< DDMAEN1 (Bit 28)                                      */
#define DAC_CTL_DDMAEN1_Msk               (0x10000000UL)            /*!< DDMAEN1 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  SWT  ========================================================== */
#define DAC_SWT_SWTR0_Pos                 (0UL)                     /*!< SWTR0 (Bit 0)                                         */
#define DAC_SWT_SWTR0_Msk                 (0x1UL)                   /*!< SWTR0 (Bitfield-Mask: 0x01)                           */
#define DAC_SWT_SWTR1_Pos                 (1UL)                     /*!< SWTR1 (Bit 1)                                         */
#define DAC_SWT_SWTR1_Msk                 (0x2UL)                   /*!< SWTR1 (Bitfield-Mask: 0x01)                           */
/* ======================================================  DAC0_R12DH  ======================================================= */
#define DAC_DAC0_R12DH_DAC0_DH_Pos        (0UL)                     /*!< DAC0_DH (Bit 0)                                       */
#define DAC_DAC0_R12DH_DAC0_DH_Msk        (0xfffUL)                 /*!< DAC0_DH (Bitfield-Mask: 0xfff)                        */
/* ======================================================  DAC0_L12DH  ======================================================= */
#define DAC_DAC0_L12DH_DAC0_DH_Pos        (4UL)                     /*!< DAC0_DH (Bit 4)                                       */
#define DAC_DAC0_L12DH_DAC0_DH_Msk        (0xfff0UL)                /*!< DAC0_DH (Bitfield-Mask: 0xfff)                        */
/* =======================================================  DAC0_R8DH  ======================================================= */
#define DAC_DAC0_R8DH_DAC0_DH_Pos         (0UL)                     /*!< DAC0_DH (Bit 0)                                       */
#define DAC_DAC0_R8DH_DAC0_DH_Msk         (0xffUL)                  /*!< DAC0_DH (Bitfield-Mask: 0xff)                         */
/* ======================================================  DAC1_R12DH  ======================================================= */
#define DAC_DAC1_R12DH_DAC1_DH_Pos        (0UL)                     /*!< DAC1_DH (Bit 0)                                       */
#define DAC_DAC1_R12DH_DAC1_DH_Msk        (0xfffUL)                 /*!< DAC1_DH (Bitfield-Mask: 0xfff)                        */
/* ======================================================  DAC1_L12DH  ======================================================= */
#define DAC_DAC1_L12DH_DAC1_DH_Pos        (4UL)                     /*!< DAC1_DH (Bit 4)                                       */
#define DAC_DAC1_L12DH_DAC1_DH_Msk        (0xfff0UL)                /*!< DAC1_DH (Bitfield-Mask: 0xfff)                        */
/* =======================================================  DAC1_R8DH  ======================================================= */
#define DAC_DAC1_R8DH_DAC1_DH_Pos         (0UL)                     /*!< DAC1_DH (Bit 0)                                       */
#define DAC_DAC1_R8DH_DAC1_DH_Msk         (0xffUL)                  /*!< DAC1_DH (Bitfield-Mask: 0xff)                         */
/* ======================================================  DACC_R12DH  ======================================================= */
#define DAC_DACC_R12DH_DAC0_DH_Pos        (0UL)                     /*!< DAC0_DH (Bit 0)                                       */
#define DAC_DACC_R12DH_DAC0_DH_Msk        (0xfffUL)                 /*!< DAC0_DH (Bitfield-Mask: 0xfff)                        */
#define DAC_DACC_R12DH_DAC1_DH_Pos        (16UL)                    /*!< DAC1_DH (Bit 16)                                      */
#define DAC_DACC_R12DH_DAC1_DH_Msk        (0xfff0000UL)             /*!< DAC1_DH (Bitfield-Mask: 0xfff)                        */
/* ======================================================  DACC_L12DH  ======================================================= */
#define DAC_DACC_L12DH_DAC0_DH_Pos        (4UL)                     /*!< DAC0_DH (Bit 4)                                       */
#define DAC_DACC_L12DH_DAC0_DH_Msk        (0xfff0UL)                /*!< DAC0_DH (Bitfield-Mask: 0xfff)                        */
#define DAC_DACC_L12DH_DAC1_DH_Pos        (20UL)                    /*!< DAC1_DH (Bit 20)                                      */
#define DAC_DACC_L12DH_DAC1_DH_Msk        (0xfff00000UL)            /*!< DAC1_DH (Bitfield-Mask: 0xfff)                        */
/* =======================================================  DACC_R8DH  ======================================================= */
#define DAC_DACC_R8DH_DAC0_DH_Pos         (0UL)                     /*!< DAC0_DH (Bit 0)                                       */
#define DAC_DACC_R8DH_DAC0_DH_Msk         (0xffUL)                  /*!< DAC0_DH (Bitfield-Mask: 0xff)                         */
#define DAC_DACC_R8DH_DAC1_DH_Pos         (8UL)                     /*!< DAC1_DH (Bit 8)                                       */
#define DAC_DACC_R8DH_DAC1_DH_Msk         (0xff00UL)                /*!< DAC1_DH (Bitfield-Mask: 0xff)                         */
/* ========================================================  DAC0_DO  ======================================================== */
#define DAC_DAC0_DO_DAC0_DO_Pos           (0UL)                     /*!< DAC0_DO (Bit 0)                                       */
#define DAC_DAC0_DO_DAC0_DO_Msk           (0xfffUL)                 /*!< DAC0_DO (Bitfield-Mask: 0xfff)                        */
/* ========================================================  DAC1_DO  ======================================================== */
#define DAC_DAC1_DO_DAC1_DO_Pos           (0UL)                     /*!< DAC1_DO (Bit 0)                                       */
#define DAC_DAC1_DO_DAC1_DO_Msk           (0xfffUL)                 /*!< DAC1_DO (Bitfield-Mask: 0xfff)                        */


/* =========================================================================================================================== */
/* ================                                            DBG                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  ID  =========================================================== */
#define DBG_ID_ID_CODE_Pos                (0UL)                     /*!< ID_CODE (Bit 0)                                       */
#define DBG_ID_ID_CODE_Msk                (0xffffffffUL)            /*!< ID_CODE (Bitfield-Mask: 0xffffffff)                   */
/* ==========================================================  CTL  ========================================================== */
#define DBG_CTL_SLP_HOLD_Pos              (0UL)                     /*!< SLP_HOLD (Bit 0)                                      */
#define DBG_CTL_SLP_HOLD_Msk              (0x1UL)                   /*!< SLP_HOLD (Bitfield-Mask: 0x01)                        */
#define DBG_CTL_DSLP_HOLD_Pos             (1UL)                     /*!< DSLP_HOLD (Bit 1)                                     */
#define DBG_CTL_DSLP_HOLD_Msk             (0x2UL)                   /*!< DSLP_HOLD (Bitfield-Mask: 0x01)                       */
#define DBG_CTL_STB_HOLD_Pos              (2UL)                     /*!< STB_HOLD (Bit 2)                                      */
#define DBG_CTL_STB_HOLD_Msk              (0x4UL)                   /*!< STB_HOLD (Bitfield-Mask: 0x01)                        */
#define DBG_CTL_FWDGT_HOLD_Pos            (8UL)                     /*!< FWDGT_HOLD (Bit 8)                                    */
#define DBG_CTL_FWDGT_HOLD_Msk            (0x100UL)                 /*!< FWDGT_HOLD (Bitfield-Mask: 0x01)                      */
#define DBG_CTL_WWDGT_HOLD_Pos            (9UL)                     /*!< WWDGT_HOLD (Bit 9)                                    */
#define DBG_CTL_WWDGT_HOLD_Msk            (0x200UL)                 /*!< WWDGT_HOLD (Bitfield-Mask: 0x01)                      */
#define DBG_CTL_TIMER0_HOLD_Pos           (10UL)                    /*!< TIMER0_HOLD (Bit 10)                                  */
#define DBG_CTL_TIMER0_HOLD_Msk           (0x400UL)                 /*!< TIMER0_HOLD (Bitfield-Mask: 0x01)                     */
#define DBG_CTL_TIMER1_HOLD_Pos           (11UL)                    /*!< TIMER1_HOLD (Bit 11)                                  */
#define DBG_CTL_TIMER1_HOLD_Msk           (0x800UL)                 /*!< TIMER1_HOLD (Bitfield-Mask: 0x01)                     */
#define DBG_CTL_TIMER2_HOLD_Pos           (12UL)                    /*!< TIMER2_HOLD (Bit 12)                                  */
#define DBG_CTL_TIMER2_HOLD_Msk           (0x1000UL)                /*!< TIMER2_HOLD (Bitfield-Mask: 0x01)                     */
#define DBG_CTL_TIMER3_HOLD_Pos           (13UL)                    /*!< TIMER3_HOLD (Bit 13)                                  */
#define DBG_CTL_TIMER3_HOLD_Msk           (0x2000UL)                /*!< TIMER3_HOLD (Bitfield-Mask: 0x01)                     */
#define DBG_CTL_CAN0_HOLD_Pos             (14UL)                    /*!< CAN0_HOLD (Bit 14)                                    */
#define DBG_CTL_CAN0_HOLD_Msk             (0x4000UL)                /*!< CAN0_HOLD (Bitfield-Mask: 0x01)                       */
#define DBG_CTL_I2C0_HOLD_Pos             (15UL)                    /*!< I2C0_HOLD (Bit 15)                                    */
#define DBG_CTL_I2C0_HOLD_Msk             (0x8000UL)                /*!< I2C0_HOLD (Bitfield-Mask: 0x01)                       */
#define DBG_CTL_I2C1_HOLD_Pos             (16UL)                    /*!< I2C1_HOLD (Bit 16)                                    */
#define DBG_CTL_I2C1_HOLD_Msk             (0x10000UL)               /*!< I2C1_HOLD (Bitfield-Mask: 0x01)                       */
#define DBG_CTL_TIMER4_HOLD_Pos           (18UL)                    /*!< TIMER4_HOLD (Bit 18)                                  */
#define DBG_CTL_TIMER4_HOLD_Msk           (0x40000UL)               /*!< TIMER4_HOLD (Bitfield-Mask: 0x01)                     */
#define DBG_CTL_TIMER5_HOLD_Pos           (19UL)                    /*!< TIMER5_HOLD (Bit 19)                                  */
#define DBG_CTL_TIMER5_HOLD_Msk           (0x80000UL)               /*!< TIMER5_HOLD (Bitfield-Mask: 0x01)                     */
#define DBG_CTL_TIMER6_HOLD_Pos           (20UL)                    /*!< TIMER6_HOLD (Bit 20)                                  */
#define DBG_CTL_TIMER6_HOLD_Msk           (0x100000UL)              /*!< TIMER6_HOLD (Bitfield-Mask: 0x01)                     */
#define DBG_CTL_CAN1_HOLD_Pos             (21UL)                    /*!< CAN1_HOLD (Bit 21)                                    */
#define DBG_CTL_CAN1_HOLD_Msk             (0x200000UL)              /*!< CAN1_HOLD (Bitfield-Mask: 0x01)                       */


/* =========================================================================================================================== */
/* ================                                           DMA0                                            ================ */
/* =========================================================================================================================== */

