RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define DMA0_CH2CTL_CHEN_Msk              (0x1UL)                   /*!< CHEN (Bitfield-Mask: 0x01)                            */
#define DMA0_CH2CTL_FTFIE_Pos             (1UL)                     /*!< FTFIE (Bit 1)                                         */
#define DMA0_CH2CTL_FTFIE_Msk             (0x2UL)                   /*!< FTFIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH2CTL_HTFIE_Pos             (2UL)                     /*!< HTFIE (Bit 2)                                         */
#define DMA0_CH2CTL_HTFIE_Msk             (0x4UL)                   /*!< HTFIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH2CTL_ERRIE_Pos             (3UL)                     /*!< ERRIE (Bit 3)                                         */
#define DMA0_CH2CTL_ERRIE_Msk             (0x8UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH2CTL_DIR_Pos               (4UL)                     /*!< DIR (Bit 4)                                           */
#define DMA0_CH2CTL_DIR_Msk               (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define DMA0_CH2CTL_CMEN_Pos              (5UL)                     /*!< CMEN (Bit 5)                                          */
#define DMA0_CH2CTL_CMEN_Msk              (0x20UL)                  /*!< CMEN (Bitfield-Mask: 0x01)                            */
#define DMA0_CH2CTL_PNAGA_Pos             (6UL)                     /*!< PNAGA (Bit 6)                                         */
#define DMA0_CH2CTL_PNAGA_Msk             (0x40UL)                  /*!< PNAGA (Bitfield-Mask: 0x01)                           */
#define DMA0_CH2CTL_MNAGA_Pos             (7UL)                     /*!< MNAGA (Bit 7)                                         */
#define DMA0_CH2CTL_MNAGA_Msk             (0x80UL)                  /*!< MNAGA (Bitfield-Mask: 0x01)                           */
#define DMA0_CH2CTL_PWIDTH_Pos            (8UL)                     /*!< PWIDTH (Bit 8)                                        */
#define DMA0_CH2CTL_PWIDTH_Msk            (0x300UL)                 /*!< PWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA0_CH2CTL_MWIDTH_Pos            (10UL)                    /*!< MWIDTH (Bit 10)                                       */
#define DMA0_CH2CTL_MWIDTH_Msk            (0xc00UL)                 /*!< MWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA0_CH2CTL_PRIO_Pos              (12UL)                    /*!< PRIO (Bit 12)                                         */
#define DMA0_CH2CTL_PRIO_Msk              (0x3000UL)                /*!< PRIO (Bitfield-Mask: 0x03)                            */
#define DMA0_CH2CTL_M2M_Pos               (14UL)                    /*!< M2M (Bit 14)                                          */
#define DMA0_CH2CTL_M2M_Msk               (0x4000UL)                /*!< M2M (Bitfield-Mask: 0x01)                             */
/* ========================================================  CH2CNT  ========================================================= */
#define DMA0_CH2CNT_CNT_Pos               (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA0_CH2CNT_CNT_Msk               (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CH2PADDR  ======================================================== */
#define DMA0_CH2PADDR_PADDR_Pos           (0UL)                     /*!< PADDR (Bit 0)                                         */
#define DMA0_CH2PADDR_PADDR_Msk           (0xffffffffUL)            /*!< PADDR (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CH2MADDR  ======================================================== */
#define DMA0_CH2MADDR_MADDR_Pos           (0UL)                     /*!< MADDR (Bit 0)                                         */
#define DMA0_CH2MADDR_MADDR_Msk           (0xffffffffUL)            /*!< MADDR (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CH3CTL  ========================================================= */
#define DMA0_CH3CTL_CHEN_Pos              (0UL)                     /*!< CHEN (Bit 0)                                          */
#define DMA0_CH3CTL_CHEN_Msk              (0x1UL)                   /*!< CHEN (Bitfield-Mask: 0x01)                            */
#define DMA0_CH3CTL_FTFIE_Pos             (1UL)                     /*!< FTFIE (Bit 1)                                         */
#define DMA0_CH3CTL_FTFIE_Msk             (0x2UL)                   /*!< FTFIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH3CTL_HTFIE_Pos             (2UL)                     /*!< HTFIE (Bit 2)                                         */
#define DMA0_CH3CTL_HTFIE_Msk             (0x4UL)                   /*!< HTFIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH3CTL_ERRIE_Pos             (3UL)                     /*!< ERRIE (Bit 3)                                         */
#define DMA0_CH3CTL_ERRIE_Msk             (0x8UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH3CTL_DIR_Pos               (4UL)                     /*!< DIR (Bit 4)                                           */
#define DMA0_CH3CTL_DIR_Msk               (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define DMA0_CH3CTL_CMEN_Pos              (5UL)                     /*!< CMEN (Bit 5)                                          */
#define DMA0_CH3CTL_CMEN_Msk              (0x20UL)                  /*!< CMEN (Bitfield-Mask: 0x01)                            */
#define DMA0_CH3CTL_PNAGA_Pos             (6UL)                     /*!< PNAGA (Bit 6)                                         */
#define DMA0_CH3CTL_PNAGA_Msk             (0x40UL)                  /*!< PNAGA (Bitfield-Mask: 0x01)                           */
#define DMA0_CH3CTL_MNAGA_Pos             (7UL)                     /*!< MNAGA (Bit 7)                                         */
#define DMA0_CH3CTL_MNAGA_Msk             (0x80UL)                  /*!< MNAGA (Bitfield-Mask: 0x01)                           */
#define DMA0_CH3CTL_PWIDTH_Pos            (8UL)                     /*!< PWIDTH (Bit 8)                                        */
#define DMA0_CH3CTL_PWIDTH_Msk            (0x300UL)                 /*!< PWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA0_CH3CTL_MWIDTH_Pos            (10UL)                    /*!< MWIDTH (Bit 10)                                       */
#define DMA0_CH3CTL_MWIDTH_Msk            (0xc00UL)                 /*!< MWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA0_CH3CTL_PRIO_Pos              (12UL)                    /*!< PRIO (Bit 12)                                         */
#define DMA0_CH3CTL_PRIO_Msk              (0x3000UL)                /*!< PRIO (Bitfield-Mask: 0x03)                            */
#define DMA0_CH3CTL_M2M_Pos               (14UL)                    /*!< M2M (Bit 14)                                          */
#define DMA0_CH3CTL_M2M_Msk               (0x4000UL)                /*!< M2M (Bitfield-Mask: 0x01)                             */
/* ========================================================  CH3CNT  ========================================================= */
#define DMA0_CH3CNT_CNT_Pos               (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA0_CH3CNT_CNT_Msk               (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CH3PADDR  ======================================================== */
#define DMA0_CH3PADDR_PADDR_Pos           (0UL)                     /*!< PADDR (Bit 0)                                         */
#define DMA0_CH3PADDR_PADDR_Msk           (0xffffffffUL)            /*!< PADDR (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CH3MADDR  ======================================================== */
#define DMA0_CH3MADDR_MADDR_Pos           (0UL)                     /*!< MADDR (Bit 0)                                         */
#define DMA0_CH3MADDR_MADDR_Msk           (0xffffffffUL)            /*!< MADDR (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CH4CTL  ========================================================= */
#define DMA0_CH4CTL_CHEN_Pos              (0UL)                     /*!< CHEN (Bit 0)                                          */
#define DMA0_CH4CTL_CHEN_Msk              (0x1UL)                   /*!< CHEN (Bitfield-Mask: 0x01)                            */
#define DMA0_CH4CTL_FTFIE_Pos             (1UL)                     /*!< FTFIE (Bit 1)                                         */
#define DMA0_CH4CTL_FTFIE_Msk             (0x2UL)                   /*!< FTFIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH4CTL_HTFIE_Pos             (2UL)                     /*!< HTFIE (Bit 2)                                         */
#define DMA0_CH4CTL_HTFIE_Msk             (0x4UL)                   /*!< HTFIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH4CTL_ERRIE_Pos             (3UL)                     /*!< ERRIE (Bit 3)                                         */
#define DMA0_CH4CTL_ERRIE_Msk             (0x8UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH4CTL_DIR_Pos               (4UL)                     /*!< DIR (Bit 4)                                           */
#define DMA0_CH4CTL_DIR_Msk               (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define DMA0_CH4CTL_CMEN_Pos              (5UL)                     /*!< CMEN (Bit 5)                                          */
#define DMA0_CH4CTL_CMEN_Msk              (0x20UL)                  /*!< CMEN (Bitfield-Mask: 0x01)                            */
#define DMA0_CH4CTL_PNAGA_Pos             (6UL)                     /*!< PNAGA (Bit 6)                                         */
#define DMA0_CH4CTL_PNAGA_Msk             (0x40UL)                  /*!< PNAGA (Bitfield-Mask: 0x01)                           */
#define DMA0_CH4CTL_MNAGA_Pos             (7UL)                     /*!< MNAGA (Bit 7)                                         */
#define DMA0_CH4CTL_MNAGA_Msk             (0x80UL)                  /*!< MNAGA (Bitfield-Mask: 0x01)                           */
#define DMA0_CH4CTL_PWIDTH_Pos            (8UL)                     /*!< PWIDTH (Bit 8)                                        */
#define DMA0_CH4CTL_PWIDTH_Msk            (0x300UL)                 /*!< PWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA0_CH4CTL_MWIDTH_Pos            (10UL)                    /*!< MWIDTH (Bit 10)                                       */
#define DMA0_CH4CTL_MWIDTH_Msk            (0xc00UL)                 /*!< MWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA0_CH4CTL_PRIO_Pos              (12UL)                    /*!< PRIO (Bit 12)                                         */
#define DMA0_CH4CTL_PRIO_Msk              (0x3000UL)                /*!< PRIO (Bitfield-Mask: 0x03)                            */
#define DMA0_CH4CTL_M2M_Pos               (14UL)                    /*!< M2M (Bit 14)                                          */
#define DMA0_CH4CTL_M2M_Msk               (0x4000UL)                /*!< M2M (Bitfield-Mask: 0x01)                             */
/* ========================================================  CH4CNT  ========================================================= */
#define DMA0_CH4CNT_CNT_Pos               (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA0_CH4CNT_CNT_Msk               (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CH4PADDR  ======================================================== */
#define DMA0_CH4PADDR_PADDR_Pos           (0UL)                     /*!< PADDR (Bit 0)                                         */
#define DMA0_CH4PADDR_PADDR_Msk           (0xffffffffUL)            /*!< PADDR (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CH4MADDR  ======================================================== */
#define DMA0_CH4MADDR_MADDR_Pos           (0UL)                     /*!< MADDR (Bit 0)                                         */
#define DMA0_CH4MADDR_MADDR_Msk           (0xffffffffUL)            /*!< MADDR (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CH5CTL  ========================================================= */
#define DMA0_CH5CTL_CHEN_Pos              (0UL)                     /*!< CHEN (Bit 0)                                          */
#define DMA0_CH5CTL_CHEN_Msk              (0x1UL)                   /*!< CHEN (Bitfield-Mask: 0x01)                            */
#define DMA0_CH5CTL_FTFIE_Pos             (1UL)                     /*!< FTFIE (Bit 1)                                         */
#define DMA0_CH5CTL_FTFIE_Msk             (0x2UL)                   /*!< FTFIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH5CTL_HTFIE_Pos             (2UL)                     /*!< HTFIE (Bit 2)                                         */
#define DMA0_CH5CTL_HTFIE_Msk             (0x4UL)                   /*!< HTFIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH5CTL_ERRIE_Pos             (3UL)                     /*!< ERRIE (Bit 3)                                         */
#define DMA0_CH5CTL_ERRIE_Msk             (0x8UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH5CTL_DIR_Pos               (4UL)                     /*!< DIR (Bit 4)                                           */
#define DMA0_CH5CTL_DIR_Msk               (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define DMA0_CH5CTL_CMEN_Pos              (5UL)                     /*!< CMEN (Bit 5)                                          */
#define DMA0_CH5CTL_CMEN_Msk              (0x20UL)                  /*!< CMEN (Bitfield-Mask: 0x01)                            */
#define DMA0_CH5CTL_PNAGA_Pos             (6UL)                     /*!< PNAGA (Bit 6)                                         */
#define DMA0_CH5CTL_PNAGA_Msk             (0x40UL)                  /*!< PNAGA (Bitfield-Mask: 0x01)                           */
#define DMA0_CH5CTL_MNAGA_Pos             (7UL)                     /*!< MNAGA (Bit 7)                                         */
#define DMA0_CH5CTL_MNAGA_Msk             (0x80UL)                  /*!< MNAGA (Bitfield-Mask: 0x01)                           */
#define DMA0_CH5CTL_PWIDTH_Pos            (8UL)                     /*!< PWIDTH (Bit 8)                                        */
#define DMA0_CH5CTL_PWIDTH_Msk            (0x300UL)                 /*!< PWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA0_CH5CTL_MWIDTH_Pos            (10UL)                    /*!< MWIDTH (Bit 10)                                       */
#define DMA0_CH5CTL_MWIDTH_Msk            (0xc00UL)                 /*!< MWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA0_CH5CTL_PRIO_Pos              (12UL)                    /*!< PRIO (Bit 12)                                         */
#define DMA0_CH5CTL_PRIO_Msk              (0x3000UL)                /*!< PRIO (Bitfield-Mask: 0x03)                            */
#define DMA0_CH5CTL_M2M_Pos               (14UL)                    /*!< M2M (Bit 14)                                          */
#define DMA0_CH5CTL_M2M_Msk               (0x4000UL)                /*!< M2M (Bitfield-Mask: 0x01)                             */
/* ========================================================  CH5CNT  ========================================================= */
#define DMA0_CH5CNT_CNT_Pos               (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA0_CH5CNT_CNT_Msk               (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CH5PADDR  ======================================================== */
#define DMA0_CH5PADDR_PADDR_Pos           (0UL)                     /*!< PADDR (Bit 0)                                         */
#define DMA0_CH5PADDR_PADDR_Msk           (0xffffffffUL)            /*!< PADDR (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CH5MADDR  ======================================================== */
#define DMA0_CH5MADDR_MADDR_Pos           (0UL)                     /*!< MADDR (Bit 0)                                         */
#define DMA0_CH5MADDR_MADDR_Msk           (0xffffffffUL)            /*!< MADDR (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CH6CTL  ========================================================= */
#define DMA0_CH6CTL_CHEN_Pos              (0UL)                     /*!< CHEN (Bit 0)                                          */
#define DMA0_CH6CTL_CHEN_Msk              (0x1UL)                   /*!< CHEN (Bitfield-Mask: 0x01)                            */
#define DMA0_CH6CTL_FTFIE_Pos             (1UL)                     /*!< FTFIE (Bit 1)                                         */
#define DMA0_CH6CTL_FTFIE_Msk             (0x2UL)                   /*!< FTFIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH6CTL_HTFIE_Pos             (2UL)                     /*!< HTFIE (Bit 2)                                         */
#define DMA0_CH6CTL_HTFIE_Msk             (0x4UL)                   /*!< HTFIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH6CTL_ERRIE_Pos             (3UL)                     /*!< ERRIE (Bit 3)                                         */
#define DMA0_CH6CTL_ERRIE_Msk             (0x8UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define DMA0_CH6CTL_DIR_Pos               (4UL)                     /*!< DIR (Bit 4)                                           */
#define DMA0_CH6CTL_DIR_Msk               (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define DMA0_CH6CTL_CMEN_Pos              (5UL)                     /*!< CMEN (Bit 5)                                          */
#define DMA0_CH6CTL_CMEN_Msk              (0x20UL)                  /*!< CMEN (Bitfield-Mask: 0x01)                            */
#define DMA0_CH6CTL_PNAGA_Pos             (6UL)                     /*!< PNAGA (Bit 6)                                         */
#define DMA0_CH6CTL_PNAGA_Msk             (0x40UL)                  /*!< PNAGA (Bitfield-Mask: 0x01)                           */
#define DMA0_CH6CTL_MNAGA_Pos             (7UL)                     /*!< MNAGA (Bit 7)                                         */
#define DMA0_CH6CTL_MNAGA_Msk             (0x80UL)                  /*!< MNAGA (Bitfield-Mask: 0x01)                           */
#define DMA0_CH6CTL_PWIDTH_Pos            (8UL)                     /*!< PWIDTH (Bit 8)                                        */
#define DMA0_CH6CTL_PWIDTH_Msk            (0x300UL)                 /*!< PWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA0_CH6CTL_MWIDTH_Pos            (10UL)                    /*!< MWIDTH (Bit 10)                                       */
#define DMA0_CH6CTL_MWIDTH_Msk            (0xc00UL)                 /*!< MWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA0_CH6CTL_PRIO_Pos              (12UL)                    /*!< PRIO (Bit 12)                                         */
#define DMA0_CH6CTL_PRIO_Msk              (0x3000UL)                /*!< PRIO (Bitfield-Mask: 0x03)                            */
#define DMA0_CH6CTL_M2M_Pos               (14UL)                    /*!< M2M (Bit 14)                                          */
#define DMA0_CH6CTL_M2M_Msk               (0x4000UL)                /*!< M2M (Bitfield-Mask: 0x01)                             */
/* ========================================================  CH6CNT  ========================================================= */
#define DMA0_CH6CNT_CNT_Pos               (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA0_CH6CNT_CNT_Msk               (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CH6PADDR  ======================================================== */
#define DMA0_CH6PADDR_PADDR_Pos           (0UL)                     /*!< PADDR (Bit 0)                                         */
#define DMA0_CH6PADDR_PADDR_Msk           (0xffffffffUL)            /*!< PADDR (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CH6MADDR  ======================================================== */
#define DMA0_CH6MADDR_MADDR_Pos           (0UL)                     /*!< MADDR (Bit 0)                                         */
#define DMA0_CH6MADDR_MADDR_Msk           (0xffffffffUL)            /*!< MADDR (Bitfield-Mask: 0xffffffff)                     */


/* =========================================================================================================================== */
/* ================                                           DMA1                                            ================ */
/* =========================================================================================================================== */

