RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* ========================================================  CH3CTL  ========================================================= */
#define DMA1_CH3CTL_CHEN_Pos              (0UL)                     /*!< CHEN (Bit 0)                                          */
#define DMA1_CH3CTL_CHEN_Msk              (0x1UL)                   /*!< CHEN (Bitfield-Mask: 0x01)                            */
#define DMA1_CH3CTL_FTFIE_Pos             (1UL)                     /*!< FTFIE (Bit 1)                                         */
#define DMA1_CH3CTL_FTFIE_Msk             (0x2UL)                   /*!< FTFIE (Bitfield-Mask: 0x01)                           */
#define DMA1_CH3CTL_HTFIE_Pos             (2UL)                     /*!< HTFIE (Bit 2)                                         */
#define DMA1_CH3CTL_HTFIE_Msk             (0x4UL)                   /*!< HTFIE (Bitfield-Mask: 0x01)                           */
#define DMA1_CH3CTL_ERRIE_Pos             (3UL)                     /*!< ERRIE (Bit 3)                                         */
#define DMA1_CH3CTL_ERRIE_Msk             (0x8UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define DMA1_CH3CTL_DIR_Pos               (4UL)                     /*!< DIR (Bit 4)                                           */
#define DMA1_CH3CTL_DIR_Msk               (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define DMA1_CH3CTL_CMEN_Pos              (5UL)                     /*!< CMEN (Bit 5)                                          */
#define DMA1_CH3CTL_CMEN_Msk              (0x20UL)                  /*!< CMEN (Bitfield-Mask: 0x01)                            */
#define DMA1_CH3CTL_PNAGA_Pos             (6UL)                     /*!< PNAGA (Bit 6)                                         */
#define DMA1_CH3CTL_PNAGA_Msk             (0x40UL)                  /*!< PNAGA (Bitfield-Mask: 0x01)                           */
#define DMA1_CH3CTL_MNAGA_Pos             (7UL)                     /*!< MNAGA (Bit 7)                                         */
#define DMA1_CH3CTL_MNAGA_Msk             (0x80UL)                  /*!< MNAGA (Bitfield-Mask: 0x01)                           */
#define DMA1_CH3CTL_PWIDTH_Pos            (8UL)                     /*!< PWIDTH (Bit 8)                                        */
#define DMA1_CH3CTL_PWIDTH_Msk            (0x300UL)                 /*!< PWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA1_CH3CTL_MWIDTH_Pos            (10UL)                    /*!< MWIDTH (Bit 10)                                       */
#define DMA1_CH3CTL_MWIDTH_Msk            (0xc00UL)                 /*!< MWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA1_CH3CTL_PRIO_Pos              (12UL)                    /*!< PRIO (Bit 12)                                         */
#define DMA1_CH3CTL_PRIO_Msk              (0x3000UL)                /*!< PRIO (Bitfield-Mask: 0x03)                            */
#define DMA1_CH3CTL_M2M_Pos               (14UL)                    /*!< M2M (Bit 14)                                          */
#define DMA1_CH3CTL_M2M_Msk               (0x4000UL)                /*!< M2M (Bitfield-Mask: 0x01)                             */
/* ========================================================  CH3CNT  ========================================================= */
#define DMA1_CH3CNT_CNT_Pos               (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA1_CH3CNT_CNT_Msk               (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CH3PADDR  ======================================================== */
#define DMA1_CH3PADDR_PADDR_Pos           (0UL)                     /*!< PADDR (Bit 0)                                         */
#define DMA1_CH3PADDR_PADDR_Msk           (0xffffffffUL)            /*!< PADDR (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CH3MADDR  ======================================================== */
#define DMA1_CH3MADDR_MADDR_Pos           (0UL)                     /*!< MADDR (Bit 0)                                         */
#define DMA1_CH3MADDR_MADDR_Msk           (0xffffffffUL)            /*!< MADDR (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CH4CTL  ========================================================= */
#define DMA1_CH4CTL_CHEN_Pos              (0UL)                     /*!< CHEN (Bit 0)                                          */
#define DMA1_CH4CTL_CHEN_Msk              (0x1UL)                   /*!< CHEN (Bitfield-Mask: 0x01)                            */
#define DMA1_CH4CTL_FTFIE_Pos             (1UL)                     /*!< FTFIE (Bit 1)                                         */
#define DMA1_CH4CTL_FTFIE_Msk             (0x2UL)                   /*!< FTFIE (Bitfield-Mask: 0x01)                           */
#define DMA1_CH4CTL_HTFIE_Pos             (2UL)                     /*!< HTFIE (Bit 2)                                         */
#define DMA1_CH4CTL_HTFIE_Msk             (0x4UL)                   /*!< HTFIE (Bitfield-Mask: 0x01)                           */
#define DMA1_CH4CTL_ERRIE_Pos             (3UL)                     /*!< ERRIE (Bit 3)                                         */
#define DMA1_CH4CTL_ERRIE_Msk             (0x8UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define DMA1_CH4CTL_DIR_Pos               (4UL)                     /*!< DIR (Bit 4)                                           */
#define DMA1_CH4CTL_DIR_Msk               (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define DMA1_CH4CTL_CMEN_Pos              (5UL)                     /*!< CMEN (Bit 5)                                          */
#define DMA1_CH4CTL_CMEN_Msk              (0x20UL)                  /*!< CMEN (Bitfield-Mask: 0x01)                            */
#define DMA1_CH4CTL_PNAGA_Pos             (6UL)                     /*!< PNAGA (Bit 6)                                         */
#define DMA1_CH4CTL_PNAGA_Msk             (0x40UL)                  /*!< PNAGA (Bitfield-Mask: 0x01)                           */
#define DMA1_CH4CTL_MNAGA_Pos             (7UL)                     /*!< MNAGA (Bit 7)                                         */
#define DMA1_CH4CTL_MNAGA_Msk             (0x80UL)                  /*!< MNAGA (Bitfield-Mask: 0x01)                           */
#define DMA1_CH4CTL_PWIDTH_Pos            (8UL)                     /*!< PWIDTH (Bit 8)                                        */
#define DMA1_CH4CTL_PWIDTH_Msk            (0x300UL)                 /*!< PWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA1_CH4CTL_MWIDTH_Pos            (10UL)                    /*!< MWIDTH (Bit 10)                                       */
#define DMA1_CH4CTL_MWIDTH_Msk            (0xc00UL)                 /*!< MWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA1_CH4CTL_PRIO_Pos              (12UL)                    /*!< PRIO (Bit 12)                                         */
#define DMA1_CH4CTL_PRIO_Msk              (0x3000UL)                /*!< PRIO (Bitfield-Mask: 0x03)                            */
#define DMA1_CH4CTL_M2M_Pos               (14UL)                    /*!< M2M (Bit 14)                                          */
#define DMA1_CH4CTL_M2M_Msk               (0x4000UL)                /*!< M2M (Bitfield-Mask: 0x01)                             */
/* ========================================================  CH4CNT  ========================================================= */
#define DMA1_CH4CNT_CNT_Pos               (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA1_CH4CNT_CNT_Msk               (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CH4PADDR  ======================================================== */
#define DMA1_CH4PADDR_PADDR_Pos           (0UL)                     /*!< PADDR (Bit 0)                                         */
#define DMA1_CH4PADDR_PADDR_Msk           (0xffffffffUL)            /*!< PADDR (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CH4MADDR  ======================================================== */
#define DMA1_CH4MADDR_MADDR_Pos           (0UL)                     /*!< MADDR (Bit 0)                                         */
#define DMA1_CH4MADDR_MADDR_Msk           (0xffffffffUL)            /*!< MADDR (Bitfield-Mask: 0xffffffff)                     */


/* =========================================================================================================================== */
/* ================                                           EXMC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  SNCTL0  ========================================================= */
#define EXMC_SNCTL0_ASYNCWAIT_Pos         (15UL)                    /*!< ASYNCWAIT (Bit 15)                                    */
#define EXMC_SNCTL0_ASYNCWAIT_Msk         (0x8000UL)                /*!< ASYNCWAIT (Bitfield-Mask: 0x01)                       */
#define EXMC_SNCTL0_NRWTEN_Pos            (13UL)                    /*!< NRWTEN (Bit 13)                                       */
#define EXMC_SNCTL0_NRWTEN_Msk            (0x2000UL)                /*!< NRWTEN (Bitfield-Mask: 0x01)                          */
#define EXMC_SNCTL0_WREN_Pos              (12UL)                    /*!< WREN (Bit 12)                                         */
#define EXMC_SNCTL0_WREN_Msk              (0x1000UL)                /*!< WREN (Bitfield-Mask: 0x01)                            */
#define EXMC_SNCTL0_NRWTPOL_Pos           (9UL)                     /*!< NRWTPOL (Bit 9)                                       */
#define EXMC_SNCTL0_NRWTPOL_Msk           (0x200UL)                 /*!< NRWTPOL (Bitfield-Mask: 0x01)                         */
#define EXMC_SNCTL0_NREN_Pos              (6UL)                     /*!< NREN (Bit 6)                                          */
#define EXMC_SNCTL0_NREN_Msk              (0x40UL)                  /*!< NREN (Bitfield-Mask: 0x01)                            */
#define EXMC_SNCTL0_NRW_Pos               (4UL)                     /*!< NRW (Bit 4)                                           */
#define EXMC_SNCTL0_NRW_Msk               (0x30UL)                  /*!< NRW (Bitfield-Mask: 0x03)                             */
#define EXMC_SNCTL0_NRTP_Pos              (2UL)                     /*!< NRTP (Bit 2)                                          */
#define EXMC_SNCTL0_NRTP_Msk              (0xcUL)                   /*!< NRTP (Bitfield-Mask: 0x03)                            */
#define EXMC_SNCTL0_NRMUX_Pos             (1UL)                     /*!< NRMUX (Bit 1)                                         */
#define EXMC_SNCTL0_NRMUX_Msk             (0x2UL)                   /*!< NRMUX (Bitfield-Mask: 0x01)                           */
#define EXMC_SNCTL0_NRBKEN_Pos            (0UL)                     /*!< NRBKEN (Bit 0)                                        */
#define EXMC_SNCTL0_NRBKEN_Msk            (0x1UL)                   /*!< NRBKEN (Bitfield-Mask: 0x01)                          */
/* ========================================================  SNTCFG0  ======================================================== */
#define EXMC_SNTCFG0_BUSLAT_Pos           (16UL)                    /*!< BUSLAT (Bit 16)                                       */
#define EXMC_SNTCFG0_BUSLAT_Msk           (0xf0000UL)               /*!< BUSLAT (Bitfield-Mask: 0x0f)                          */
#define EXMC_SNTCFG0_DSET_Pos             (8UL)                     /*!< DSET (Bit 8)                                          */
#define EXMC_SNTCFG0_DSET_Msk             (0xff00UL)                /*!< DSET (Bitfield-Mask: 0xff)                            */
#define EXMC_SNTCFG0_AHLD_Pos             (4UL)                     /*!< AHLD (Bit 4)                                          */
#define EXMC_SNTCFG0_AHLD_Msk             (0xf0UL)                  /*!< AHLD (Bitfield-Mask: 0x0f)                            */
#define EXMC_SNTCFG0_ASET_Pos             (0UL)                     /*!< ASET (Bit 0)                                          */
#define EXMC_SNTCFG0_ASET_Msk             (0xfUL)                   /*!< ASET (Bitfield-Mask: 0x0f)                            */
/* ========================================================  SNCTL1  ========================================================= */
#define EXMC_SNCTL1_ASYNCWAIT_Pos         (15UL)                    /*!< ASYNCWAIT (Bit 15)                                    */
#define EXMC_SNCTL1_ASYNCWAIT_Msk         (0x8000UL)                /*!< ASYNCWAIT (Bitfield-Mask: 0x01)                       */
#define EXMC_SNCTL1_NRWTEN_Pos            (13UL)                    /*!< NRWTEN (Bit 13)                                       */
#define EXMC_SNCTL1_NRWTEN_Msk            (0x2000UL)                /*!< NRWTEN (Bitfield-Mask: 0x01)                          */
#define EXMC_SNCTL1_WREN_Pos              (12UL)                    /*!< WREN (Bit 12)                                         */
#define EXMC_SNCTL1_WREN_Msk              (0x1000UL)                /*!< WREN (Bitfield-Mask: 0x01)                            */
#define EXMC_SNCTL1_NRWTPOL_Pos           (9UL)                     /*!< NRWTPOL (Bit 9)                                       */
#define EXMC_SNCTL1_NRWTPOL_Msk           (0x200UL)                 /*!< NRWTPOL (Bitfield-Mask: 0x01)                         */
#define EXMC_SNCTL1_NREN_Pos              (6UL)                     /*!< NREN (Bit 6)                                          */
#define EXMC_SNCTL1_NREN_Msk              (0x40UL)                  /*!< NREN (Bitfield-Mask: 0x01)                            */
#define EXMC_SNCTL1_NRW_Pos               (4UL)                     /*!< NRW (Bit 4)                                           */
#define EXMC_SNCTL1_NRW_Msk               (0x30UL)                  /*!< NRW (Bitfield-Mask: 0x03)                             */
#define EXMC_SNCTL1_NRTP_Pos              (2UL)                     /*!< NRTP (Bit 2)                                          */
#define EXMC_SNCTL1_NRTP_Msk              (0xcUL)                   /*!< NRTP (Bitfield-Mask: 0x03)                            */
#define EXMC_SNCTL1_NRMUX_Pos             (1UL)                     /*!< NRMUX (Bit 1)                                         */
#define EXMC_SNCTL1_NRMUX_Msk             (0x2UL)                   /*!< NRMUX (Bitfield-Mask: 0x01)                           */
#define EXMC_SNCTL1_NRBKEN_Pos            (0UL)                     /*!< NRBKEN (Bit 0)                                        */
#define EXMC_SNCTL1_NRBKEN_Msk            (0x1UL)                   /*!< NRBKEN (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                           EXTI                                            ================ */
/* =========================================================================================================================== */

