RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define EXTI_SWIEV_SWIEV13_Msk            (0x2000UL)                /*!< SWIEV13 (Bitfield-Mask: 0x01)                         */
#define EXTI_SWIEV_SWIEV14_Pos            (14UL)                    /*!< SWIEV14 (Bit 14)                                      */
#define EXTI_SWIEV_SWIEV14_Msk            (0x4000UL)                /*!< SWIEV14 (Bitfield-Mask: 0x01)                         */
#define EXTI_SWIEV_SWIEV15_Pos            (15UL)                    /*!< SWIEV15 (Bit 15)                                      */
#define EXTI_SWIEV_SWIEV15_Msk            (0x8000UL)                /*!< SWIEV15 (Bitfield-Mask: 0x01)                         */
#define EXTI_SWIEV_SWIEV16_Pos            (16UL)                    /*!< SWIEV16 (Bit 16)                                      */
#define EXTI_SWIEV_SWIEV16_Msk            (0x10000UL)               /*!< SWIEV16 (Bitfield-Mask: 0x01)                         */
#define EXTI_SWIEV_SWIEV17_Pos            (17UL)                    /*!< SWIEV17 (Bit 17)                                      */
#define EXTI_SWIEV_SWIEV17_Msk            (0x20000UL)               /*!< SWIEV17 (Bitfield-Mask: 0x01)                         */
#define EXTI_SWIEV_SWIEV18_Pos            (18UL)                    /*!< SWIEV18 (Bit 18)                                      */
#define EXTI_SWIEV_SWIEV18_Msk            (0x40000UL)               /*!< SWIEV18 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  PD  =========================================================== */
#define EXTI_PD_PD0_Pos                   (0UL)                     /*!< PD0 (Bit 0)                                           */
#define EXTI_PD_PD0_Msk                   (0x1UL)                   /*!< PD0 (Bitfield-Mask: 0x01)                             */
#define EXTI_PD_PD1_Pos                   (1UL)                     /*!< PD1 (Bit 1)                                           */
#define EXTI_PD_PD1_Msk                   (0x2UL)                   /*!< PD1 (Bitfield-Mask: 0x01)                             */
#define EXTI_PD_PD2_Pos                   (2UL)                     /*!< PD2 (Bit 2)                                           */
#define EXTI_PD_PD2_Msk                   (0x4UL)                   /*!< PD2 (Bitfield-Mask: 0x01)                             */
#define EXTI_PD_PD3_Pos                   (3UL)                     /*!< PD3 (Bit 3)                                           */
#define EXTI_PD_PD3_Msk                   (0x8UL)                   /*!< PD3 (Bitfield-Mask: 0x01)                             */
#define EXTI_PD_PD4_Pos                   (4UL)                     /*!< PD4 (Bit 4)                                           */
#define EXTI_PD_PD4_Msk                   (0x10UL)                  /*!< PD4 (Bitfield-Mask: 0x01)                             */
#define EXTI_PD_PD5_Pos                   (5UL)                     /*!< PD5 (Bit 5)                                           */
#define EXTI_PD_PD5_Msk                   (0x20UL)                  /*!< PD5 (Bitfield-Mask: 0x01)                             */
#define EXTI_PD_PD6_Pos                   (6UL)                     /*!< PD6 (Bit 6)                                           */
#define EXTI_PD_PD6_Msk                   (0x40UL)                  /*!< PD6 (Bitfield-Mask: 0x01)                             */
#define EXTI_PD_PD7_Pos                   (7UL)                     /*!< PD7 (Bit 7)                                           */
#define EXTI_PD_PD7_Msk                   (0x80UL)                  /*!< PD7 (Bitfield-Mask: 0x01)                             */
#define EXTI_PD_PD8_Pos                   (8UL)                     /*!< PD8 (Bit 8)                                           */
#define EXTI_PD_PD8_Msk                   (0x100UL)                 /*!< PD8 (Bitfield-Mask: 0x01)                             */
#define EXTI_PD_PD9_Pos                   (9UL)                     /*!< PD9 (Bit 9)                                           */
#define EXTI_PD_PD9_Msk                   (0x200UL)                 /*!< PD9 (Bitfield-Mask: 0x01)                             */
#define EXTI_PD_PD10_Pos                  (10UL)                    /*!< PD10 (Bit 10)                                         */
#define EXTI_PD_PD10_Msk                  (0x400UL)                 /*!< PD10 (Bitfield-Mask: 0x01)                            */
#define EXTI_PD_PD11_Pos                  (11UL)                    /*!< PD11 (Bit 11)                                         */
#define EXTI_PD_PD11_Msk                  (0x800UL)                 /*!< PD11 (Bitfield-Mask: 0x01)                            */
#define EXTI_PD_PD12_Pos                  (12UL)                    /*!< PD12 (Bit 12)                                         */
#define EXTI_PD_PD12_Msk                  (0x1000UL)                /*!< PD12 (Bitfield-Mask: 0x01)                            */
#define EXTI_PD_PD13_Pos                  (13UL)                    /*!< PD13 (Bit 13)                                         */
#define EXTI_PD_PD13_Msk                  (0x2000UL)                /*!< PD13 (Bitfield-Mask: 0x01)                            */
#define EXTI_PD_PD14_Pos                  (14UL)                    /*!< PD14 (Bit 14)                                         */
#define EXTI_PD_PD14_Msk                  (0x4000UL)                /*!< PD14 (Bitfield-Mask: 0x01)                            */
#define EXTI_PD_PD15_Pos                  (15UL)                    /*!< PD15 (Bit 15)                                         */
#define EXTI_PD_PD15_Msk                  (0x8000UL)                /*!< PD15 (Bitfield-Mask: 0x01)                            */
#define EXTI_PD_PD16_Pos                  (16UL)                    /*!< PD16 (Bit 16)                                         */
#define EXTI_PD_PD16_Msk                  (0x10000UL)               /*!< PD16 (Bitfield-Mask: 0x01)                            */
#define EXTI_PD_PD17_Pos                  (17UL)                    /*!< PD17 (Bit 17)                                         */
#define EXTI_PD_PD17_Msk                  (0x20000UL)               /*!< PD17 (Bitfield-Mask: 0x01)                            */
#define EXTI_PD_PD18_Pos                  (18UL)                    /*!< PD18 (Bit 18)                                         */
#define EXTI_PD_PD18_Msk                  (0x40000UL)               /*!< PD18 (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                            FMC                                            ================ */
/* =========================================================================================================================== */

