RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* ==========================================================  WS  =========================================================== */
#define FMC_WS_WSCNT_Pos                  (0UL)                     /*!< WSCNT (Bit 0)                                         */
#define FMC_WS_WSCNT_Msk                  (0x7UL)                   /*!< WSCNT (Bitfield-Mask: 0x07)                           */
/* =========================================================  KEY0  ========================================================== */
#define FMC_KEY0_KEY_Pos                  (0UL)                     /*!< KEY (Bit 0)                                           */
#define FMC_KEY0_KEY_Msk                  (0xffffffffUL)            /*!< KEY (Bitfield-Mask: 0xffffffff)                       */
/* =========================================================  OBKEY  ========================================================= */
#define FMC_OBKEY_OBKEY_Pos               (0UL)                     /*!< OBKEY (Bit 0)                                         */
#define FMC_OBKEY_OBKEY_Msk               (0xffffffffUL)            /*!< OBKEY (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  STAT0  ========================================================= */
#define FMC_STAT0_ENDF_Pos                (5UL)                     /*!< ENDF (Bit 5)                                          */
#define FMC_STAT0_ENDF_Msk                (0x20UL)                  /*!< ENDF (Bitfield-Mask: 0x01)                            */
#define FMC_STAT0_WPERR_Pos               (4UL)                     /*!< WPERR (Bit 4)                                         */
#define FMC_STAT0_WPERR_Msk               (0x10UL)                  /*!< WPERR (Bitfield-Mask: 0x01)                           */
#define FMC_STAT0_PGERR_Pos               (2UL)                     /*!< PGERR (Bit 2)                                         */
#define FMC_STAT0_PGERR_Msk               (0x4UL)                   /*!< PGERR (Bitfield-Mask: 0x01)                           */
#define FMC_STAT0_BUSY_Pos                (0UL)                     /*!< BUSY (Bit 0)                                          */
#define FMC_STAT0_BUSY_Msk                (0x1UL)                   /*!< BUSY (Bitfield-Mask: 0x01)                            */
/* =========================================================  CTL0  ========================================================== */
#define FMC_CTL0_ENDIE_Pos                (12UL)                    /*!< ENDIE (Bit 12)                                        */
#define FMC_CTL0_ENDIE_Msk                (0x1000UL)                /*!< ENDIE (Bitfield-Mask: 0x01)                           */
#define FMC_CTL0_ERRIE_Pos                (10UL)                    /*!< ERRIE (Bit 10)                                        */
#define FMC_CTL0_ERRIE_Msk                (0x400UL)                 /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define FMC_CTL0_OBWEN_Pos                (9UL)                     /*!< OBWEN (Bit 9)                                         */
#define FMC_CTL0_OBWEN_Msk                (0x200UL)                 /*!< OBWEN (Bitfield-Mask: 0x01)                           */
#define FMC_CTL0_LK_Pos                   (7UL)                     /*!< LK (Bit 7)                                            */
#define FMC_CTL0_LK_Msk                   (0x80UL)                  /*!< LK (Bitfield-Mask: 0x01)                              */
#define FMC_CTL0_START_Pos                (6UL)                     /*!< START (Bit 6)                                         */
#define FMC_CTL0_START_Msk                (0x40UL)                  /*!< START (Bitfield-Mask: 0x01)                           */
#define FMC_CTL0_OBER_Pos                 (5UL)                     /*!< OBER (Bit 5)                                          */
#define FMC_CTL0_OBER_Msk                 (0x20UL)                  /*!< OBER (Bitfield-Mask: 0x01)                            */
#define FMC_CTL0_OBPG_Pos                 (4UL)                     /*!< OBPG (Bit 4)                                          */
#define FMC_CTL0_OBPG_Msk                 (0x10UL)                  /*!< OBPG (Bitfield-Mask: 0x01)                            */
#define FMC_CTL0_MER_Pos                  (2UL)                     /*!< MER (Bit 2)                                           */
#define FMC_CTL0_MER_Msk                  (0x4UL)                   /*!< MER (Bitfield-Mask: 0x01)                             */
#define FMC_CTL0_PER_Pos                  (1UL)                     /*!< PER (Bit 1)                                           */
#define FMC_CTL0_PER_Msk                  (0x2UL)                   /*!< PER (Bitfield-Mask: 0x01)                             */
#define FMC_CTL0_PG_Pos                   (0UL)                     /*!< PG (Bit 0)                                            */
#define FMC_CTL0_PG_Msk                   (0x1UL)                   /*!< PG (Bitfield-Mask: 0x01)                              */
/* =========================================================  ADDR0  ========================================================= */
#define FMC_ADDR0_ADDR_Pos                (0UL)                     /*!< ADDR (Bit 0)                                          */
#define FMC_ADDR0_ADDR_Msk                (0xffffffffUL)            /*!< ADDR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  OBSTAT  ========================================================= */
#define FMC_OBSTAT_OBERR_Pos              (0UL)                     /*!< OBERR (Bit 0)                                         */
#define FMC_OBSTAT_OBERR_Msk              (0x1UL)                   /*!< OBERR (Bitfield-Mask: 0x01)                           */
#define FMC_OBSTAT_SPC_Pos                (1UL)                     /*!< SPC (Bit 1)                                           */
#define FMC_OBSTAT_SPC_Msk                (0x2UL)                   /*!< SPC (Bitfield-Mask: 0x01)                             */
#define FMC_OBSTAT_USER_Pos               (2UL)                     /*!< USER (Bit 2)                                          */
#define FMC_OBSTAT_USER_Msk               (0x3fcUL)                 /*!< USER (Bitfield-Mask: 0xff)                            */
#define FMC_OBSTAT_DATA_Pos               (10UL)                    /*!< DATA (Bit 10)                                         */
#define FMC_OBSTAT_DATA_Msk               (0x3fffc00UL)             /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ==========================================================  WP  =========================================================== */
#define FMC_WP_WP_Pos                     (0UL)                     /*!< WP (Bit 0)                                            */
#define FMC_WP_WP_Msk                     (0xffffffffUL)            /*!< WP (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  PID  ========================================================== */
#define FMC_PID_PID_Pos                   (0UL)                     /*!< PID (Bit 0)                                           */
#define FMC_PID_PID_Msk                   (0xffffffffUL)            /*!< PID (Bitfield-Mask: 0xffffffff)                       */


/* =========================================================================================================================== */
/* ================                                           FWDGT                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CTL  ========================================================== */
#define FWDGT_CTL_CMD_Pos                 (0UL)                     /*!< CMD (Bit 0)                                           */
#define FWDGT_CTL_CMD_Msk                 (0xffffUL)                /*!< CMD (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define FWDGT_PSC_PSC_Pos                 (0UL)                     /*!< PSC (Bit 0)                                           */
#define FWDGT_PSC_PSC_Msk                 (0x7UL)                   /*!< PSC (Bitfield-Mask: 0x07)                             */
/* ==========================================================  RLD  ========================================================== */
#define FWDGT_RLD_RLD_Pos                 (0UL)                     /*!< RLD (Bit 0)                                           */
#define FWDGT_RLD_RLD_Msk                 (0xfffUL)                 /*!< RLD (Bitfield-Mask: 0xfff)                            */
/* =========================================================  STAT  ========================================================== */
#define FWDGT_STAT_PUD_Pos                (0UL)                     /*!< PUD (Bit 0)                                           */
#define FWDGT_STAT_PUD_Msk                (0x1UL)                   /*!< PUD (Bitfield-Mask: 0x01)                             */
#define FWDGT_STAT_RUD_Pos                (1UL)                     /*!< RUD (Bit 1)                                           */
#define FWDGT_STAT_RUD_Msk                (0x2UL)                   /*!< RUD (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                           GPIOA                                           ================ */
/* =========================================================================================================================== */

