RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* =========================================================  CTL0  ========================================================== */
#define GPIO_CTL0_CTL7_Pos               (30UL)                    /*!< CTL7 (Bit 30)                                         */
#define GPIO_CTL0_CTL7_Msk               (0xc0000000UL)            /*!< CTL7 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL0_MD7_Pos                (28UL)                    /*!< MD7 (Bit 28)                                          */
#define GPIO_CTL0_MD7_Msk                (0x30000000UL)            /*!< MD7 (Bitfield-Mask: 0x03)                             */
#define GPIO_CTL0_CTL6_Pos               (26UL)                    /*!< CTL6 (Bit 26)                                         */
#define GPIO_CTL0_CTL6_Msk               (0xc000000UL)             /*!< CTL6 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL0_MD6_Pos                (24UL)                    /*!< MD6 (Bit 24)                                          */
#define GPIO_CTL0_MD6_Msk                (0x3000000UL)             /*!< MD6 (Bitfield-Mask: 0x03)                             */
#define GPIO_CTL0_CTL5_Pos               (22UL)                    /*!< CTL5 (Bit 22)                                         */
#define GPIO_CTL0_CTL5_Msk               (0xc00000UL)              /*!< CTL5 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL0_MD5_Pos                (20UL)                    /*!< MD5 (Bit 20)                                          */
#define GPIO_CTL0_MD5_Msk                (0x300000UL)              /*!< MD5 (Bitfield-Mask: 0x03)                             */
#define GPIO_CTL0_CTL4_Pos               (18UL)                    /*!< CTL4 (Bit 18)                                         */
#define GPIO_CTL0_CTL4_Msk               (0xc0000UL)               /*!< CTL4 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL0_MD4_Pos                (16UL)                    /*!< MD4 (Bit 16)                                          */
#define GPIO_CTL0_MD4_Msk                (0x30000UL)               /*!< MD4 (Bitfield-Mask: 0x03)                             */
#define GPIO_CTL0_CTL3_Pos               (14UL)                    /*!< CTL3 (Bit 14)                                         */
#define GPIO_CTL0_CTL3_Msk               (0xc000UL)                /*!< CTL3 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL0_MD3_Pos                (12UL)                    /*!< MD3 (Bit 12)                                          */
#define GPIO_CTL0_MD3_Msk                (0x3000UL)                /*!< MD3 (Bitfield-Mask: 0x03)                             */
#define GPIO_CTL0_CTL2_Pos               (10UL)                    /*!< CTL2 (Bit 10)                                         */
#define GPIO_CTL0_CTL2_Msk               (0xc00UL)                 /*!< CTL2 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL0_MD2_Pos                (8UL)                     /*!< MD2 (Bit 8)                                           */
#define GPIO_CTL0_MD2_Msk                (0x300UL)                 /*!< MD2 (Bitfield-Mask: 0x03)                             */
#define GPIO_CTL0_CTL1_Pos               (6UL)                     /*!< CTL1 (Bit 6)                                          */
#define GPIO_CTL0_CTL1_Msk               (0xc0UL)                  /*!< CTL1 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL0_MD1_Pos                (4UL)                     /*!< MD1 (Bit 4)                                           */
#define GPIO_CTL0_MD1_Msk                (0x30UL)                  /*!< MD1 (Bitfield-Mask: 0x03)                             */
#define GPIO_CTL0_CTL0_Pos               (2UL)                     /*!< CTL0 (Bit 2)                                          */
#define GPIO_CTL0_CTL0_Msk               (0xcUL)                   /*!< CTL0 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL0_MD0_Pos                (0UL)                     /*!< MD0 (Bit 0)                                           */
#define GPIO_CTL0_MD0_Msk                (0x3UL)                   /*!< MD0 (Bitfield-Mask: 0x03)                             */
/* =========================================================  CTL1  ========================================================== */
#define GPIO_CTL1_CTL15_Pos              (30UL)                    /*!< CTL15 (Bit 30)                                        */
#define GPIO_CTL1_CTL15_Msk              (0xc0000000UL)            /*!< CTL15 (Bitfield-Mask: 0x03)                           */
#define GPIO_CTL1_MD15_Pos               (28UL)                    /*!< MD15 (Bit 28)                                         */
#define GPIO_CTL1_MD15_Msk               (0x30000000UL)            /*!< MD15 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL1_CTL14_Pos              (26UL)                    /*!< CTL14 (Bit 26)                                        */
#define GPIO_CTL1_CTL14_Msk              (0xc000000UL)             /*!< CTL14 (Bitfield-Mask: 0x03)                           */
#define GPIO_CTL1_MD14_Pos               (24UL)                    /*!< MD14 (Bit 24)                                         */
#define GPIO_CTL1_MD14_Msk               (0x3000000UL)             /*!< MD14 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL1_CTL13_Pos              (22UL)                    /*!< CTL13 (Bit 22)                                        */
#define GPIO_CTL1_CTL13_Msk              (0xc00000UL)              /*!< CTL13 (Bitfield-Mask: 0x03)                           */
#define GPIO_CTL1_MD13_Pos               (20UL)                    /*!< MD13 (Bit 20)                                         */
#define GPIO_CTL1_MD13_Msk               (0x300000UL)              /*!< MD13 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL1_CTL12_Pos              (18UL)                    /*!< CTL12 (Bit 18)                                        */
#define GPIO_CTL1_CTL12_Msk              (0xc0000UL)               /*!< CTL12 (Bitfield-Mask: 0x03)                           */
#define GPIO_CTL1_MD12_Pos               (16UL)                    /*!< MD12 (Bit 16)                                         */
#define GPIO_CTL1_MD12_Msk               (0x30000UL)               /*!< MD12 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL1_CTL11_Pos              (14UL)                    /*!< CTL11 (Bit 14)                                        */
#define GPIO_CTL1_CTL11_Msk              (0xc000UL)                /*!< CTL11 (Bitfield-Mask: 0x03)                           */
#define GPIO_CTL1_MD11_Pos               (12UL)                    /*!< MD11 (Bit 12)                                         */
#define GPIO_CTL1_MD11_Msk               (0x3000UL)                /*!< MD11 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL1_CTL10_Pos              (10UL)                    /*!< CTL10 (Bit 10)                                        */
#define GPIO_CTL1_CTL10_Msk              (0xc00UL)                 /*!< CTL10 (Bitfield-Mask: 0x03)                           */
#define GPIO_CTL1_MD10_Pos               (8UL)                     /*!< MD10 (Bit 8)                                          */
#define GPIO_CTL1_MD10_Msk               (0x300UL)                 /*!< MD10 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL1_CTL9_Pos               (6UL)                     /*!< CTL9 (Bit 6)                                          */
#define GPIO_CTL1_CTL9_Msk               (0xc0UL)                  /*!< CTL9 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL1_MD9_Pos                (4UL)                     /*!< MD9 (Bit 4)                                           */
#define GPIO_CTL1_MD9_Msk                (0x30UL)                  /*!< MD9 (Bitfield-Mask: 0x03)                             */
#define GPIO_CTL1_CTL8_Pos               (2UL)                     /*!< CTL8 (Bit 2)                                          */
#define GPIO_CTL1_CTL8_Msk               (0xcUL)                   /*!< CTL8 (Bitfield-Mask: 0x03)                            */
#define GPIO_CTL1_MD8_Pos                (0UL)                     /*!< MD8 (Bit 0)                                           */
#define GPIO_CTL1_MD8_Msk                (0x3UL)                   /*!< MD8 (Bitfield-Mask: 0x03)                             */
/* =========================================================  ISTAT  ========================================================= */
#define GPIO_ISTAT_ISTAT15_Pos           (15UL)                    /*!< ISTAT15 (Bit 15)                                      */
#define GPIO_ISTAT_ISTAT15_Msk           (0x8000UL)                /*!< ISTAT15 (Bitfield-Mask: 0x01)                         */
#define GPIO_ISTAT_ISTAT14_Pos           (14UL)                    /*!< ISTAT14 (Bit 14)                                      */
#define GPIO_ISTAT_ISTAT14_Msk           (0x4000UL)                /*!< ISTAT14 (Bitfield-Mask: 0x01)                         */
#define GPIO_ISTAT_ISTAT13_Pos           (13UL)                    /*!< ISTAT13 (Bit 13)                                      */
#define GPIO_ISTAT_ISTAT13_Msk           (0x2000UL)                /*!< ISTAT13 (Bitfield-Mask: 0x01)                         */
#define GPIO_ISTAT_ISTAT12_Pos           (12UL)                    /*!< ISTAT12 (Bit 12)                                      */
#define GPIO_ISTAT_ISTAT12_Msk           (0x1000UL)                /*!< ISTAT12 (Bitfield-Mask: 0x01)                         */
#define GPIO_ISTAT_ISTAT11_Pos           (11UL)                    /*!< ISTAT11 (Bit 11)                                      */
#define GPIO_ISTAT_ISTAT11_Msk           (0x800UL)                 /*!< ISTAT11 (Bitfield-Mask: 0x01)                         */
#define GPIO_ISTAT_ISTAT10_Pos           (10UL)                    /*!< ISTAT10 (Bit 10)                                      */
#define GPIO_ISTAT_ISTAT10_Msk           (0x400UL)                 /*!< ISTAT10 (Bitfield-Mask: 0x01)                         */
#define GPIO_ISTAT_ISTAT9_Pos            (9UL)                     /*!< ISTAT9 (Bit 9)                                        */
#define GPIO_ISTAT_ISTAT9_Msk            (0x200UL)                 /*!< ISTAT9 (Bitfield-Mask: 0x01)                          */
#define GPIO_ISTAT_ISTAT8_Pos            (8UL)                     /*!< ISTAT8 (Bit 8)                                        */
#define GPIO_ISTAT_ISTAT8_Msk            (0x100UL)                 /*!< ISTAT8 (Bitfield-Mask: 0x01)                          */
#define GPIO_ISTAT_ISTAT7_Pos            (7UL)                     /*!< ISTAT7 (Bit 7)                                        */
#define GPIO_ISTAT_ISTAT7_Msk            (0x80UL)                  /*!< ISTAT7 (Bitfield-Mask: 0x01)                          */
#define GPIO_ISTAT_ISTAT6_Pos            (6UL)                     /*!< ISTAT6 (Bit 6)                                        */
#define GPIO_ISTAT_ISTAT6_Msk            (0x40UL)                  /*!< ISTAT6 (Bitfield-Mask: 0x01)                          */
#define GPIO_ISTAT_ISTAT5_Pos            (5UL)                     /*!< ISTAT5 (Bit 5)                                        */
#define GPIO_ISTAT_ISTAT5_Msk            (0x20UL)                  /*!< ISTAT5 (Bitfield-Mask: 0x01)                          */
#define GPIO_ISTAT_ISTAT4_Pos            (4UL)                     /*!< ISTAT4 (Bit 4)                                        */
#define GPIO_ISTAT_ISTAT4_Msk            (0x10UL)                  /*!< ISTAT4 (Bitfield-Mask: 0x01)                          */
#define GPIO_ISTAT_ISTAT3_Pos            (3UL)                     /*!< ISTAT3 (Bit 3)                                        */
#define GPIO_ISTAT_ISTAT3_Msk            (0x8UL)                   /*!< ISTAT3 (Bitfield-Mask: 0x01)                          */
#define GPIO_ISTAT_ISTAT2_Pos            (2UL)                     /*!< ISTAT2 (Bit 2)                                        */
#define GPIO_ISTAT_ISTAT2_Msk            (0x4UL)                   /*!< ISTAT2 (Bitfield-Mask: 0x01)                          */
#define GPIO_ISTAT_ISTAT1_Pos            (1UL)                     /*!< ISTAT1 (Bit 1)                                        */
#define GPIO_ISTAT_ISTAT1_Msk            (0x2UL)                   /*!< ISTAT1 (Bitfield-Mask: 0x01)                          */
#define GPIO_ISTAT_ISTAT0_Pos            (0UL)                     /*!< ISTAT0 (Bit 0)                                        */
#define GPIO_ISTAT_ISTAT0_Msk            (0x1UL)                   /*!< ISTAT0 (Bitfield-Mask: 0x01)                          */
/* =========================================================  OCTL  ========================================================== */
#define GPIO_OCTL_OCTL15_Pos             (15UL)                    /*!< OCTL15 (Bit 15)                                       */
#define GPIO_OCTL_OCTL15_Msk             (0x8000UL)                /*!< OCTL15 (Bitfield-Mask: 0x01)                          */
#define GPIO_OCTL_OCTL14_Pos             (14UL)                    /*!< OCTL14 (Bit 14)                                       */
#define GPIO_OCTL_OCTL14_Msk             (0x4000UL)                /*!< OCTL14 (Bitfield-Mask: 0x01)                          */
#define GPIO_OCTL_OCTL13_Pos             (13UL)                    /*!< OCTL13 (Bit 13)                                       */
#define GPIO_OCTL_OCTL13_Msk             (0x2000UL)                /*!< OCTL13 (Bitfield-Mask: 0x01)                          */
#define GPIO_OCTL_OCTL12_Pos             (12UL)                    /*!< OCTL12 (Bit 12)                                       */
#define GPIO_OCTL_OCTL12_Msk             (0x1000UL)                /*!< OCTL12 (Bitfield-Mask: 0x01)                          */
#define GPIO_OCTL_OCTL11_Pos             (11UL)                    /*!< OCTL11 (Bit 11)                                       */
#define GPIO_OCTL_OCTL11_Msk             (0x800UL)                 /*!< OCTL11 (Bitfield-Mask: 0x01)                          */
#define GPIO_OCTL_OCTL10_Pos             (10UL)                    /*!< OCTL10 (Bit 10)                                       */
#define GPIO_OCTL_OCTL10_Msk             (0x400UL)                 /*!< OCTL10 (Bitfield-Mask: 0x01)                          */
#define GPIO_OCTL_OCTL9_Pos              (9UL)                     /*!< OCTL9 (Bit 9)                                         */
#define GPIO_OCTL_OCTL9_Msk              (0x200UL)                 /*!< OCTL9 (Bitfield-Mask: 0x01)                           */
#define GPIO_OCTL_OCTL8_Pos              (8UL)                     /*!< OCTL8 (Bit 8)                                         */
#define GPIO_OCTL_OCTL8_Msk              (0x100UL)                 /*!< OCTL8 (Bitfield-Mask: 0x01)                           */
#define GPIO_OCTL_OCTL7_Pos              (7UL)                     /*!< OCTL7 (Bit 7)                                         */
#define GPIO_OCTL_OCTL7_Msk              (0x80UL)                  /*!< OCTL7 (Bitfield-Mask: 0x01)                           */
#define GPIO_OCTL_OCTL6_Pos              (6UL)                     /*!< OCTL6 (Bit 6)                                         */
#define GPIO_OCTL_OCTL6_Msk              (0x40UL)                  /*!< OCTL6 (Bitfield-Mask: 0x01)                           */
#define GPIO_OCTL_OCTL5_Pos              (5UL)                     /*!< OCTL5 (Bit 5)                                         */
#define GPIO_OCTL_OCTL5_Msk              (0x20UL)                  /*!< OCTL5 (Bitfield-Mask: 0x01)                           */
#define GPIO_OCTL_OCTL4_Pos              (4UL)                     /*!< OCTL4 (Bit 4)                                         */
#define GPIO_OCTL_OCTL4_Msk              (0x10UL)                  /*!< OCTL4 (Bitfield-Mask: 0x01)                           */
#define GPIO_OCTL_OCTL3_Pos              (3UL)                     /*!< OCTL3 (Bit 3)                                         */
#define GPIO_OCTL_OCTL3_Msk              (0x8UL)                   /*!< OCTL3 (Bitfield-Mask: 0x01)                           */
#define GPIO_OCTL_OCTL2_Pos              (2UL)                     /*!< OCTL2 (Bit 2)                                         */
#define GPIO_OCTL_OCTL2_Msk              (0x4UL)                   /*!< OCTL2 (Bitfield-Mask: 0x01)                           */
#define GPIO_OCTL_OCTL1_Pos              (1UL)                     /*!< OCTL1 (Bit 1)                                         */
#define GPIO_OCTL_OCTL1_Msk              (0x2UL)                   /*!< OCTL1 (Bitfield-Mask: 0x01)                           */
#define GPIO_OCTL_OCTL0_Pos              (0UL)                     /*!< OCTL0 (Bit 0)                                         */
#define GPIO_OCTL_OCTL0_Msk              (0x1UL)                   /*!< OCTL0 (Bitfield-Mask: 0x01)                           */
/* ==========================================================  BOP  ========================================================== */
#define GPIO_BOP_CR15_Pos                (31UL)                    /*!< CR15 (Bit 31)                                         */
#define GPIO_BOP_CR15_Msk                (0x80000000UL)            /*!< CR15 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_CR14_Pos                (30UL)                    /*!< CR14 (Bit 30)                                         */
#define GPIO_BOP_CR14_Msk                (0x40000000UL)            /*!< CR14 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_CR13_Pos                (29UL)                    /*!< CR13 (Bit 29)                                         */
#define GPIO_BOP_CR13_Msk                (0x20000000UL)            /*!< CR13 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_CR12_Pos                (28UL)                    /*!< CR12 (Bit 28)                                         */
#define GPIO_BOP_CR12_Msk                (0x10000000UL)            /*!< CR12 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_CR11_Pos                (27UL)                    /*!< CR11 (Bit 27)                                         */
#define GPIO_BOP_CR11_Msk                (0x8000000UL)             /*!< CR11 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_CR10_Pos                (26UL)                    /*!< CR10 (Bit 26)                                         */
#define GPIO_BOP_CR10_Msk                (0x4000000UL)             /*!< CR10 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_CR9_Pos                 (25UL)                    /*!< CR9 (Bit 25)                                          */
#define GPIO_BOP_CR9_Msk                 (0x2000000UL)             /*!< CR9 (Bitfield-Mask: 0x01)                             */
#define GPIO_BOP_CR8_Pos                 (24UL)                    /*!< CR8 (Bit 24)                                          */
#define GPIO_BOP_CR8_Msk                 (0x1000000UL)             /*!< CR8 (Bitfield-Mask: 0x01)                             */
#define GPIO_BOP_CR7_Pos                 (23UL)                    /*!< CR7 (Bit 23)                                          */
#define GPIO_BOP_CR7_Msk                 (0x800000UL)              /*!< CR7 (Bitfield-Mask: 0x01)                             */
#define GPIO_BOP_CR6_Pos                 (22UL)                    /*!< CR6 (Bit 22)                                          */
#define GPIO_BOP_CR6_Msk                 (0x400000UL)              /*!< CR6 (Bitfield-Mask: 0x01)                             */
#define GPIO_BOP_CR5_Pos                 (21UL)                    /*!< CR5 (Bit 21)                                          */
#define GPIO_BOP_CR5_Msk                 (0x200000UL)              /*!< CR5 (Bitfield-Mask: 0x01)                             */
#define GPIO_BOP_CR4_Pos                 (20UL)                    /*!< CR4 (Bit 20)                                          */
#define GPIO_BOP_CR4_Msk                 (0x100000UL)              /*!< CR4 (Bitfield-Mask: 0x01)                             */
#define GPIO_BOP_CR3_Pos                 (19UL)                    /*!< CR3 (Bit 19)                                          */
#define GPIO_BOP_CR3_Msk                 (0x80000UL)               /*!< CR3 (Bitfield-Mask: 0x01)                             */
#define GPIO_BOP_CR2_Pos                 (18UL)                    /*!< CR2 (Bit 18)                                          */
#define GPIO_BOP_CR2_Msk                 (0x40000UL)               /*!< CR2 (Bitfield-Mask: 0x01)                             */
#define GPIO_BOP_CR1_Pos                 (17UL)                    /*!< CR1 (Bit 17)                                          */
#define GPIO_BOP_CR1_Msk                 (0x20000UL)               /*!< CR1 (Bitfield-Mask: 0x01)                             */
#define GPIO_BOP_CR0_Pos                 (16UL)                    /*!< CR0 (Bit 16)                                          */
#define GPIO_BOP_CR0_Msk                 (0x10000UL)               /*!< CR0 (Bitfield-Mask: 0x01)                             */
#define GPIO_BOP_BOP15_Pos               (15UL)                    /*!< BOP15 (Bit 15)                                        */
#define GPIO_BOP_BOP15_Msk               (0x8000UL)                /*!< BOP15 (Bitfield-Mask: 0x01)                           */
#define GPIO_BOP_BOP14_Pos               (14UL)                    /*!< BOP14 (Bit 14)                                        */
#define GPIO_BOP_BOP14_Msk               (0x4000UL)                /*!< BOP14 (Bitfield-Mask: 0x01)                           */
#define GPIO_BOP_BOP13_Pos               (13UL)                    /*!< BOP13 (Bit 13)                                        */
#define GPIO_BOP_BOP13_Msk               (0x2000UL)                /*!< BOP13 (Bitfield-Mask: 0x01)                           */
#define GPIO_BOP_BOP12_Pos               (12UL)                    /*!< BOP12 (Bit 12)                                        */
#define GPIO_BOP_BOP12_Msk               (0x1000UL)                /*!< BOP12 (Bitfield-Mask: 0x01)                           */
#define GPIO_BOP_BOP11_Pos               (11UL)                    /*!< BOP11 (Bit 11)                                        */
#define GPIO_BOP_BOP11_Msk               (0x800UL)                 /*!< BOP11 (Bitfield-Mask: 0x01)                           */
#define GPIO_BOP_BOP10_Pos               (10UL)                    /*!< BOP10 (Bit 10)                                        */
#define GPIO_BOP_BOP10_Msk               (0x400UL)                 /*!< BOP10 (Bitfield-Mask: 0x01)                           */
#define GPIO_BOP_BOP9_Pos                (9UL)                     /*!< BOP9 (Bit 9)                                          */
#define GPIO_BOP_BOP9_Msk                (0x200UL)                 /*!< BOP9 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_BOP8_Pos                (8UL)                     /*!< BOP8 (Bit 8)                                          */
#define GPIO_BOP_BOP8_Msk                (0x100UL)                 /*!< BOP8 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_BOP7_Pos                (7UL)                     /*!< BOP7 (Bit 7)                                          */
#define GPIO_BOP_BOP7_Msk                (0x80UL)                  /*!< BOP7 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_BOP6_Pos                (6UL)                     /*!< BOP6 (Bit 6)                                          */
#define GPIO_BOP_BOP6_Msk                (0x40UL)                  /*!< BOP6 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_BOP5_Pos                (5UL)                     /*!< BOP5 (Bit 5)                                          */
