RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define GPIO_BOP_BOP5_Msk                (0x20UL)                  /*!< BOP5 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_BOP4_Pos                (4UL)                     /*!< BOP4 (Bit 4)                                          */
#define GPIO_BOP_BOP4_Msk                (0x10UL)                  /*!< BOP4 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_BOP3_Pos                (3UL)                     /*!< BOP3 (Bit 3)                                          */
#define GPIO_BOP_BOP3_Msk                (0x8UL)                   /*!< BOP3 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_BOP2_Pos                (2UL)                     /*!< BOP2 (Bit 2)                                          */
#define GPIO_BOP_BOP2_Msk                (0x4UL)                   /*!< BOP2 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_BOP1_Pos                (1UL)                     /*!< BOP1 (Bit 1)                                          */
#define GPIO_BOP_BOP1_Msk                (0x2UL)                   /*!< BOP1 (Bitfield-Mask: 0x01)                            */
#define GPIO_BOP_BOP0_Pos                (0UL)                     /*!< BOP0 (Bit 0)                                          */
#define GPIO_BOP_BOP0_Msk                (0x1UL)                   /*!< BOP0 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  BC  =========================================================== */
#define GPIO_BC_CR15_Pos                 (15UL)                    /*!< CR15 (Bit 15)                                         */
#define GPIO_BC_CR15_Msk                 (0x8000UL)                /*!< CR15 (Bitfield-Mask: 0x01)                            */
#define GPIO_BC_CR14_Pos                 (14UL)                    /*!< CR14 (Bit 14)                                         */
#define GPIO_BC_CR14_Msk                 (0x4000UL)                /*!< CR14 (Bitfield-Mask: 0x01)                            */
#define GPIO_BC_CR13_Pos                 (13UL)                    /*!< CR13 (Bit 13)                                         */
#define GPIO_BC_CR13_Msk                 (0x2000UL)                /*!< CR13 (Bitfield-Mask: 0x01)                            */
#define GPIO_BC_CR12_Pos                 (12UL)                    /*!< CR12 (Bit 12)                                         */
#define GPIO_BC_CR12_Msk                 (0x1000UL)                /*!< CR12 (Bitfield-Mask: 0x01)                            */
#define GPIO_BC_CR11_Pos                 (11UL)                    /*!< CR11 (Bit 11)                                         */
#define GPIO_BC_CR11_Msk                 (0x800UL)                 /*!< CR11 (Bitfield-Mask: 0x01)                            */
#define GPIO_BC_CR10_Pos                 (10UL)                    /*!< CR10 (Bit 10)                                         */
#define GPIO_BC_CR10_Msk                 (0x400UL)                 /*!< CR10 (Bitfield-Mask: 0x01)                            */
#define GPIO_BC_CR9_Pos                  (9UL)                     /*!< CR9 (Bit 9)                                           */
#define GPIO_BC_CR9_Msk                  (0x200UL)                 /*!< CR9 (Bitfield-Mask: 0x01)                             */
#define GPIO_BC_CR8_Pos                  (8UL)                     /*!< CR8 (Bit 8)                                           */
#define GPIO_BC_CR8_Msk                  (0x100UL)                 /*!< CR8 (Bitfield-Mask: 0x01)                             */
#define GPIO_BC_CR7_Pos                  (7UL)                     /*!< CR7 (Bit 7)                                           */
#define GPIO_BC_CR7_Msk                  (0x80UL)                  /*!< CR7 (Bitfield-Mask: 0x01)                             */
#define GPIO_BC_CR6_Pos                  (6UL)                     /*!< CR6 (Bit 6)                                           */
#define GPIO_BC_CR6_Msk                  (0x40UL)                  /*!< CR6 (Bitfield-Mask: 0x01)                             */
#define GPIO_BC_CR5_Pos                  (5UL)                     /*!< CR5 (Bit 5)                                           */
#define GPIO_BC_CR5_Msk                  (0x20UL)                  /*!< CR5 (Bitfield-Mask: 0x01)                             */
#define GPIO_BC_CR4_Pos                  (4UL)                     /*!< CR4 (Bit 4)                                           */
#define GPIO_BC_CR4_Msk                  (0x10UL)                  /*!< CR4 (Bitfield-Mask: 0x01)                             */
#define GPIO_BC_CR3_Pos                  (3UL)                     /*!< CR3 (Bit 3)                                           */
#define GPIO_BC_CR3_Msk                  (0x8UL)                   /*!< CR3 (Bitfield-Mask: 0x01)                             */
#define GPIO_BC_CR2_Pos                  (2UL)                     /*!< CR2 (Bit 2)                                           */
#define GPIO_BC_CR2_Msk                  (0x4UL)                   /*!< CR2 (Bitfield-Mask: 0x01)                             */
#define GPIO_BC_CR1_Pos                  (1UL)                     /*!< CR1 (Bit 1)                                           */
#define GPIO_BC_CR1_Msk                  (0x2UL)                   /*!< CR1 (Bitfield-Mask: 0x01)                             */
#define GPIO_BC_CR0_Pos                  (0UL)                     /*!< CR0 (Bit 0)                                           */
#define GPIO_BC_CR0_Msk                  (0x1UL)                   /*!< CR0 (Bitfield-Mask: 0x01)                             */
/* =========================================================  LOCK  ========================================================== */
#define GPIO_LOCK_LKK_Pos                (16UL)                    /*!< LKK (Bit 16)                                          */
#define GPIO_LOCK_LKK_Msk                (0x10000UL)               /*!< LKK (Bitfield-Mask: 0x01)                             */
#define GPIO_LOCK_LK15_Pos               (15UL)                    /*!< LK15 (Bit 15)                                         */
#define GPIO_LOCK_LK15_Msk               (0x8000UL)                /*!< LK15 (Bitfield-Mask: 0x01)                            */
#define GPIO_LOCK_LK14_Pos               (14UL)                    /*!< LK14 (Bit 14)                                         */
#define GPIO_LOCK_LK14_Msk               (0x4000UL)                /*!< LK14 (Bitfield-Mask: 0x01)                            */
#define GPIO_LOCK_LK13_Pos               (13UL)                    /*!< LK13 (Bit 13)                                         */
#define GPIO_LOCK_LK13_Msk               (0x2000UL)                /*!< LK13 (Bitfield-Mask: 0x01)                            */
#define GPIO_LOCK_LK12_Pos               (12UL)                    /*!< LK12 (Bit 12)                                         */
#define GPIO_LOCK_LK12_Msk               (0x1000UL)                /*!< LK12 (Bitfield-Mask: 0x01)                            */
#define GPIO_LOCK_LK11_Pos               (11UL)                    /*!< LK11 (Bit 11)                                         */
#define GPIO_LOCK_LK11_Msk               (0x800UL)                 /*!< LK11 (Bitfield-Mask: 0x01)                            */
#define GPIO_LOCK_LK10_Pos               (10UL)                    /*!< LK10 (Bit 10)                                         */
#define GPIO_LOCK_LK10_Msk               (0x400UL)                 /*!< LK10 (Bitfield-Mask: 0x01)                            */
#define GPIO_LOCK_LK9_Pos                (9UL)                     /*!< LK9 (Bit 9)                                           */
#define GPIO_LOCK_LK9_Msk                (0x200UL)                 /*!< LK9 (Bitfield-Mask: 0x01)                             */
#define GPIO_LOCK_LK8_Pos                (8UL)                     /*!< LK8 (Bit 8)                                           */
#define GPIO_LOCK_LK8_Msk                (0x100UL)                 /*!< LK8 (Bitfield-Mask: 0x01)                             */
#define GPIO_LOCK_LK7_Pos                (7UL)                     /*!< LK7 (Bit 7)                                           */
#define GPIO_LOCK_LK7_Msk                (0x80UL)                  /*!< LK7 (Bitfield-Mask: 0x01)                             */
#define GPIO_LOCK_LK6_Pos                (6UL)                     /*!< LK6 (Bit 6)                                           */
#define GPIO_LOCK_LK6_Msk                (0x40UL)                  /*!< LK6 (Bitfield-Mask: 0x01)                             */
#define GPIO_LOCK_LK5_Pos                (5UL)                     /*!< LK5 (Bit 5)                                           */
#define GPIO_LOCK_LK5_Msk                (0x20UL)                  /*!< LK5 (Bitfield-Mask: 0x01)                             */
#define GPIO_LOCK_LK4_Pos                (4UL)                     /*!< LK4 (Bit 4)                                           */
#define GPIO_LOCK_LK4_Msk                (0x10UL)                  /*!< LK4 (Bitfield-Mask: 0x01)                             */
#define GPIO_LOCK_LK3_Pos                (3UL)                     /*!< LK3 (Bit 3)                                           */
#define GPIO_LOCK_LK3_Msk                (0x8UL)                   /*!< LK3 (Bitfield-Mask: 0x01)                             */
#define GPIO_LOCK_LK2_Pos                (2UL)                     /*!< LK2 (Bit 2)                                           */
#define GPIO_LOCK_LK2_Msk                (0x4UL)                   /*!< LK2 (Bitfield-Mask: 0x01)                             */
#define GPIO_LOCK_LK1_Pos                (1UL)                     /*!< LK1 (Bit 1)                                           */
#define GPIO_LOCK_LK1_Msk                (0x2UL)                   /*!< LK1 (Bitfield-Mask: 0x01)                             */
#define GPIO_LOCK_LK0_Pos                (0UL)                     /*!< LK0 (Bit 0)                                           */
#define GPIO_LOCK_LK0_Msk                (0x1UL)                   /*!< LK0 (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                           I2C0                                            ================ */
/* =========================================================================================================================== */

