RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* ========================================================  CLICCFG  ======================================================== */
#define ECLIC_CLICCFG_NLBITS_Pos          (1UL)                     /*!< NLBITS (Bit 1)                                        */
#define ECLIC_CLICCFG_NLBITS_Msk          (0x1eUL)                  /*!< NLBITS (Bitfield-Mask: 0x0f)                          */
/* =======================================================  CLICINFO  ======================================================== */
#define ECLIC_CLICINFO_NUM_INTERRUPT_Pos  (0UL)                     /*!< NUM_INTERRUPT (Bit 0)                                 */
#define ECLIC_CLICINFO_NUM_INTERRUPT_Msk  (0x1fffUL)                /*!< NUM_INTERRUPT (Bitfield-Mask: 0x1fff)                 */
#define ECLIC_CLICINFO_VERSION_Pos        (13UL)                    /*!< VERSION (Bit 13)                                      */
#define ECLIC_CLICINFO_VERSION_Msk        (0x1fe000UL)              /*!< VERSION (Bitfield-Mask: 0xff)                         */
#define ECLIC_CLICINFO_CLICINTCTLBITS_Pos (21UL)                    /*!< CLICINTCTLBITS (Bit 21)                               */
#define ECLIC_CLICINFO_CLICINTCTLBITS_Msk (0x1e00000UL)             /*!< CLICINTCTLBITS (Bitfield-Mask: 0x0f)                  */
/* ==========================================================  MTH  ========================================================== */
#define ECLIC_MTH_MTH_Pos                 (0UL)                     /*!< MTH (Bit 0)                                           */
#define ECLIC_MTH_MTH_Msk                 (0xffUL)                  /*!< MTH (Bitfield-Mask: 0xff)                             */
/* ======================================================  CLICINTIP_0  ====================================================== */
#define ECLIC_CLICINTIP_0_IP_Pos          (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_0_IP_Msk          (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIP_1  ====================================================== */
#define ECLIC_CLICINTIP_1_IP_Pos          (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_1_IP_Msk          (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIP_2  ====================================================== */
#define ECLIC_CLICINTIP_2_IP_Pos          (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_2_IP_Msk          (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIP_3  ====================================================== */
#define ECLIC_CLICINTIP_3_IP_Pos          (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_3_IP_Msk          (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIP_4  ====================================================== */
#define ECLIC_CLICINTIP_4_IP_Pos          (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_4_IP_Msk          (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIP_5  ====================================================== */
#define ECLIC_CLICINTIP_5_IP_Pos          (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_5_IP_Msk          (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIP_6  ====================================================== */
#define ECLIC_CLICINTIP_6_IP_Pos          (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_6_IP_Msk          (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIP_7  ====================================================== */
#define ECLIC_CLICINTIP_7_IP_Pos          (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_7_IP_Msk          (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIP_8  ====================================================== */
#define ECLIC_CLICINTIP_8_IP_Pos          (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_8_IP_Msk          (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIP_9  ====================================================== */
#define ECLIC_CLICINTIP_9_IP_Pos          (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_9_IP_Msk          (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_10  ====================================================== */
#define ECLIC_CLICINTIP_10_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_10_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_11  ====================================================== */
#define ECLIC_CLICINTIP_11_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_11_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_12  ====================================================== */
#define ECLIC_CLICINTIP_12_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_12_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_13  ====================================================== */
#define ECLIC_CLICINTIP_13_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_13_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_14  ====================================================== */
#define ECLIC_CLICINTIP_14_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_14_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_15  ====================================================== */
#define ECLIC_CLICINTIP_15_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_15_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_16  ====================================================== */
#define ECLIC_CLICINTIP_16_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_16_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_17  ====================================================== */
#define ECLIC_CLICINTIP_17_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_17_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_18  ====================================================== */
#define ECLIC_CLICINTIP_18_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_18_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_19  ====================================================== */
#define ECLIC_CLICINTIP_19_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_19_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_20  ====================================================== */
#define ECLIC_CLICINTIP_20_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_20_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_21  ====================================================== */
#define ECLIC_CLICINTIP_21_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_21_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_22  ====================================================== */
#define ECLIC_CLICINTIP_22_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_22_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_23  ====================================================== */
#define ECLIC_CLICINTIP_23_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_23_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_24  ====================================================== */
#define ECLIC_CLICINTIP_24_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_24_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_25  ====================================================== */
#define ECLIC_CLICINTIP_25_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_25_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_26  ====================================================== */
#define ECLIC_CLICINTIP_26_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_26_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_27  ====================================================== */
#define ECLIC_CLICINTIP_27_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_27_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_28  ====================================================== */
#define ECLIC_CLICINTIP_28_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_28_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_29  ====================================================== */
#define ECLIC_CLICINTIP_29_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_29_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_30  ====================================================== */
#define ECLIC_CLICINTIP_30_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_30_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_31  ====================================================== */
#define ECLIC_CLICINTIP_31_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_31_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_32  ====================================================== */
#define ECLIC_CLICINTIP_32_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_32_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_33  ====================================================== */
#define ECLIC_CLICINTIP_33_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_33_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_34  ====================================================== */
#define ECLIC_CLICINTIP_34_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_34_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_35  ====================================================== */
#define ECLIC_CLICINTIP_35_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_35_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_36  ====================================================== */
#define ECLIC_CLICINTIP_36_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_36_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_37  ====================================================== */
#define ECLIC_CLICINTIP_37_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_37_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_38  ====================================================== */
#define ECLIC_CLICINTIP_38_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_38_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_39  ====================================================== */
#define ECLIC_CLICINTIP_39_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_39_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_40  ====================================================== */
#define ECLIC_CLICINTIP_40_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_40_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_41  ====================================================== */
#define ECLIC_CLICINTIP_41_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_41_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_42  ====================================================== */
#define ECLIC_CLICINTIP_42_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_42_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_43  ====================================================== */
#define ECLIC_CLICINTIP_43_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_43_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_44  ====================================================== */
#define ECLIC_CLICINTIP_44_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_44_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_45  ====================================================== */
#define ECLIC_CLICINTIP_45_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_45_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_46  ====================================================== */
#define ECLIC_CLICINTIP_46_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_46_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_47  ====================================================== */
#define ECLIC_CLICINTIP_47_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_47_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_48  ====================================================== */
#define ECLIC_CLICINTIP_48_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_48_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_49  ====================================================== */
#define ECLIC_CLICINTIP_49_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_49_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_50  ====================================================== */
#define ECLIC_CLICINTIP_50_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_50_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_51  ====================================================== */
#define ECLIC_CLICINTIP_51_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_51_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_52  ====================================================== */
#define ECLIC_CLICINTIP_52_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_52_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_53  ====================================================== */
#define ECLIC_CLICINTIP_53_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_53_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_54  ====================================================== */
#define ECLIC_CLICINTIP_54_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_54_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_55  ====================================================== */
#define ECLIC_CLICINTIP_55_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_55_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_56  ====================================================== */
#define ECLIC_CLICINTIP_56_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_56_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
