RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* =====================================================  CLICINTIP_57  ====================================================== */
#define ECLIC_CLICINTIP_57_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_57_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_58  ====================================================== */
#define ECLIC_CLICINTIP_58_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_58_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_59  ====================================================== */
#define ECLIC_CLICINTIP_59_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_59_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_60  ====================================================== */
#define ECLIC_CLICINTIP_60_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_60_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_61  ====================================================== */
#define ECLIC_CLICINTIP_61_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_61_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_62  ====================================================== */
#define ECLIC_CLICINTIP_62_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_62_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_63  ====================================================== */
#define ECLIC_CLICINTIP_63_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_63_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_64  ====================================================== */
#define ECLIC_CLICINTIP_64_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_64_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_65  ====================================================== */
#define ECLIC_CLICINTIP_65_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_65_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_66  ====================================================== */
#define ECLIC_CLICINTIP_66_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_66_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_67  ====================================================== */
#define ECLIC_CLICINTIP_67_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_67_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_68  ====================================================== */
#define ECLIC_CLICINTIP_68_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_68_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_69  ====================================================== */
#define ECLIC_CLICINTIP_69_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_69_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_70  ====================================================== */
#define ECLIC_CLICINTIP_70_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_70_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_71  ====================================================== */
#define ECLIC_CLICINTIP_71_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_71_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_72  ====================================================== */
#define ECLIC_CLICINTIP_72_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_72_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_73  ====================================================== */
#define ECLIC_CLICINTIP_73_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_73_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_74  ====================================================== */
#define ECLIC_CLICINTIP_74_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_74_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_75  ====================================================== */
#define ECLIC_CLICINTIP_75_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_75_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_76  ====================================================== */
#define ECLIC_CLICINTIP_76_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_76_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_77  ====================================================== */
#define ECLIC_CLICINTIP_77_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_77_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_78  ====================================================== */
#define ECLIC_CLICINTIP_78_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_78_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_79  ====================================================== */
#define ECLIC_CLICINTIP_79_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_79_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_80  ====================================================== */
#define ECLIC_CLICINTIP_80_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_80_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_81  ====================================================== */
#define ECLIC_CLICINTIP_81_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_81_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_82  ====================================================== */
#define ECLIC_CLICINTIP_82_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_82_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_83  ====================================================== */
#define ECLIC_CLICINTIP_83_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_83_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_84  ====================================================== */
#define ECLIC_CLICINTIP_84_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_84_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_85  ====================================================== */
#define ECLIC_CLICINTIP_85_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_85_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIP_86  ====================================================== */
#define ECLIC_CLICINTIP_86_IP_Pos         (0UL)                     /*!< IP (Bit 0)                                            */
#define ECLIC_CLICINTIP_86_IP_Msk         (0x1UL)                   /*!< IP (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIE_0  ====================================================== */
#define ECLIC_CLICINTIE_0_IE_Pos          (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_0_IE_Msk          (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIE_1  ====================================================== */
#define ECLIC_CLICINTIE_1_IE_Pos          (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_1_IE_Msk          (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIE_2  ====================================================== */
#define ECLIC_CLICINTIE_2_IE_Pos          (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_2_IE_Msk          (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIE_3  ====================================================== */
#define ECLIC_CLICINTIE_3_IE_Pos          (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_3_IE_Msk          (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIE_4  ====================================================== */
#define ECLIC_CLICINTIE_4_IE_Pos          (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_4_IE_Msk          (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIE_5  ====================================================== */
#define ECLIC_CLICINTIE_5_IE_Pos          (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_5_IE_Msk          (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIE_6  ====================================================== */
#define ECLIC_CLICINTIE_6_IE_Pos          (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_6_IE_Msk          (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIE_7  ====================================================== */
#define ECLIC_CLICINTIE_7_IE_Pos          (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_7_IE_Msk          (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIE_8  ====================================================== */
#define ECLIC_CLICINTIE_8_IE_Pos          (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_8_IE_Msk          (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* ======================================================  CLICINTIE_9  ====================================================== */
#define ECLIC_CLICINTIE_9_IE_Pos          (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_9_IE_Msk          (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_10  ====================================================== */
#define ECLIC_CLICINTIE_10_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_10_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_11  ====================================================== */
#define ECLIC_CLICINTIE_11_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_11_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_12  ====================================================== */
#define ECLIC_CLICINTIE_12_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_12_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_13  ====================================================== */
#define ECLIC_CLICINTIE_13_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_13_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_14  ====================================================== */
#define ECLIC_CLICINTIE_14_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_14_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_15  ====================================================== */
#define ECLIC_CLICINTIE_15_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_15_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_16  ====================================================== */
#define ECLIC_CLICINTIE_16_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_16_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_17  ====================================================== */
#define ECLIC_CLICINTIE_17_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_17_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_18  ====================================================== */
#define ECLIC_CLICINTIE_18_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_18_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_19  ====================================================== */
#define ECLIC_CLICINTIE_19_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_19_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_20  ====================================================== */
#define ECLIC_CLICINTIE_20_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_20_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_21  ====================================================== */
#define ECLIC_CLICINTIE_21_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_21_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_22  ====================================================== */
#define ECLIC_CLICINTIE_22_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_22_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_23  ====================================================== */
#define ECLIC_CLICINTIE_23_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_23_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_24  ====================================================== */
#define ECLIC_CLICINTIE_24_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_24_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_25  ====================================================== */
#define ECLIC_CLICINTIE_25_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_25_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_26  ====================================================== */
#define ECLIC_CLICINTIE_26_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_26_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_27  ====================================================== */
#define ECLIC_CLICINTIE_27_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_27_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_28  ====================================================== */
#define ECLIC_CLICINTIE_28_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_28_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_29  ====================================================== */
#define ECLIC_CLICINTIE_29_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_29_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_30  ====================================================== */
#define ECLIC_CLICINTIE_30_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_30_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_31  ====================================================== */
