RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define ECLIC_CLICINTIE_31_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_31_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_32  ====================================================== */
#define ECLIC_CLICINTIE_32_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_32_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_33  ====================================================== */
#define ECLIC_CLICINTIE_33_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_33_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_34  ====================================================== */
#define ECLIC_CLICINTIE_34_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_34_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_35  ====================================================== */
#define ECLIC_CLICINTIE_35_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_35_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_36  ====================================================== */
#define ECLIC_CLICINTIE_36_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_36_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_37  ====================================================== */
#define ECLIC_CLICINTIE_37_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_37_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_38  ====================================================== */
#define ECLIC_CLICINTIE_38_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_38_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_39  ====================================================== */
#define ECLIC_CLICINTIE_39_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_39_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_40  ====================================================== */
#define ECLIC_CLICINTIE_40_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_40_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_41  ====================================================== */
#define ECLIC_CLICINTIE_41_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_41_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_42  ====================================================== */
#define ECLIC_CLICINTIE_42_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_42_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_43  ====================================================== */
#define ECLIC_CLICINTIE_43_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_43_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_44  ====================================================== */
#define ECLIC_CLICINTIE_44_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_44_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_45  ====================================================== */
#define ECLIC_CLICINTIE_45_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_45_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_46  ====================================================== */
#define ECLIC_CLICINTIE_46_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_46_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_47  ====================================================== */
#define ECLIC_CLICINTIE_47_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_47_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_48  ====================================================== */
#define ECLIC_CLICINTIE_48_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_48_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_49  ====================================================== */
#define ECLIC_CLICINTIE_49_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_49_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_50  ====================================================== */
#define ECLIC_CLICINTIE_50_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_50_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_51  ====================================================== */
#define ECLIC_CLICINTIE_51_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_51_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_52  ====================================================== */
#define ECLIC_CLICINTIE_52_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_52_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_53  ====================================================== */
#define ECLIC_CLICINTIE_53_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_53_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_54  ====================================================== */
#define ECLIC_CLICINTIE_54_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_54_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_55  ====================================================== */
#define ECLIC_CLICINTIE_55_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_55_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_56  ====================================================== */
#define ECLIC_CLICINTIE_56_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_56_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_57  ====================================================== */
#define ECLIC_CLICINTIE_57_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_57_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_58  ====================================================== */
#define ECLIC_CLICINTIE_58_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_58_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_59  ====================================================== */
#define ECLIC_CLICINTIE_59_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_59_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_60  ====================================================== */
#define ECLIC_CLICINTIE_60_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_60_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_61  ====================================================== */
#define ECLIC_CLICINTIE_61_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_61_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_62  ====================================================== */
#define ECLIC_CLICINTIE_62_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_62_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_63  ====================================================== */
#define ECLIC_CLICINTIE_63_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_63_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_64  ====================================================== */
#define ECLIC_CLICINTIE_64_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_64_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_65  ====================================================== */
#define ECLIC_CLICINTIE_65_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_65_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_66  ====================================================== */
#define ECLIC_CLICINTIE_66_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_66_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_67  ====================================================== */
#define ECLIC_CLICINTIE_67_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_67_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_68  ====================================================== */
#define ECLIC_CLICINTIE_68_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_68_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_69  ====================================================== */
#define ECLIC_CLICINTIE_69_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_69_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_70  ====================================================== */
#define ECLIC_CLICINTIE_70_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_70_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_71  ====================================================== */
#define ECLIC_CLICINTIE_71_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_71_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_72  ====================================================== */
#define ECLIC_CLICINTIE_72_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_72_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_73  ====================================================== */
#define ECLIC_CLICINTIE_73_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_73_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_74  ====================================================== */
#define ECLIC_CLICINTIE_74_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_74_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_75  ====================================================== */
#define ECLIC_CLICINTIE_75_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_75_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_76  ====================================================== */
#define ECLIC_CLICINTIE_76_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_76_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_77  ====================================================== */
#define ECLIC_CLICINTIE_77_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_77_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_78  ====================================================== */
#define ECLIC_CLICINTIE_78_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_78_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_79  ====================================================== */
#define ECLIC_CLICINTIE_79_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_79_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_80  ====================================================== */
#define ECLIC_CLICINTIE_80_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_80_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_81  ====================================================== */
#define ECLIC_CLICINTIE_81_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_81_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_82  ====================================================== */
#define ECLIC_CLICINTIE_82_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_82_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_83  ====================================================== */
#define ECLIC_CLICINTIE_83_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_83_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_84  ====================================================== */
#define ECLIC_CLICINTIE_84_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_84_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_85  ====================================================== */
#define ECLIC_CLICINTIE_85_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_85_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTIE_86  ====================================================== */
#define ECLIC_CLICINTIE_86_IE_Pos         (0UL)                     /*!< IE (Bit 0)                                            */
#define ECLIC_CLICINTIE_86_IE_Msk         (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =====================================================  CLICINTATTR_0  ===================================================== */
#define ECLIC_CLICINTATTR_0_SHV_Pos       (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_0_SHV_Msk       (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_0_TRIG_Pos      (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_0_TRIG_Msk      (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* =====================================================  CLICINTATTR_1  ===================================================== */
#define ECLIC_CLICINTATTR_1_SHV_Pos       (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_1_SHV_Msk       (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_1_TRIG_Pos      (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_1_TRIG_Msk      (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* =====================================================  CLICINTATTR_2  ===================================================== */
#define ECLIC_CLICINTATTR_2_SHV_Pos       (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_2_SHV_Msk       (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_2_TRIG_Pos      (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_2_TRIG_Msk      (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* =====================================================  CLICINTATTR_3  ===================================================== */
#define ECLIC_CLICINTATTR_3_SHV_Pos       (0UL)                     /*!< SHV (Bit 0)                                           */
