RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define ECLIC_CLICINTATTR_3_SHV_Msk       (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_3_TRIG_Pos      (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_3_TRIG_Msk      (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* =====================================================  CLICINTATTR_4  ===================================================== */
#define ECLIC_CLICINTATTR_4_SHV_Pos       (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_4_SHV_Msk       (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_4_TRIG_Pos      (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_4_TRIG_Msk      (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* =====================================================  CLICINTATTR_5  ===================================================== */
#define ECLIC_CLICINTATTR_5_SHV_Pos       (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_5_SHV_Msk       (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_5_TRIG_Pos      (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_5_TRIG_Msk      (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* =====================================================  CLICINTATTR_6  ===================================================== */
#define ECLIC_CLICINTATTR_6_SHV_Pos       (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_6_SHV_Msk       (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_6_TRIG_Pos      (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_6_TRIG_Msk      (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* =====================================================  CLICINTATTR_7  ===================================================== */
#define ECLIC_CLICINTATTR_7_SHV_Pos       (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_7_SHV_Msk       (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_7_TRIG_Pos      (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_7_TRIG_Msk      (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* =====================================================  CLICINTATTR_8  ===================================================== */
#define ECLIC_CLICINTATTR_8_SHV_Pos       (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_8_SHV_Msk       (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_8_TRIG_Pos      (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_8_TRIG_Msk      (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* =====================================================  CLICINTATTR_9  ===================================================== */
#define ECLIC_CLICINTATTR_9_SHV_Pos       (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_9_SHV_Msk       (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_9_TRIG_Pos      (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_9_TRIG_Msk      (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_10  ===================================================== */
#define ECLIC_CLICINTATTR_10_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_10_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_10_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_10_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_11  ===================================================== */
#define ECLIC_CLICINTATTR_11_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_11_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_11_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_11_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_12  ===================================================== */
#define ECLIC_CLICINTATTR_12_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_12_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_12_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_12_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_13  ===================================================== */
#define ECLIC_CLICINTATTR_13_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_13_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_13_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_13_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_14  ===================================================== */
#define ECLIC_CLICINTATTR_14_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_14_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_14_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_14_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_15  ===================================================== */
#define ECLIC_CLICINTATTR_15_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_15_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_15_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_15_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_16  ===================================================== */
#define ECLIC_CLICINTATTR_16_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_16_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_16_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_16_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_17  ===================================================== */
#define ECLIC_CLICINTATTR_17_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_17_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_17_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_17_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_18  ===================================================== */
#define ECLIC_CLICINTATTR_18_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_18_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_18_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_18_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_19  ===================================================== */
#define ECLIC_CLICINTATTR_19_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_19_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_19_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_19_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_20  ===================================================== */
#define ECLIC_CLICINTATTR_20_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_20_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_20_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_20_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_21  ===================================================== */
#define ECLIC_CLICINTATTR_21_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_21_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_21_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_21_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_22  ===================================================== */
#define ECLIC_CLICINTATTR_22_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_22_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_22_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_22_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_23  ===================================================== */
#define ECLIC_CLICINTATTR_23_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_23_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_23_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_23_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_24  ===================================================== */
#define ECLIC_CLICINTATTR_24_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_24_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_24_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_24_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_25  ===================================================== */
#define ECLIC_CLICINTATTR_25_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_25_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_25_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_25_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_26  ===================================================== */
#define ECLIC_CLICINTATTR_26_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_26_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_26_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_26_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_27  ===================================================== */
#define ECLIC_CLICINTATTR_27_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_27_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_27_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_27_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_28  ===================================================== */
#define ECLIC_CLICINTATTR_28_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_28_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_28_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_28_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_29  ===================================================== */
#define ECLIC_CLICINTATTR_29_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_29_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_29_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_29_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_30  ===================================================== */
#define ECLIC_CLICINTATTR_30_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_30_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_30_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_30_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_31  ===================================================== */
#define ECLIC_CLICINTATTR_31_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_31_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_31_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_31_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_32  ===================================================== */
#define ECLIC_CLICINTATTR_32_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_32_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_32_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_32_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_33  ===================================================== */
#define ECLIC_CLICINTATTR_33_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_33_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_33_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_33_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_34  ===================================================== */
#define ECLIC_CLICINTATTR_34_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_34_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_34_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_34_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_35  ===================================================== */
#define ECLIC_CLICINTATTR_35_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_35_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_35_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_35_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_36  ===================================================== */
#define ECLIC_CLICINTATTR_36_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_36_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_36_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_36_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_37  ===================================================== */
#define ECLIC_CLICINTATTR_37_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_37_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_37_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_37_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_38  ===================================================== */
#define ECLIC_CLICINTATTR_38_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_38_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_38_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_38_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_39  ===================================================== */
#define ECLIC_CLICINTATTR_39_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_39_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_39_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_39_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_40  ===================================================== */
