RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define ECLIC_CLICINTATTR_40_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_40_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_40_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_40_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_41  ===================================================== */
#define ECLIC_CLICINTATTR_41_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_41_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_41_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_41_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_42  ===================================================== */
#define ECLIC_CLICINTATTR_42_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_42_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_42_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_42_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_43  ===================================================== */
#define ECLIC_CLICINTATTR_43_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_43_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_43_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_43_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_44  ===================================================== */
#define ECLIC_CLICINTATTR_44_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_44_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_44_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_44_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_45  ===================================================== */
#define ECLIC_CLICINTATTR_45_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_45_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_45_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_45_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_46  ===================================================== */
#define ECLIC_CLICINTATTR_46_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_46_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_46_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_46_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_47  ===================================================== */
#define ECLIC_CLICINTATTR_47_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_47_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_47_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_47_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_48  ===================================================== */
#define ECLIC_CLICINTATTR_48_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_48_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_48_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_48_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_49  ===================================================== */
#define ECLIC_CLICINTATTR_49_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_49_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_49_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_49_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_50  ===================================================== */
#define ECLIC_CLICINTATTR_50_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_50_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_50_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_50_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_51  ===================================================== */
#define ECLIC_CLICINTATTR_51_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_51_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_51_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_51_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_52  ===================================================== */
#define ECLIC_CLICINTATTR_52_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_52_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_52_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_52_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_53  ===================================================== */
#define ECLIC_CLICINTATTR_53_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_53_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_53_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_53_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_54  ===================================================== */
#define ECLIC_CLICINTATTR_54_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_54_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_54_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_54_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_55  ===================================================== */
#define ECLIC_CLICINTATTR_55_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_55_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_55_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_55_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_56  ===================================================== */
#define ECLIC_CLICINTATTR_56_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_56_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_56_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_56_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_57  ===================================================== */
#define ECLIC_CLICINTATTR_57_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_57_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_57_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_57_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_58  ===================================================== */
#define ECLIC_CLICINTATTR_58_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_58_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_58_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_58_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_59  ===================================================== */
#define ECLIC_CLICINTATTR_59_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_59_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_59_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_59_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_60  ===================================================== */
#define ECLIC_CLICINTATTR_60_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_60_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_60_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_60_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_61  ===================================================== */
#define ECLIC_CLICINTATTR_61_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_61_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_61_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_61_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_62  ===================================================== */
#define ECLIC_CLICINTATTR_62_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_62_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_62_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_62_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_63  ===================================================== */
#define ECLIC_CLICINTATTR_63_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_63_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_63_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_63_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_64  ===================================================== */
#define ECLIC_CLICINTATTR_64_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_64_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_64_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_64_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_65  ===================================================== */
#define ECLIC_CLICINTATTR_65_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_65_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_65_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_65_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_66  ===================================================== */
#define ECLIC_CLICINTATTR_66_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_66_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_66_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_66_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_67  ===================================================== */
#define ECLIC_CLICINTATTR_67_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_67_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_67_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_67_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_68  ===================================================== */
#define ECLIC_CLICINTATTR_68_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_68_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_68_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_68_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_69  ===================================================== */
#define ECLIC_CLICINTATTR_69_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_69_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_69_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_69_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_70  ===================================================== */
#define ECLIC_CLICINTATTR_70_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_70_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_70_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_70_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_71  ===================================================== */
#define ECLIC_CLICINTATTR_71_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_71_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_71_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_71_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_72  ===================================================== */
#define ECLIC_CLICINTATTR_72_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_72_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_72_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_72_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_73  ===================================================== */
#define ECLIC_CLICINTATTR_73_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_73_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_73_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_73_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_74  ===================================================== */
#define ECLIC_CLICINTATTR_74_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_74_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_74_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_74_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_75  ===================================================== */
#define ECLIC_CLICINTATTR_75_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_75_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_75_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_75_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_76  ===================================================== */
#define ECLIC_CLICINTATTR_76_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_76_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_76_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_76_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
