RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* ====================================================  CLICINTATTR_77  ===================================================== */
#define ECLIC_CLICINTATTR_77_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_77_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_77_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_77_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_78  ===================================================== */
#define ECLIC_CLICINTATTR_78_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_78_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_78_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_78_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_79  ===================================================== */
#define ECLIC_CLICINTATTR_79_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_79_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_79_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_79_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_80  ===================================================== */
#define ECLIC_CLICINTATTR_80_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_80_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_80_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_80_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_81  ===================================================== */
#define ECLIC_CLICINTATTR_81_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_81_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_81_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_81_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_82  ===================================================== */
#define ECLIC_CLICINTATTR_82_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_82_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_82_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_82_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_83  ===================================================== */
#define ECLIC_CLICINTATTR_83_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_83_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_83_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_83_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_84  ===================================================== */
#define ECLIC_CLICINTATTR_84_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_84_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_84_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_84_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_85  ===================================================== */
#define ECLIC_CLICINTATTR_85_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_85_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_85_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_85_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* ====================================================  CLICINTATTR_86  ===================================================== */
#define ECLIC_CLICINTATTR_86_SHV_Pos      (0UL)                     /*!< SHV (Bit 0)                                           */
#define ECLIC_CLICINTATTR_86_SHV_Msk      (0x1UL)                   /*!< SHV (Bitfield-Mask: 0x01)                             */
#define ECLIC_CLICINTATTR_86_TRIG_Pos     (1UL)                     /*!< TRIG (Bit 1)                                          */
#define ECLIC_CLICINTATTR_86_TRIG_Msk     (0x6UL)                   /*!< TRIG (Bitfield-Mask: 0x03)                            */
/* =====================================================  CLICINTCTL_0  ====================================================== */
#define ECLIC_CLICINTCTL_0_LEVEL_PRIORITY_Pos (0UL)                 /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_0_LEVEL_PRIORITY_Msk (0xffUL)              /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_1  ====================================================== */
#define ECLIC_CLICINTCTL_1_LEVEL_PRIORITY_Pos (0UL)                 /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_1_LEVEL_PRIORITY_Msk (0xffUL)              /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_2  ====================================================== */
#define ECLIC_CLICINTCTL_2_LEVEL_PRIORITY_Pos (0UL)                 /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_2_LEVEL_PRIORITY_Msk (0xffUL)              /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_3  ====================================================== */
#define ECLIC_CLICINTCTL_3_LEVEL_PRIORITY_Pos (0UL)                 /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_3_LEVEL_PRIORITY_Msk (0xffUL)              /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_4  ====================================================== */
#define ECLIC_CLICINTCTL_4_LEVEL_PRIORITY_Pos (0UL)                 /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_4_LEVEL_PRIORITY_Msk (0xffUL)              /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_5  ====================================================== */
#define ECLIC_CLICINTCTL_5_LEVEL_PRIORITY_Pos (0UL)                 /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_5_LEVEL_PRIORITY_Msk (0xffUL)              /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_6  ====================================================== */
#define ECLIC_CLICINTCTL_6_LEVEL_PRIORITY_Pos (0UL)                 /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_6_LEVEL_PRIORITY_Msk (0xffUL)              /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_7  ====================================================== */
#define ECLIC_CLICINTCTL_7_LEVEL_PRIORITY_Pos (0UL)                 /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_7_LEVEL_PRIORITY_Msk (0xffUL)              /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_8  ====================================================== */
#define ECLIC_CLICINTCTL_8_LEVEL_PRIORITY_Pos (0UL)                 /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_8_LEVEL_PRIORITY_Msk (0xffUL)              /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_9  ====================================================== */
#define ECLIC_CLICINTCTL_9_LEVEL_PRIORITY_Pos (0UL)                 /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_9_LEVEL_PRIORITY_Msk (0xffUL)              /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_10  ===================================================== */
#define ECLIC_CLICINTCTL_10_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_10_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_11  ===================================================== */
#define ECLIC_CLICINTCTL_11_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_11_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_12  ===================================================== */
#define ECLIC_CLICINTCTL_12_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_12_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_13  ===================================================== */
#define ECLIC_CLICINTCTL_13_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_13_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_14  ===================================================== */
#define ECLIC_CLICINTCTL_14_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_14_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_15  ===================================================== */
#define ECLIC_CLICINTCTL_15_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_15_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_16  ===================================================== */
#define ECLIC_CLICINTCTL_16_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_16_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_17  ===================================================== */
#define ECLIC_CLICINTCTL_17_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_17_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_18  ===================================================== */
#define ECLIC_CLICINTCTL_18_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_18_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_19  ===================================================== */
#define ECLIC_CLICINTCTL_19_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_19_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_20  ===================================================== */
#define ECLIC_CLICINTCTL_20_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_20_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_21  ===================================================== */
#define ECLIC_CLICINTCTL_21_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_21_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_22  ===================================================== */
#define ECLIC_CLICINTCTL_22_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_22_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_23  ===================================================== */
#define ECLIC_CLICINTCTL_23_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_23_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_24  ===================================================== */
#define ECLIC_CLICINTCTL_24_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_24_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_25  ===================================================== */
#define ECLIC_CLICINTCTL_25_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_25_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_26  ===================================================== */
#define ECLIC_CLICINTCTL_26_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_26_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_27  ===================================================== */
#define ECLIC_CLICINTCTL_27_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_27_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_28  ===================================================== */
#define ECLIC_CLICINTCTL_28_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_28_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_29  ===================================================== */
#define ECLIC_CLICINTCTL_29_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_29_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_30  ===================================================== */
#define ECLIC_CLICINTCTL_30_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_30_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_31  ===================================================== */
#define ECLIC_CLICINTCTL_31_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_31_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_32  ===================================================== */
#define ECLIC_CLICINTCTL_32_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_32_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_33  ===================================================== */
#define ECLIC_CLICINTCTL_33_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_33_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_34  ===================================================== */
#define ECLIC_CLICINTCTL_34_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_34_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_35  ===================================================== */
#define ECLIC_CLICINTCTL_35_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_35_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_36  ===================================================== */
#define ECLIC_CLICINTCTL_36_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_36_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_37  ===================================================== */
#define ECLIC_CLICINTCTL_37_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_37_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_38  ===================================================== */
#define ECLIC_CLICINTCTL_38_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_38_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_39  ===================================================== */
#define ECLIC_CLICINTCTL_39_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_39_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_40  ===================================================== */
#define ECLIC_CLICINTCTL_40_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_40_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_41  ===================================================== */
#define ECLIC_CLICINTCTL_41_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_41_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_42  ===================================================== */
#define ECLIC_CLICINTCTL_42_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_42_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_43  ===================================================== */
#define ECLIC_CLICINTCTL_43_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_43_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_44  ===================================================== */
#define ECLIC_CLICINTCTL_44_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
