RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define ECLIC_CLICINTCTL_44_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_45  ===================================================== */
#define ECLIC_CLICINTCTL_45_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_45_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_46  ===================================================== */
#define ECLIC_CLICINTCTL_46_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_46_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_47  ===================================================== */
#define ECLIC_CLICINTCTL_47_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_47_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_48  ===================================================== */
#define ECLIC_CLICINTCTL_48_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_48_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_49  ===================================================== */
#define ECLIC_CLICINTCTL_49_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_49_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_50  ===================================================== */
#define ECLIC_CLICINTCTL_50_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_50_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_51  ===================================================== */
#define ECLIC_CLICINTCTL_51_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_51_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_52  ===================================================== */
#define ECLIC_CLICINTCTL_52_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_52_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_53  ===================================================== */
#define ECLIC_CLICINTCTL_53_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_53_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_54  ===================================================== */
#define ECLIC_CLICINTCTL_54_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_54_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_55  ===================================================== */
#define ECLIC_CLICINTCTL_55_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_55_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_56  ===================================================== */
#define ECLIC_CLICINTCTL_56_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_56_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_57  ===================================================== */
#define ECLIC_CLICINTCTL_57_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_57_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_58  ===================================================== */
#define ECLIC_CLICINTCTL_58_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_58_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_59  ===================================================== */
#define ECLIC_CLICINTCTL_59_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_59_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_60  ===================================================== */
#define ECLIC_CLICINTCTL_60_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_60_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_61  ===================================================== */
#define ECLIC_CLICINTCTL_61_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_61_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_62  ===================================================== */
#define ECLIC_CLICINTCTL_62_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_62_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_63  ===================================================== */
#define ECLIC_CLICINTCTL_63_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_63_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_64  ===================================================== */
#define ECLIC_CLICINTCTL_64_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_64_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_65  ===================================================== */
#define ECLIC_CLICINTCTL_65_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_65_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_66  ===================================================== */
#define ECLIC_CLICINTCTL_66_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_66_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_67  ===================================================== */
#define ECLIC_CLICINTCTL_67_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_67_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_68  ===================================================== */
#define ECLIC_CLICINTCTL_68_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_68_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_69  ===================================================== */
#define ECLIC_CLICINTCTL_69_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_69_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_70  ===================================================== */
#define ECLIC_CLICINTCTL_70_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_70_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_71  ===================================================== */
#define ECLIC_CLICINTCTL_71_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_71_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_72  ===================================================== */
#define ECLIC_CLICINTCTL_72_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_72_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_73  ===================================================== */
#define ECLIC_CLICINTCTL_73_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_73_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_74  ===================================================== */
#define ECLIC_CLICINTCTL_74_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_74_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_75  ===================================================== */
#define ECLIC_CLICINTCTL_75_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_75_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_76  ===================================================== */
#define ECLIC_CLICINTCTL_76_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_76_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_77  ===================================================== */
#define ECLIC_CLICINTCTL_77_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_77_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_78  ===================================================== */
#define ECLIC_CLICINTCTL_78_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_78_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_79  ===================================================== */
#define ECLIC_CLICINTCTL_79_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_79_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_80  ===================================================== */
#define ECLIC_CLICINTCTL_80_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_80_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_81  ===================================================== */
#define ECLIC_CLICINTCTL_81_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_81_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_82  ===================================================== */
#define ECLIC_CLICINTCTL_82_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_82_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_83  ===================================================== */
#define ECLIC_CLICINTCTL_83_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_83_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_84  ===================================================== */
#define ECLIC_CLICINTCTL_84_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_84_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_85  ===================================================== */
#define ECLIC_CLICINTCTL_85_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_85_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */
/* =====================================================  CLICINTCTL_86  ===================================================== */
#define ECLIC_CLICINTCTL_86_LEVEL_PRIORITY_Pos (0UL)                /*!< LEVEL_PRIORITY (Bit 0)                                */
#define ECLIC_CLICINTCTL_86_LEVEL_PRIORITY_Msk (0xffUL)             /*!< LEVEL_PRIORITY (Bitfield-Mask: 0xff)                  */


/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CTL  ========================================================== */
#define PMU_CTL_BKPWEN_Pos                (8UL)                     /*!< BKPWEN (Bit 8)                                        */
#define PMU_CTL_BKPWEN_Msk                (0x100UL)                 /*!< BKPWEN (Bitfield-Mask: 0x01)                          */
#define PMU_CTL_LVDT_Pos                  (5UL)                     /*!< LVDT (Bit 5)                                          */
#define PMU_CTL_LVDT_Msk                  (0xe0UL)                  /*!< LVDT (Bitfield-Mask: 0x07)                            */
#define PMU_CTL_LVDEN_Pos                 (4UL)                     /*!< LVDEN (Bit 4)                                         */
#define PMU_CTL_LVDEN_Msk                 (0x10UL)                  /*!< LVDEN (Bitfield-Mask: 0x01)                           */
#define PMU_CTL_STBRST_Pos                (3UL)                     /*!< STBRST (Bit 3)                                        */
#define PMU_CTL_STBRST_Msk                (0x8UL)                   /*!< STBRST (Bitfield-Mask: 0x01)                          */
#define PMU_CTL_WURST_Pos                 (2UL)                     /*!< WURST (Bit 2)                                         */
#define PMU_CTL_WURST_Msk                 (0x4UL)                   /*!< WURST (Bitfield-Mask: 0x01)                           */
#define PMU_CTL_STBMOD_Pos                (1UL)                     /*!< STBMOD (Bit 1)                                        */
#define PMU_CTL_STBMOD_Msk                (0x2UL)                   /*!< STBMOD (Bitfield-Mask: 0x01)                          */
#define PMU_CTL_LDOLP_Pos                 (0UL)                     /*!< LDOLP (Bit 0)                                         */
#define PMU_CTL_LDOLP_Msk                 (0x1UL)                   /*!< LDOLP (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CS  =========================================================== */
#define PMU_CS_WUPEN_Pos                  (8UL)                     /*!< WUPEN (Bit 8)                                         */
#define PMU_CS_WUPEN_Msk                  (0x100UL)                 /*!< WUPEN (Bitfield-Mask: 0x01)                           */
#define PMU_CS_LVDF_Pos                   (2UL)                     /*!< LVDF (Bit 2)                                          */
#define PMU_CS_LVDF_Msk                   (0x4UL)                   /*!< LVDF (Bitfield-Mask: 0x01)                            */
#define PMU_CS_STBF_Pos                   (1UL)                     /*!< STBF (Bit 1)                                          */
#define PMU_CS_STBF_Msk                   (0x2UL)                   /*!< STBF (Bitfield-Mask: 0x01)                            */
#define PMU_CS_WUF_Pos                    (0UL)                     /*!< WUF (Bit 0)                                           */
#define PMU_CS_WUF_Msk                    (0x1UL)                   /*!< WUF (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                            RCU                                            ================ */
/* =========================================================================================================================== */

