RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* ==========================================================  CTL  ========================================================== */
#define RCU_CTL_IRC8MEN_Pos               (0UL)                     /*!< IRC8MEN (Bit 0)                                       */
#define RCU_CTL_IRC8MEN_Msk               (0x1UL)                   /*!< IRC8MEN (Bitfield-Mask: 0x01)                         */
#define RCU_CTL_IRC8MSTB_Pos              (1UL)                     /*!< IRC8MSTB (Bit 1)                                      */
#define RCU_CTL_IRC8MSTB_Msk              (0x2UL)                   /*!< IRC8MSTB (Bitfield-Mask: 0x01)                        */
#define RCU_CTL_IRC8MADJ_Pos              (3UL)                     /*!< IRC8MADJ (Bit 3)                                      */
#define RCU_CTL_IRC8MADJ_Msk              (0xf8UL)                  /*!< IRC8MADJ (Bitfield-Mask: 0x1f)                        */
#define RCU_CTL_IRC8MCALIB_Pos            (8UL)                     /*!< IRC8MCALIB (Bit 8)                                    */
#define RCU_CTL_IRC8MCALIB_Msk            (0xff00UL)                /*!< IRC8MCALIB (Bitfield-Mask: 0xff)                      */
#define RCU_CTL_HXTALEN_Pos               (16UL)                    /*!< HXTALEN (Bit 16)                                      */
#define RCU_CTL_HXTALEN_Msk               (0x10000UL)               /*!< HXTALEN (Bitfield-Mask: 0x01)                         */
#define RCU_CTL_HXTALSTB_Pos              (17UL)                    /*!< HXTALSTB (Bit 17)                                     */
#define RCU_CTL_HXTALSTB_Msk              (0x20000UL)               /*!< HXTALSTB (Bitfield-Mask: 0x01)                        */
#define RCU_CTL_HXTALBPS_Pos              (18UL)                    /*!< HXTALBPS (Bit 18)                                     */
#define RCU_CTL_HXTALBPS_Msk              (0x40000UL)               /*!< HXTALBPS (Bitfield-Mask: 0x01)                        */
#define RCU_CTL_CKMEN_Pos                 (19UL)                    /*!< CKMEN (Bit 19)                                        */
#define RCU_CTL_CKMEN_Msk                 (0x80000UL)               /*!< CKMEN (Bitfield-Mask: 0x01)                           */
#define RCU_CTL_PLLEN_Pos                 (24UL)                    /*!< PLLEN (Bit 24)                                        */
#define RCU_CTL_PLLEN_Msk                 (0x1000000UL)             /*!< PLLEN (Bitfield-Mask: 0x01)                           */
#define RCU_CTL_PLLSTB_Pos                (25UL)                    /*!< PLLSTB (Bit 25)                                       */
#define RCU_CTL_PLLSTB_Msk                (0x2000000UL)             /*!< PLLSTB (Bitfield-Mask: 0x01)                          */
#define RCU_CTL_PLL1EN_Pos                (26UL)                    /*!< PLL1EN (Bit 26)                                       */
#define RCU_CTL_PLL1EN_Msk                (0x4000000UL)             /*!< PLL1EN (Bitfield-Mask: 0x01)                          */
#define RCU_CTL_PLL1STB_Pos               (27UL)                    /*!< PLL1STB (Bit 27)                                      */
#define RCU_CTL_PLL1STB_Msk               (0x8000000UL)             /*!< PLL1STB (Bitfield-Mask: 0x01)                         */
#define RCU_CTL_PLL2EN_Pos                (28UL)                    /*!< PLL2EN (Bit 28)                                       */
#define RCU_CTL_PLL2EN_Msk                (0x10000000UL)            /*!< PLL2EN (Bitfield-Mask: 0x01)                          */
#define RCU_CTL_PLL2STB_Pos               (29UL)                    /*!< PLL2STB (Bit 29)                                      */
#define RCU_CTL_PLL2STB_Msk               (0x20000000UL)            /*!< PLL2STB (Bitfield-Mask: 0x01)                         */
/* =========================================================  CFG0  ========================================================== */
#define RCU_CFG0_SCS_Pos                  (0UL)                     /*!< SCS (Bit 0)                                           */
#define RCU_CFG0_SCS_Msk                  (0x3UL)                   /*!< SCS (Bitfield-Mask: 0x03)                             */
#define RCU_CFG0_SCSS_Pos                 (2UL)                     /*!< SCSS (Bit 2)                                          */
#define RCU_CFG0_SCSS_Msk                 (0xcUL)                   /*!< SCSS (Bitfield-Mask: 0x03)                            */
#define RCU_CFG0_AHBPSC_Pos               (4UL)                     /*!< AHBPSC (Bit 4)                                        */
#define RCU_CFG0_AHBPSC_Msk               (0xf0UL)                  /*!< AHBPSC (Bitfield-Mask: 0x0f)                          */
#define RCU_CFG0_APB1PSC_Pos              (8UL)                     /*!< APB1PSC (Bit 8)                                       */
#define RCU_CFG0_APB1PSC_Msk              (0x700UL)                 /*!< APB1PSC (Bitfield-Mask: 0x07)                         */
#define RCU_CFG0_APB2PSC_Pos              (11UL)                    /*!< APB2PSC (Bit 11)                                      */
#define RCU_CFG0_APB2PSC_Msk              (0x3800UL)                /*!< APB2PSC (Bitfield-Mask: 0x07)                         */
#define RCU_CFG0_ADCPSC_1_0_Pos           (14UL)                    /*!< ADCPSC_1_0 (Bit 14)                                   */
#define RCU_CFG0_ADCPSC_1_0_Msk           (0xc000UL)                /*!< ADCPSC_1_0 (Bitfield-Mask: 0x03)                      */
#define RCU_CFG0_PLLSEL_Pos               (16UL)                    /*!< PLLSEL (Bit 16)                                       */
#define RCU_CFG0_PLLSEL_Msk               (0x10000UL)               /*!< PLLSEL (Bitfield-Mask: 0x01)                          */
#define RCU_CFG0_PREDV0_LSB_Pos           (17UL)                    /*!< PREDV0_LSB (Bit 17)                                   */
#define RCU_CFG0_PREDV0_LSB_Msk           (0x20000UL)               /*!< PREDV0_LSB (Bitfield-Mask: 0x01)                      */
#define RCU_CFG0_PLLMF_3_0_Pos            (18UL)                    /*!< PLLMF_3_0 (Bit 18)                                    */
#define RCU_CFG0_PLLMF_3_0_Msk            (0x3c0000UL)              /*!< PLLMF_3_0 (Bitfield-Mask: 0x0f)                       */
#define RCU_CFG0_USBFSPSC_Pos             (22UL)                    /*!< USBFSPSC (Bit 22)                                     */
#define RCU_CFG0_USBFSPSC_Msk             (0xc00000UL)              /*!< USBFSPSC (Bitfield-Mask: 0x03)                        */
#define RCU_CFG0_CKOUT0SEL_Pos            (24UL)                    /*!< CKOUT0SEL (Bit 24)                                    */
#define RCU_CFG0_CKOUT0SEL_Msk            (0xf000000UL)             /*!< CKOUT0SEL (Bitfield-Mask: 0x0f)                       */
#define RCU_CFG0_ADCPSC_2_Pos             (28UL)                    /*!< ADCPSC_2 (Bit 28)                                     */
#define RCU_CFG0_ADCPSC_2_Msk             (0x10000000UL)            /*!< ADCPSC_2 (Bitfield-Mask: 0x01)                        */
#define RCU_CFG0_PLLMF_4_Pos              (29UL)                    /*!< PLLMF_4 (Bit 29)                                      */
#define RCU_CFG0_PLLMF_4_Msk              (0x20000000UL)            /*!< PLLMF_4 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  INT  ========================================================== */
#define RCU_INT_IRC40KSTBIF_Pos           (0UL)                     /*!< IRC40KSTBIF (Bit 0)                                   */
#define RCU_INT_IRC40KSTBIF_Msk           (0x1UL)                   /*!< IRC40KSTBIF (Bitfield-Mask: 0x01)                     */
#define RCU_INT_LXTALSTBIF_Pos            (1UL)                     /*!< LXTALSTBIF (Bit 1)                                    */
#define RCU_INT_LXTALSTBIF_Msk            (0x2UL)                   /*!< LXTALSTBIF (Bitfield-Mask: 0x01)                      */
#define RCU_INT_IRC8MSTBIF_Pos            (2UL)                     /*!< IRC8MSTBIF (Bit 2)                                    */
#define RCU_INT_IRC8MSTBIF_Msk            (0x4UL)                   /*!< IRC8MSTBIF (Bitfield-Mask: 0x01)                      */
#define RCU_INT_HXTALSTBIF_Pos            (3UL)                     /*!< HXTALSTBIF (Bit 3)                                    */
#define RCU_INT_HXTALSTBIF_Msk            (0x8UL)                   /*!< HXTALSTBIF (Bitfield-Mask: 0x01)                      */
#define RCU_INT_PLLSTBIF_Pos              (4UL)                     /*!< PLLSTBIF (Bit 4)                                      */
#define RCU_INT_PLLSTBIF_Msk              (0x10UL)                  /*!< PLLSTBIF (Bitfield-Mask: 0x01)                        */
#define RCU_INT_PLL1STBIF_Pos             (5UL)                     /*!< PLL1STBIF (Bit 5)                                     */
#define RCU_INT_PLL1STBIF_Msk             (0x20UL)                  /*!< PLL1STBIF (Bitfield-Mask: 0x01)                       */
#define RCU_INT_PLL2STBIF_Pos             (6UL)                     /*!< PLL2STBIF (Bit 6)                                     */
#define RCU_INT_PLL2STBIF_Msk             (0x40UL)                  /*!< PLL2STBIF (Bitfield-Mask: 0x01)                       */
#define RCU_INT_CKMIF_Pos                 (7UL)                     /*!< CKMIF (Bit 7)                                         */
#define RCU_INT_CKMIF_Msk                 (0x80UL)                  /*!< CKMIF (Bitfield-Mask: 0x01)                           */
#define RCU_INT_IRC40KSTBIE_Pos           (8UL)                     /*!< IRC40KSTBIE (Bit 8)                                   */
#define RCU_INT_IRC40KSTBIE_Msk           (0x100UL)                 /*!< IRC40KSTBIE (Bitfield-Mask: 0x01)                     */
#define RCU_INT_LXTALSTBIE_Pos            (9UL)                     /*!< LXTALSTBIE (Bit 9)                                    */
#define RCU_INT_LXTALSTBIE_Msk            (0x200UL)                 /*!< LXTALSTBIE (Bitfield-Mask: 0x01)                      */
#define RCU_INT_IRC8MSTBIE_Pos            (10UL)                    /*!< IRC8MSTBIE (Bit 10)                                   */
#define RCU_INT_IRC8MSTBIE_Msk            (0x400UL)                 /*!< IRC8MSTBIE (Bitfield-Mask: 0x01)                      */
#define RCU_INT_HXTALSTBIE_Pos            (11UL)                    /*!< HXTALSTBIE (Bit 11)                                   */
#define RCU_INT_HXTALSTBIE_Msk            (0x800UL)                 /*!< HXTALSTBIE (Bitfield-Mask: 0x01)                      */
#define RCU_INT_PLLSTBIE_Pos              (12UL)                    /*!< PLLSTBIE (Bit 12)                                     */
#define RCU_INT_PLLSTBIE_Msk              (0x1000UL)                /*!< PLLSTBIE (Bitfield-Mask: 0x01)                        */
#define RCU_INT_PLL1STBIE_Pos             (13UL)                    /*!< PLL1STBIE (Bit 13)                                    */
#define RCU_INT_PLL1STBIE_Msk             (0x2000UL)                /*!< PLL1STBIE (Bitfield-Mask: 0x01)                       */
#define RCU_INT_PLL2STBIE_Pos             (14UL)                    /*!< PLL2STBIE (Bit 14)                                    */
#define RCU_INT_PLL2STBIE_Msk             (0x4000UL)                /*!< PLL2STBIE (Bitfield-Mask: 0x01)                       */
#define RCU_INT_IRC40KSTBIC_Pos           (16UL)                    /*!< IRC40KSTBIC (Bit 16)                                  */
#define RCU_INT_IRC40KSTBIC_Msk           (0x10000UL)               /*!< IRC40KSTBIC (Bitfield-Mask: 0x01)                     */
#define RCU_INT_LXTALSTBIC_Pos            (17UL)                    /*!< LXTALSTBIC (Bit 17)                                   */
#define RCU_INT_LXTALSTBIC_Msk            (0x20000UL)               /*!< LXTALSTBIC (Bitfield-Mask: 0x01)                      */
#define RCU_INT_IRC8MSTBIC_Pos            (18UL)                    /*!< IRC8MSTBIC (Bit 18)                                   */
#define RCU_INT_IRC8MSTBIC_Msk            (0x40000UL)               /*!< IRC8MSTBIC (Bitfield-Mask: 0x01)                      */
#define RCU_INT_HXTALSTBIC_Pos            (19UL)                    /*!< HXTALSTBIC (Bit 19)                                   */
#define RCU_INT_HXTALSTBIC_Msk            (0x80000UL)               /*!< HXTALSTBIC (Bitfield-Mask: 0x01)                      */
#define RCU_INT_PLLSTBIC_Pos              (20UL)                    /*!< PLLSTBIC (Bit 20)                                     */
#define RCU_INT_PLLSTBIC_Msk              (0x100000UL)              /*!< PLLSTBIC (Bitfield-Mask: 0x01)                        */
#define RCU_INT_PLL1STBIC_Pos             (21UL)                    /*!< PLL1STBIC (Bit 21)                                    */
#define RCU_INT_PLL1STBIC_Msk             (0x200000UL)              /*!< PLL1STBIC (Bitfield-Mask: 0x01)                       */
#define RCU_INT_PLL2STBIC_Pos             (22UL)                    /*!< PLL2STBIC (Bit 22)                                    */
#define RCU_INT_PLL2STBIC_Msk             (0x400000UL)              /*!< PLL2STBIC (Bitfield-Mask: 0x01)                       */
#define RCU_INT_CKMIC_Pos                 (23UL)                    /*!< CKMIC (Bit 23)                                        */
#define RCU_INT_CKMIC_Msk                 (0x800000UL)              /*!< CKMIC (Bitfield-Mask: 0x01)                           */
/* ========================================================  APB2RST  ======================================================== */
#define RCU_APB2RST_AFRST_Pos             (0UL)                     /*!< AFRST (Bit 0)                                         */
#define RCU_APB2RST_AFRST_Msk             (0x1UL)                   /*!< AFRST (Bitfield-Mask: 0x01)                           */
#define RCU_APB2RST_PARST_Pos             (2UL)                     /*!< PARST (Bit 2)                                         */
#define RCU_APB2RST_PARST_Msk             (0x4UL)                   /*!< PARST (Bitfield-Mask: 0x01)                           */
#define RCU_APB2RST_PBRST_Pos             (3UL)                     /*!< PBRST (Bit 3)                                         */
#define RCU_APB2RST_PBRST_Msk             (0x8UL)                   /*!< PBRST (Bitfield-Mask: 0x01)                           */
#define RCU_APB2RST_PCRST_Pos             (4UL)                     /*!< PCRST (Bit 4)                                         */
#define RCU_APB2RST_PCRST_Msk             (0x10UL)                  /*!< PCRST (Bitfield-Mask: 0x01)                           */
#define RCU_APB2RST_PDRST_Pos             (5UL)                     /*!< PDRST (Bit 5)                                         */
#define RCU_APB2RST_PDRST_Msk             (0x20UL)                  /*!< PDRST (Bitfield-Mask: 0x01)                           */
#define RCU_APB2RST_PERST_Pos             (6UL)                     /*!< PERST (Bit 6)                                         */
#define RCU_APB2RST_PERST_Msk             (0x40UL)                  /*!< PERST (Bitfield-Mask: 0x01)                           */
#define RCU_APB2RST_ADC0RST_Pos           (9UL)                     /*!< ADC0RST (Bit 9)                                       */
#define RCU_APB2RST_ADC0RST_Msk           (0x200UL)                 /*!< ADC0RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB2RST_ADC1RST_Pos           (10UL)                    /*!< ADC1RST (Bit 10)                                      */
#define RCU_APB2RST_ADC1RST_Msk           (0x400UL)                 /*!< ADC1RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB2RST_TIMER0RST_Pos         (11UL)                    /*!< TIMER0RST (Bit 11)                                    */
#define RCU_APB2RST_TIMER0RST_Msk         (0x800UL)                 /*!< TIMER0RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB2RST_SPI0RST_Pos           (12UL)                    /*!< SPI0RST (Bit 12)                                      */
#define RCU_APB2RST_SPI0RST_Msk           (0x1000UL)                /*!< SPI0RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB2RST_USART0RST_Pos         (14UL)                    /*!< USART0RST (Bit 14)                                    */
#define RCU_APB2RST_USART0RST_Msk         (0x4000UL)                /*!< USART0RST (Bitfield-Mask: 0x01)                       */
/* ========================================================  APB1RST  ======================================================== */
#define RCU_APB1RST_TIMER1RST_Pos         (0UL)                     /*!< TIMER1RST (Bit 0)                                     */
#define RCU_APB1RST_TIMER1RST_Msk         (0x1UL)                   /*!< TIMER1RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB1RST_TIMER2RST_Pos         (1UL)                     /*!< TIMER2RST (Bit 1)                                     */
#define RCU_APB1RST_TIMER2RST_Msk         (0x2UL)                   /*!< TIMER2RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB1RST_TIMER3RST_Pos         (2UL)                     /*!< TIMER3RST (Bit 2)                                     */
#define RCU_APB1RST_TIMER3RST_Msk         (0x4UL)                   /*!< TIMER3RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB1RST_TIMER4RST_Pos         (3UL)                     /*!< TIMER4RST (Bit 3)                                     */
#define RCU_APB1RST_TIMER4RST_Msk         (0x8UL)                   /*!< TIMER4RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB1RST_TIMER5RST_Pos         (4UL)                     /*!< TIMER5RST (Bit 4)                                     */
#define RCU_APB1RST_TIMER5RST_Msk         (0x10UL)                  /*!< TIMER5RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB1RST_TIMER6RST_Pos         (5UL)                     /*!< TIMER6RST (Bit 5)                                     */
#define RCU_APB1RST_TIMER6RST_Msk         (0x20UL)                  /*!< TIMER6RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB1RST_WWDGTRST_Pos          (11UL)                    /*!< WWDGTRST (Bit 11)                                     */
#define RCU_APB1RST_WWDGTRST_Msk          (0x800UL)                 /*!< WWDGTRST (Bitfield-Mask: 0x01)                        */
#define RCU_APB1RST_SPI1RST_Pos           (14UL)                    /*!< SPI1RST (Bit 14)                                      */
#define RCU_APB1RST_SPI1RST_Msk           (0x4000UL)                /*!< SPI1RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB1RST_SPI2RST_Pos           (15UL)                    /*!< SPI2RST (Bit 15)                                      */
#define RCU_APB1RST_SPI2RST_Msk           (0x8000UL)                /*!< SPI2RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB1RST_USART1RST_Pos         (17UL)                    /*!< USART1RST (Bit 17)                                    */
#define RCU_APB1RST_USART1RST_Msk         (0x20000UL)               /*!< USART1RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB1RST_USART2RST_Pos         (18UL)                    /*!< USART2RST (Bit 18)                                    */
#define RCU_APB1RST_USART2RST_Msk         (0x40000UL)               /*!< USART2RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB1RST_UART3RST_Pos          (19UL)                    /*!< UART3RST (Bit 19)                                     */
#define RCU_APB1RST_UART3RST_Msk          (0x80000UL)               /*!< UART3RST (Bitfield-Mask: 0x01)                        */
#define RCU_APB1RST_UART4RST_Pos          (20UL)                    /*!< UART4RST (Bit 20)                                     */
#define RCU_APB1RST_UART4RST_Msk          (0x100000UL)              /*!< UART4RST (Bitfield-Mask: 0x01)                        */
#define RCU_APB1RST_I2C0RST_Pos           (21UL)                    /*!< I2C0RST (Bit 21)                                      */
#define RCU_APB1RST_I2C0RST_Msk           (0x200000UL)              /*!< I2C0RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB1RST_I2C1RST_Pos           (22UL)                    /*!< I2C1RST (Bit 22)                                      */
#define RCU_APB1RST_I2C1RST_Msk           (0x400000UL)              /*!< I2C1RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB1RST_CAN0RST_Pos           (25UL)                    /*!< CAN0RST (Bit 25)                                      */
#define RCU_APB1RST_CAN0RST_Msk           (0x2000000UL)             /*!< CAN0RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB1RST_CAN1RST_Pos           (26UL)                    /*!< CAN1RST (Bit 26)                                      */
#define RCU_APB1RST_CAN1RST_Msk           (0x4000000UL)             /*!< CAN1RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB1RST_BKPIRST_Pos           (27UL)                    /*!< BKPIRST (Bit 27)                                      */
#define RCU_APB1RST_BKPIRST_Msk           (0x8000000UL)             /*!< BKPIRST (Bitfield-Mask: 0x01)                         */
#define RCU_APB1RST_PMURST_Pos            (28UL)                    /*!< PMURST (Bit 28)                                       */
#define RCU_APB1RST_PMURST_Msk            (0x10000000UL)            /*!< PMURST (Bitfield-Mask: 0x01)                          */
#define RCU_APB1RST_DACRST_Pos            (29UL)                    /*!< DACRST (Bit 29)                                       */
#define RCU_APB1RST_DACRST_Msk            (0x20000000UL)            /*!< DACRST (Bitfield-Mask: 0x01)                          */
/* =========================================================  AHBEN  ========================================================= */
#define RCU_AHBEN_DMA0EN_Pos              (0UL)                     /*!< DMA0EN (Bit 0)                                        */
#define RCU_AHBEN_DMA0EN_Msk              (0x1UL)                   /*!< DMA0EN (Bitfield-Mask: 0x01)                          */
#define RCU_AHBEN_DMA1EN_Pos              (1UL)                     /*!< DMA1EN (Bit 1)                                        */
#define RCU_AHBEN_DMA1EN_Msk              (0x2UL)                   /*!< DMA1EN (Bitfield-Mask: 0x01)                          */
#define RCU_AHBEN_SRAMSPEN_Pos            (2UL)                     /*!< SRAMSPEN (Bit 2)                                      */
#define RCU_AHBEN_SRAMSPEN_Msk            (0x4UL)                   /*!< SRAMSPEN (Bitfield-Mask: 0x01)                        */
#define RCU_AHBEN_FMCSPEN_Pos             (4UL)                     /*!< FMCSPEN (Bit 4)                                       */
#define RCU_AHBEN_FMCSPEN_Msk             (0x10UL)                  /*!< FMCSPEN (Bitfield-Mask: 0x01)                         */
#define RCU_AHBEN_CRCEN_Pos               (6UL)                     /*!< CRCEN (Bit 6)                                         */
#define RCU_AHBEN_CRCEN_Msk               (0x40UL)                  /*!< CRCEN (Bitfield-Mask: 0x01)                           */
#define RCU_AHBEN_EXMCEN_Pos              (8UL)                     /*!< EXMCEN (Bit 8)                                        */
#define RCU_AHBEN_EXMCEN_Msk              (0x100UL)                 /*!< EXMCEN (Bitfield-Mask: 0x01)                          */
#define RCU_AHBEN_USBFSEN_Pos             (12UL)                    /*!< USBFSEN (Bit 12)                                      */
#define RCU_AHBEN_USBFSEN_Msk             (0x1000UL)                /*!< USBFSEN (Bitfield-Mask: 0x01)                         */
/* ========================================================  APB2EN  ========================================================= */
#define RCU_APB2EN_AFEN_Pos               (0UL)                     /*!< AFEN (Bit 0)                                          */
