RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define RCU_APB2EN_AFEN_Msk               (0x1UL)                   /*!< AFEN (Bitfield-Mask: 0x01)                            */
#define RCU_APB2EN_PAEN_Pos               (2UL)                     /*!< PAEN (Bit 2)                                          */
#define RCU_APB2EN_PAEN_Msk               (0x4UL)                   /*!< PAEN (Bitfield-Mask: 0x01)                            */
#define RCU_APB2EN_PBEN_Pos               (3UL)                     /*!< PBEN (Bit 3)                                          */
#define RCU_APB2EN_PBEN_Msk               (0x8UL)                   /*!< PBEN (Bitfield-Mask: 0x01)                            */
#define RCU_APB2EN_PCEN_Pos               (4UL)                     /*!< PCEN (Bit 4)                                          */
#define RCU_APB2EN_PCEN_Msk               (0x10UL)                  /*!< PCEN (Bitfield-Mask: 0x01)                            */
#define RCU_APB2EN_PDEN_Pos               (5UL)                     /*!< PDEN (Bit 5)                                          */
#define RCU_APB2EN_PDEN_Msk               (0x20UL)                  /*!< PDEN (Bitfield-Mask: 0x01)                            */
#define RCU_APB2EN_PEEN_Pos               (6UL)                     /*!< PEEN (Bit 6)                                          */
#define RCU_APB2EN_PEEN_Msk               (0x40UL)                  /*!< PEEN (Bitfield-Mask: 0x01)                            */
#define RCU_APB2EN_ADC0EN_Pos             (9UL)                     /*!< ADC0EN (Bit 9)                                        */
#define RCU_APB2EN_ADC0EN_Msk             (0x200UL)                 /*!< ADC0EN (Bitfield-Mask: 0x01)                          */
#define RCU_APB2EN_ADC1EN_Pos             (10UL)                    /*!< ADC1EN (Bit 10)                                       */
#define RCU_APB2EN_ADC1EN_Msk             (0x400UL)                 /*!< ADC1EN (Bitfield-Mask: 0x01)                          */
#define RCU_APB2EN_TIMER0EN_Pos           (11UL)                    /*!< TIMER0EN (Bit 11)                                     */
#define RCU_APB2EN_TIMER0EN_Msk           (0x800UL)                 /*!< TIMER0EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB2EN_SPI0EN_Pos             (12UL)                    /*!< SPI0EN (Bit 12)                                       */
#define RCU_APB2EN_SPI0EN_Msk             (0x1000UL)                /*!< SPI0EN (Bitfield-Mask: 0x01)                          */
#define RCU_APB2EN_USART0EN_Pos           (14UL)                    /*!< USART0EN (Bit 14)                                     */
#define RCU_APB2EN_USART0EN_Msk           (0x4000UL)                /*!< USART0EN (Bitfield-Mask: 0x01)                        */
/* ========================================================  APB1EN  ========================================================= */
#define RCU_APB1EN_TIMER1EN_Pos           (0UL)                     /*!< TIMER1EN (Bit 0)                                      */
#define RCU_APB1EN_TIMER1EN_Msk           (0x1UL)                   /*!< TIMER1EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB1EN_TIMER2EN_Pos           (1UL)                     /*!< TIMER2EN (Bit 1)                                      */
#define RCU_APB1EN_TIMER2EN_Msk           (0x2UL)                   /*!< TIMER2EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB1EN_TIMER3EN_Pos           (2UL)                     /*!< TIMER3EN (Bit 2)                                      */
#define RCU_APB1EN_TIMER3EN_Msk           (0x4UL)                   /*!< TIMER3EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB1EN_TIMER4EN_Pos           (3UL)                     /*!< TIMER4EN (Bit 3)                                      */
#define RCU_APB1EN_TIMER4EN_Msk           (0x8UL)                   /*!< TIMER4EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB1EN_TIMER5EN_Pos           (4UL)                     /*!< TIMER5EN (Bit 4)                                      */
#define RCU_APB1EN_TIMER5EN_Msk           (0x10UL)                  /*!< TIMER5EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB1EN_TIMER6EN_Pos           (5UL)                     /*!< TIMER6EN (Bit 5)                                      */
#define RCU_APB1EN_TIMER6EN_Msk           (0x20UL)                  /*!< TIMER6EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB1EN_WWDGTEN_Pos            (11UL)                    /*!< WWDGTEN (Bit 11)                                      */
#define RCU_APB1EN_WWDGTEN_Msk            (0x800UL)                 /*!< WWDGTEN (Bitfield-Mask: 0x01)                         */
#define RCU_APB1EN_SPI1EN_Pos             (14UL)                    /*!< SPI1EN (Bit 14)                                       */
#define RCU_APB1EN_SPI1EN_Msk             (0x4000UL)                /*!< SPI1EN (Bitfield-Mask: 0x01)                          */
#define RCU_APB1EN_SPI2EN_Pos             (15UL)                    /*!< SPI2EN (Bit 15)                                       */
#define RCU_APB1EN_SPI2EN_Msk             (0x8000UL)                /*!< SPI2EN (Bitfield-Mask: 0x01)                          */
#define RCU_APB1EN_USART1EN_Pos           (17UL)                    /*!< USART1EN (Bit 17)                                     */
#define RCU_APB1EN_USART1EN_Msk           (0x20000UL)               /*!< USART1EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB1EN_USART2EN_Pos           (18UL)                    /*!< USART2EN (Bit 18)                                     */
#define RCU_APB1EN_USART2EN_Msk           (0x40000UL)               /*!< USART2EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB1EN_UART3EN_Pos            (19UL)                    /*!< UART3EN (Bit 19)                                      */
#define RCU_APB1EN_UART3EN_Msk            (0x80000UL)               /*!< UART3EN (Bitfield-Mask: 0x01)                         */
#define RCU_APB1EN_UART4EN_Pos            (20UL)                    /*!< UART4EN (Bit 20)                                      */
#define RCU_APB1EN_UART4EN_Msk            (0x100000UL)              /*!< UART4EN (Bitfield-Mask: 0x01)                         */
#define RCU_APB1EN_I2C0EN_Pos             (21UL)                    /*!< I2C0EN (Bit 21)                                       */
#define RCU_APB1EN_I2C0EN_Msk             (0x200000UL)              /*!< I2C0EN (Bitfield-Mask: 0x01)                          */
#define RCU_APB1EN_I2C1EN_Pos             (22UL)                    /*!< I2C1EN (Bit 22)                                       */
#define RCU_APB1EN_I2C1EN_Msk             (0x400000UL)              /*!< I2C1EN (Bitfield-Mask: 0x01)                          */
#define RCU_APB1EN_CAN0EN_Pos             (25UL)                    /*!< CAN0EN (Bit 25)                                       */
#define RCU_APB1EN_CAN0EN_Msk             (0x2000000UL)             /*!< CAN0EN (Bitfield-Mask: 0x01)                          */
#define RCU_APB1EN_CAN1EN_Pos             (26UL)                    /*!< CAN1EN (Bit 26)                                       */
#define RCU_APB1EN_CAN1EN_Msk             (0x4000000UL)             /*!< CAN1EN (Bitfield-Mask: 0x01)                          */
#define RCU_APB1EN_BKPIEN_Pos             (27UL)                    /*!< BKPIEN (Bit 27)                                       */
#define RCU_APB1EN_BKPIEN_Msk             (0x8000000UL)             /*!< BKPIEN (Bitfield-Mask: 0x01)                          */
#define RCU_APB1EN_PMUEN_Pos              (28UL)                    /*!< PMUEN (Bit 28)                                        */
#define RCU_APB1EN_PMUEN_Msk              (0x10000000UL)            /*!< PMUEN (Bitfield-Mask: 0x01)                           */
#define RCU_APB1EN_DACEN_Pos              (29UL)                    /*!< DACEN (Bit 29)                                        */
#define RCU_APB1EN_DACEN_Msk              (0x20000000UL)            /*!< DACEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  BDCTL  ========================================================= */
#define RCU_BDCTL_LXTALEN_Pos             (0UL)                     /*!< LXTALEN (Bit 0)                                       */
#define RCU_BDCTL_LXTALEN_Msk             (0x1UL)                   /*!< LXTALEN (Bitfield-Mask: 0x01)                         */
#define RCU_BDCTL_LXTALSTB_Pos            (1UL)                     /*!< LXTALSTB (Bit 1)                                      */
#define RCU_BDCTL_LXTALSTB_Msk            (0x2UL)                   /*!< LXTALSTB (Bitfield-Mask: 0x01)                        */
#define RCU_BDCTL_LXTALBPS_Pos            (2UL)                     /*!< LXTALBPS (Bit 2)                                      */
#define RCU_BDCTL_LXTALBPS_Msk            (0x4UL)                   /*!< LXTALBPS (Bitfield-Mask: 0x01)                        */
#define RCU_BDCTL_RTCSRC_Pos              (8UL)                     /*!< RTCSRC (Bit 8)                                        */
#define RCU_BDCTL_RTCSRC_Msk              (0x300UL)                 /*!< RTCSRC (Bitfield-Mask: 0x03)                          */
#define RCU_BDCTL_RTCEN_Pos               (15UL)                    /*!< RTCEN (Bit 15)                                        */
#define RCU_BDCTL_RTCEN_Msk               (0x8000UL)                /*!< RTCEN (Bitfield-Mask: 0x01)                           */
#define RCU_BDCTL_BKPRST_Pos              (16UL)                    /*!< BKPRST (Bit 16)                                       */
#define RCU_BDCTL_BKPRST_Msk              (0x10000UL)               /*!< BKPRST (Bitfield-Mask: 0x01)                          */
/* ========================================================  RSTSCK  ========================================================= */
#define RCU_RSTSCK_IRC40KEN_Pos           (0UL)                     /*!< IRC40KEN (Bit 0)                                      */
#define RCU_RSTSCK_IRC40KEN_Msk           (0x1UL)                   /*!< IRC40KEN (Bitfield-Mask: 0x01)                        */
#define RCU_RSTSCK_IRC40KSTB_Pos          (1UL)                     /*!< IRC40KSTB (Bit 1)                                     */
#define RCU_RSTSCK_IRC40KSTB_Msk          (0x2UL)                   /*!< IRC40KSTB (Bitfield-Mask: 0x01)                       */
#define RCU_RSTSCK_RSTFC_Pos              (24UL)                    /*!< RSTFC (Bit 24)                                        */
#define RCU_RSTSCK_RSTFC_Msk              (0x1000000UL)             /*!< RSTFC (Bitfield-Mask: 0x01)                           */
#define RCU_RSTSCK_EPRSTF_Pos             (26UL)                    /*!< EPRSTF (Bit 26)                                       */
#define RCU_RSTSCK_EPRSTF_Msk             (0x4000000UL)             /*!< EPRSTF (Bitfield-Mask: 0x01)                          */
#define RCU_RSTSCK_PORRSTF_Pos            (27UL)                    /*!< PORRSTF (Bit 27)                                      */
#define RCU_RSTSCK_PORRSTF_Msk            (0x8000000UL)             /*!< PORRSTF (Bitfield-Mask: 0x01)                         */
#define RCU_RSTSCK_SWRSTF_Pos             (28UL)                    /*!< SWRSTF (Bit 28)                                       */
#define RCU_RSTSCK_SWRSTF_Msk             (0x10000000UL)            /*!< SWRSTF (Bitfield-Mask: 0x01)                          */
#define RCU_RSTSCK_FWDGTRSTF_Pos          (29UL)                    /*!< FWDGTRSTF (Bit 29)                                    */
#define RCU_RSTSCK_FWDGTRSTF_Msk          (0x20000000UL)            /*!< FWDGTRSTF (Bitfield-Mask: 0x01)                       */
#define RCU_RSTSCK_WWDGTRSTF_Pos          (30UL)                    /*!< WWDGTRSTF (Bit 30)                                    */
#define RCU_RSTSCK_WWDGTRSTF_Msk          (0x40000000UL)            /*!< WWDGTRSTF (Bitfield-Mask: 0x01)                       */
#define RCU_RSTSCK_LPRSTF_Pos             (31UL)                    /*!< LPRSTF (Bit 31)                                       */
#define RCU_RSTSCK_LPRSTF_Msk             (0x80000000UL)            /*!< LPRSTF (Bitfield-Mask: 0x01)                          */
/* ========================================================  AHBRST  ========================================================= */
#define RCU_AHBRST_USBFSRST_Pos           (12UL)                    /*!< USBFSRST (Bit 12)                                     */
#define RCU_AHBRST_USBFSRST_Msk           (0x1000UL)                /*!< USBFSRST (Bitfield-Mask: 0x01)                        */
/* =========================================================  CFG1  ========================================================== */
#define RCU_CFG1_PREDV0_Pos               (0UL)                     /*!< PREDV0 (Bit 0)                                        */
#define RCU_CFG1_PREDV0_Msk               (0xfUL)                   /*!< PREDV0 (Bitfield-Mask: 0x0f)                          */
#define RCU_CFG1_PREDV1_Pos               (4UL)                     /*!< PREDV1 (Bit 4)                                        */
#define RCU_CFG1_PREDV1_Msk               (0xf0UL)                  /*!< PREDV1 (Bitfield-Mask: 0x0f)                          */
#define RCU_CFG1_PLL1MF_Pos               (8UL)                     /*!< PLL1MF (Bit 8)                                        */
#define RCU_CFG1_PLL1MF_Msk               (0xf00UL)                 /*!< PLL1MF (Bitfield-Mask: 0x0f)                          */
#define RCU_CFG1_PLL2MF_Pos               (12UL)                    /*!< PLL2MF (Bit 12)                                       */
#define RCU_CFG1_PLL2MF_Msk               (0xf000UL)                /*!< PLL2MF (Bitfield-Mask: 0x0f)                          */
#define RCU_CFG1_PREDV0SEL_Pos            (16UL)                    /*!< PREDV0SEL (Bit 16)                                    */
#define RCU_CFG1_PREDV0SEL_Msk            (0x10000UL)               /*!< PREDV0SEL (Bitfield-Mask: 0x01)                       */
#define RCU_CFG1_I2S1SEL_Pos              (17UL)                    /*!< I2S1SEL (Bit 17)                                      */
#define RCU_CFG1_I2S1SEL_Msk              (0x20000UL)               /*!< I2S1SEL (Bitfield-Mask: 0x01)                         */
#define RCU_CFG1_I2S2SEL_Pos              (18UL)                    /*!< I2S2SEL (Bit 18)                                      */
#define RCU_CFG1_I2S2SEL_Msk              (0x40000UL)               /*!< I2S2SEL (Bitfield-Mask: 0x01)                         */
/* ==========================================================  DSV  ========================================================== */
#define RCU_DSV_DSLPVS_Pos                (0UL)                     /*!< DSLPVS (Bit 0)                                        */
#define RCU_DSV_DSLPVS_Msk                (0x3UL)                   /*!< DSLPVS (Bitfield-Mask: 0x03)                          */


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

