RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* =========================================================  INTEN  ========================================================= */
#define RTC_INTEN_OVIE_Pos                (2UL)                     /*!< OVIE (Bit 2)                                          */
#define RTC_INTEN_OVIE_Msk                (0x4UL)                   /*!< OVIE (Bitfield-Mask: 0x01)                            */
#define RTC_INTEN_ALRMIE_Pos              (1UL)                     /*!< ALRMIE (Bit 1)                                        */
#define RTC_INTEN_ALRMIE_Msk              (0x2UL)                   /*!< ALRMIE (Bitfield-Mask: 0x01)                          */
#define RTC_INTEN_SCIE_Pos                (0UL)                     /*!< SCIE (Bit 0)                                          */
#define RTC_INTEN_SCIE_Msk                (0x1UL)                   /*!< SCIE (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CTL  ========================================================== */
#define RTC_CTL_LWOFF_Pos                 (5UL)                     /*!< LWOFF (Bit 5)                                         */
#define RTC_CTL_LWOFF_Msk                 (0x20UL)                  /*!< LWOFF (Bitfield-Mask: 0x01)                           */
#define RTC_CTL_CMF_Pos                   (4UL)                     /*!< CMF (Bit 4)                                           */
#define RTC_CTL_CMF_Msk                   (0x10UL)                  /*!< CMF (Bitfield-Mask: 0x01)                             */
#define RTC_CTL_RSYNF_Pos                 (3UL)                     /*!< RSYNF (Bit 3)                                         */
#define RTC_CTL_RSYNF_Msk                 (0x8UL)                   /*!< RSYNF (Bitfield-Mask: 0x01)                           */
#define RTC_CTL_OVIF_Pos                  (2UL)                     /*!< OVIF (Bit 2)                                          */
#define RTC_CTL_OVIF_Msk                  (0x4UL)                   /*!< OVIF (Bitfield-Mask: 0x01)                            */
#define RTC_CTL_ALRMIF_Pos                (1UL)                     /*!< ALRMIF (Bit 1)                                        */
#define RTC_CTL_ALRMIF_Msk                (0x2UL)                   /*!< ALRMIF (Bitfield-Mask: 0x01)                          */
#define RTC_CTL_SCIF_Pos                  (0UL)                     /*!< SCIF (Bit 0)                                          */
#define RTC_CTL_SCIF_Msk                  (0x1UL)                   /*!< SCIF (Bitfield-Mask: 0x01)                            */
/* =========================================================  PSCH  ========================================================== */
#define RTC_PSCH_PSC_Pos                  (0UL)                     /*!< PSC (Bit 0)                                           */
#define RTC_PSCH_PSC_Msk                  (0xfUL)                   /*!< PSC (Bitfield-Mask: 0x0f)                             */
/* =========================================================  PSCL  ========================================================== */
#define RTC_PSCL_PSC_Pos                  (0UL)                     /*!< PSC (Bit 0)                                           */
#define RTC_PSCL_PSC_Msk                  (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* =========================================================  DIVH  ========================================================== */
#define RTC_DIVH_DIV_Pos                  (0UL)                     /*!< DIV (Bit 0)                                           */
#define RTC_DIVH_DIV_Msk                  (0xfUL)                   /*!< DIV (Bitfield-Mask: 0x0f)                             */
/* =========================================================  DIVL  ========================================================== */
#define RTC_DIVL_DIV_Pos                  (0UL)                     /*!< DIV (Bit 0)                                           */
#define RTC_DIVL_DIV_Msk                  (0xffffUL)                /*!< DIV (Bitfield-Mask: 0xffff)                           */
/* =========================================================  CNTH  ========================================================== */
#define RTC_CNTH_CNT_Pos                  (0UL)                     /*!< CNT (Bit 0)                                           */
#define RTC_CNTH_CNT_Msk                  (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =========================================================  CNTL  ========================================================== */
#define RTC_CNTL_CNT_Pos                  (0UL)                     /*!< CNT (Bit 0)                                           */
#define RTC_CNTL_CNT_Msk                  (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =========================================================  ALRMH  ========================================================= */
#define RTC_ALRMH_ALRM_Pos                (0UL)                     /*!< ALRM (Bit 0)                                          */
#define RTC_ALRMH_ALRM_Msk                (0xffffUL)                /*!< ALRM (Bitfield-Mask: 0xffff)                          */
/* =========================================================  ALRML  ========================================================= */
#define RTC_ALRML_ALRM_Pos                (0UL)                     /*!< ALRM (Bit 0)                                          */
#define RTC_ALRML_ALRM_Msk                (0xffffUL)                /*!< ALRM (Bitfield-Mask: 0xffff)                          */


/* =========================================================================================================================== */
/* ================                                           SPI0                                            ================ */
/* =========================================================================================================================== */

