RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* =========================================================  CTL0  ========================================================== */
#define TIMER0_CTL0_CKDIV_Pos             (8UL)                     /*!< CKDIV (Bit 8)                                         */
#define TIMER0_CTL0_CKDIV_Msk             (0x300UL)                 /*!< CKDIV (Bitfield-Mask: 0x03)                           */
#define TIMER0_CTL0_ARSE_Pos              (7UL)                     /*!< ARSE (Bit 7)                                          */
#define TIMER0_CTL0_ARSE_Msk              (0x80UL)                  /*!< ARSE (Bitfield-Mask: 0x01)                            */
#define TIMER0_CTL0_CAM_Pos               (5UL)                     /*!< CAM (Bit 5)                                           */
#define TIMER0_CTL0_CAM_Msk               (0x60UL)                  /*!< CAM (Bitfield-Mask: 0x03)                             */
#define TIMER0_CTL0_DIR_Pos               (4UL)                     /*!< DIR (Bit 4)                                           */
#define TIMER0_CTL0_DIR_Msk               (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define TIMER0_CTL0_SPM_Pos               (3UL)                     /*!< SPM (Bit 3)                                           */
#define TIMER0_CTL0_SPM_Msk               (0x8UL)                   /*!< SPM (Bitfield-Mask: 0x01)                             */
#define TIMER0_CTL0_UPS_Pos               (2UL)                     /*!< UPS (Bit 2)                                           */
#define TIMER0_CTL0_UPS_Msk               (0x4UL)                   /*!< UPS (Bitfield-Mask: 0x01)                             */
#define TIMER0_CTL0_UPDIS_Pos             (1UL)                     /*!< UPDIS (Bit 1)                                         */
#define TIMER0_CTL0_UPDIS_Msk             (0x2UL)                   /*!< UPDIS (Bitfield-Mask: 0x01)                           */
#define TIMER0_CTL0_CEN_Pos               (0UL)                     /*!< CEN (Bit 0)                                           */
#define TIMER0_CTL0_CEN_Msk               (0x1UL)                   /*!< CEN (Bitfield-Mask: 0x01)                             */
/* =========================================================  CTL1  ========================================================== */
#define TIMER0_CTL1_ISO3_Pos              (14UL)                    /*!< ISO3 (Bit 14)                                         */
#define TIMER0_CTL1_ISO3_Msk              (0x4000UL)                /*!< ISO3 (Bitfield-Mask: 0x01)                            */
#define TIMER0_CTL1_ISO2N_Pos             (13UL)                    /*!< ISO2N (Bit 13)                                        */
#define TIMER0_CTL1_ISO2N_Msk             (0x2000UL)                /*!< ISO2N (Bitfield-Mask: 0x01)                           */
#define TIMER0_CTL1_ISO2_Pos              (12UL)                    /*!< ISO2 (Bit 12)                                         */
#define TIMER0_CTL1_ISO2_Msk              (0x1000UL)                /*!< ISO2 (Bitfield-Mask: 0x01)                            */
#define TIMER0_CTL1_ISO1N_Pos             (11UL)                    /*!< ISO1N (Bit 11)                                        */
#define TIMER0_CTL1_ISO1N_Msk             (0x800UL)                 /*!< ISO1N (Bitfield-Mask: 0x01)                           */
#define TIMER0_CTL1_ISO1_Pos              (10UL)                    /*!< ISO1 (Bit 10)                                         */
#define TIMER0_CTL1_ISO1_Msk              (0x400UL)                 /*!< ISO1 (Bitfield-Mask: 0x01)                            */
#define TIMER0_CTL1_ISO0N_Pos             (9UL)                     /*!< ISO0N (Bit 9)                                         */
#define TIMER0_CTL1_ISO0N_Msk             (0x200UL)                 /*!< ISO0N (Bitfield-Mask: 0x01)                           */
#define TIMER0_CTL1_ISO0_Pos              (8UL)                     /*!< ISO0 (Bit 8)                                          */
#define TIMER0_CTL1_ISO0_Msk              (0x100UL)                 /*!< ISO0 (Bitfield-Mask: 0x01)                            */
#define TIMER0_CTL1_TI0S_Pos              (7UL)                     /*!< TI0S (Bit 7)                                          */
#define TIMER0_CTL1_TI0S_Msk              (0x80UL)                  /*!< TI0S (Bitfield-Mask: 0x01)                            */
#define TIMER0_CTL1_MMC_Pos               (4UL)                     /*!< MMC (Bit 4)                                           */
#define TIMER0_CTL1_MMC_Msk               (0x70UL)                  /*!< MMC (Bitfield-Mask: 0x07)                             */
#define TIMER0_CTL1_DMAS_Pos              (3UL)                     /*!< DMAS (Bit 3)                                          */
#define TIMER0_CTL1_DMAS_Msk              (0x8UL)                   /*!< DMAS (Bitfield-Mask: 0x01)                            */
#define TIMER0_CTL1_CCUC_Pos              (2UL)                     /*!< CCUC (Bit 2)                                          */
#define TIMER0_CTL1_CCUC_Msk              (0x4UL)                   /*!< CCUC (Bitfield-Mask: 0x01)                            */
#define TIMER0_CTL1_CCSE_Pos              (0UL)                     /*!< CCSE (Bit 0)                                          */
#define TIMER0_CTL1_CCSE_Msk              (0x1UL)                   /*!< CCSE (Bitfield-Mask: 0x01)                            */
/* =========================================================  SMCFG  ========================================================= */
#define TIMER0_SMCFG_ETP_Pos              (15UL)                    /*!< ETP (Bit 15)                                          */
#define TIMER0_SMCFG_ETP_Msk              (0x8000UL)                /*!< ETP (Bitfield-Mask: 0x01)                             */
#define TIMER0_SMCFG_SMC1_Pos             (14UL)                    /*!< SMC1 (Bit 14)                                         */
#define TIMER0_SMCFG_SMC1_Msk             (0x4000UL)                /*!< SMC1 (Bitfield-Mask: 0x01)                            */
#define TIMER0_SMCFG_ETPSC_Pos            (12UL)                    /*!< ETPSC (Bit 12)                                        */
#define TIMER0_SMCFG_ETPSC_Msk            (0x3000UL)                /*!< ETPSC (Bitfield-Mask: 0x03)                           */
#define TIMER0_SMCFG_ETFC_Pos             (8UL)                     /*!< ETFC (Bit 8)                                          */
#define TIMER0_SMCFG_ETFC_Msk             (0xf00UL)                 /*!< ETFC (Bitfield-Mask: 0x0f)                            */
#define TIMER0_SMCFG_MSM_Pos              (7UL)                     /*!< MSM (Bit 7)                                           */
#define TIMER0_SMCFG_MSM_Msk              (0x80UL)                  /*!< MSM (Bitfield-Mask: 0x01)                             */
#define TIMER0_SMCFG_TRGS_Pos             (4UL)                     /*!< TRGS (Bit 4)                                          */
#define TIMER0_SMCFG_TRGS_Msk             (0x70UL)                  /*!< TRGS (Bitfield-Mask: 0x07)                            */
#define TIMER0_SMCFG_SMC_Pos              (0UL)                     /*!< SMC (Bit 0)                                           */
#define TIMER0_SMCFG_SMC_Msk              (0x7UL)                   /*!< SMC (Bitfield-Mask: 0x07)                             */
/* =======================================================  DMAINTEN  ======================================================== */
#define TIMER0_DMAINTEN_TRGDEN_Pos        (14UL)                    /*!< TRGDEN (Bit 14)                                       */
#define TIMER0_DMAINTEN_TRGDEN_Msk        (0x4000UL)                /*!< TRGDEN (Bitfield-Mask: 0x01)                          */
#define TIMER0_DMAINTEN_CMTDEN_Pos        (13UL)                    /*!< CMTDEN (Bit 13)                                       */
#define TIMER0_DMAINTEN_CMTDEN_Msk        (0x2000UL)                /*!< CMTDEN (Bitfield-Mask: 0x01)                          */
#define TIMER0_DMAINTEN_CH3DEN_Pos        (12UL)                    /*!< CH3DEN (Bit 12)                                       */
#define TIMER0_DMAINTEN_CH3DEN_Msk        (0x1000UL)                /*!< CH3DEN (Bitfield-Mask: 0x01)                          */
#define TIMER0_DMAINTEN_CH2DEN_Pos        (11UL)                    /*!< CH2DEN (Bit 11)                                       */
#define TIMER0_DMAINTEN_CH2DEN_Msk        (0x800UL)                 /*!< CH2DEN (Bitfield-Mask: 0x01)                          */
#define TIMER0_DMAINTEN_CH1DEN_Pos        (10UL)                    /*!< CH1DEN (Bit 10)                                       */
#define TIMER0_DMAINTEN_CH1DEN_Msk        (0x400UL)                 /*!< CH1DEN (Bitfield-Mask: 0x01)                          */
#define TIMER0_DMAINTEN_CH0DEN_Pos        (9UL)                     /*!< CH0DEN (Bit 9)                                        */
#define TIMER0_DMAINTEN_CH0DEN_Msk        (0x200UL)                 /*!< CH0DEN (Bitfield-Mask: 0x01)                          */
#define TIMER0_DMAINTEN_UPDEN_Pos         (8UL)                     /*!< UPDEN (Bit 8)                                         */
#define TIMER0_DMAINTEN_UPDEN_Msk         (0x100UL)                 /*!< UPDEN (Bitfield-Mask: 0x01)                           */
#define TIMER0_DMAINTEN_BRKIE_Pos         (7UL)                     /*!< BRKIE (Bit 7)                                         */
#define TIMER0_DMAINTEN_BRKIE_Msk         (0x80UL)                  /*!< BRKIE (Bitfield-Mask: 0x01)                           */
#define TIMER0_DMAINTEN_TRGIE_Pos         (6UL)                     /*!< TRGIE (Bit 6)                                         */
#define TIMER0_DMAINTEN_TRGIE_Msk         (0x40UL)                  /*!< TRGIE (Bitfield-Mask: 0x01)                           */
#define TIMER0_DMAINTEN_CMTIE_Pos         (5UL)                     /*!< CMTIE (Bit 5)                                         */
#define TIMER0_DMAINTEN_CMTIE_Msk         (0x20UL)                  /*!< CMTIE (Bitfield-Mask: 0x01)                           */
#define TIMER0_DMAINTEN_CH3IE_Pos         (4UL)                     /*!< CH3IE (Bit 4)                                         */
#define TIMER0_DMAINTEN_CH3IE_Msk         (0x10UL)                  /*!< CH3IE (Bitfield-Mask: 0x01)                           */
#define TIMER0_DMAINTEN_CH2IE_Pos         (3UL)                     /*!< CH2IE (Bit 3)                                         */
#define TIMER0_DMAINTEN_CH2IE_Msk         (0x8UL)                   /*!< CH2IE (Bitfield-Mask: 0x01)                           */
#define TIMER0_DMAINTEN_CH1IE_Pos         (2UL)                     /*!< CH1IE (Bit 2)                                         */
#define TIMER0_DMAINTEN_CH1IE_Msk         (0x4UL)                   /*!< CH1IE (Bitfield-Mask: 0x01)                           */
#define TIMER0_DMAINTEN_CH0IE_Pos         (1UL)                     /*!< CH0IE (Bit 1)                                         */
#define TIMER0_DMAINTEN_CH0IE_Msk         (0x2UL)                   /*!< CH0IE (Bitfield-Mask: 0x01)                           */
#define TIMER0_DMAINTEN_UPIE_Pos          (0UL)                     /*!< UPIE (Bit 0)                                          */
#define TIMER0_DMAINTEN_UPIE_Msk          (0x1UL)                   /*!< UPIE (Bitfield-Mask: 0x01)                            */
/* =========================================================  INTF  ========================================================== */
#define TIMER0_INTF_CH3OF_Pos             (12UL)                    /*!< CH3OF (Bit 12)                                        */
#define TIMER0_INTF_CH3OF_Msk             (0x1000UL)                /*!< CH3OF (Bitfield-Mask: 0x01)                           */
#define TIMER0_INTF_CH2OF_Pos             (11UL)                    /*!< CH2OF (Bit 11)                                        */
#define TIMER0_INTF_CH2OF_Msk             (0x800UL)                 /*!< CH2OF (Bitfield-Mask: 0x01)                           */
#define TIMER0_INTF_CH1OF_Pos             (10UL)                    /*!< CH1OF (Bit 10)                                        */
#define TIMER0_INTF_CH1OF_Msk             (0x400UL)                 /*!< CH1OF (Bitfield-Mask: 0x01)                           */
#define TIMER0_INTF_CH0OF_Pos             (9UL)                     /*!< CH0OF (Bit 9)                                         */
#define TIMER0_INTF_CH0OF_Msk             (0x200UL)                 /*!< CH0OF (Bitfield-Mask: 0x01)                           */
#define TIMER0_INTF_BRKIF_Pos             (7UL)                     /*!< BRKIF (Bit 7)                                         */
#define TIMER0_INTF_BRKIF_Msk             (0x80UL)                  /*!< BRKIF (Bitfield-Mask: 0x01)                           */
#define TIMER0_INTF_TRGIF_Pos             (6UL)                     /*!< TRGIF (Bit 6)                                         */
#define TIMER0_INTF_TRGIF_Msk             (0x40UL)                  /*!< TRGIF (Bitfield-Mask: 0x01)                           */
#define TIMER0_INTF_CMTIF_Pos             (5UL)                     /*!< CMTIF (Bit 5)                                         */
#define TIMER0_INTF_CMTIF_Msk             (0x20UL)                  /*!< CMTIF (Bitfield-Mask: 0x01)                           */
#define TIMER0_INTF_CH3IF_Pos             (4UL)                     /*!< CH3IF (Bit 4)                                         */
#define TIMER0_INTF_CH3IF_Msk             (0x10UL)                  /*!< CH3IF (Bitfield-Mask: 0x01)                           */
#define TIMER0_INTF_CH2IF_Pos             (3UL)                     /*!< CH2IF (Bit 3)                                         */
#define TIMER0_INTF_CH2IF_Msk             (0x8UL)                   /*!< CH2IF (Bitfield-Mask: 0x01)                           */
#define TIMER0_INTF_CH1IF_Pos             (2UL)                     /*!< CH1IF (Bit 2)                                         */
#define TIMER0_INTF_CH1IF_Msk             (0x4UL)                   /*!< CH1IF (Bitfield-Mask: 0x01)                           */
#define TIMER0_INTF_CH0IF_Pos             (1UL)                     /*!< CH0IF (Bit 1)                                         */
#define TIMER0_INTF_CH0IF_Msk             (0x2UL)                   /*!< CH0IF (Bitfield-Mask: 0x01)                           */
#define TIMER0_INTF_UPIF_Pos              (0UL)                     /*!< UPIF (Bit 0)                                          */
#define TIMER0_INTF_UPIF_Msk              (0x1UL)                   /*!< UPIF (Bitfield-Mask: 0x01)                            */
/* =========================================================  SWEVG  ========================================================= */
#define TIMER0_SWEVG_BRKG_Pos             (7UL)                     /*!< BRKG (Bit 7)                                          */
#define TIMER0_SWEVG_BRKG_Msk             (0x80UL)                  /*!< BRKG (Bitfield-Mask: 0x01)                            */
#define TIMER0_SWEVG_TRGG_Pos             (6UL)                     /*!< TRGG (Bit 6)                                          */
#define TIMER0_SWEVG_TRGG_Msk             (0x40UL)                  /*!< TRGG (Bitfield-Mask: 0x01)                            */
#define TIMER0_SWEVG_CMTG_Pos             (5UL)                     /*!< CMTG (Bit 5)                                          */
#define TIMER0_SWEVG_CMTG_Msk             (0x20UL)                  /*!< CMTG (Bitfield-Mask: 0x01)                            */
#define TIMER0_SWEVG_CH3G_Pos             (4UL)                     /*!< CH3G (Bit 4)                                          */
#define TIMER0_SWEVG_CH3G_Msk             (0x10UL)                  /*!< CH3G (Bitfield-Mask: 0x01)                            */
#define TIMER0_SWEVG_CH2G_Pos             (3UL)                     /*!< CH2G (Bit 3)                                          */
#define TIMER0_SWEVG_CH2G_Msk             (0x8UL)                   /*!< CH2G (Bitfield-Mask: 0x01)                            */
#define TIMER0_SWEVG_CH1G_Pos             (2UL)                     /*!< CH1G (Bit 2)                                          */
#define TIMER0_SWEVG_CH1G_Msk             (0x4UL)                   /*!< CH1G (Bitfield-Mask: 0x01)                            */
#define TIMER0_SWEVG_CH0G_Pos             (1UL)                     /*!< CH0G (Bit 1)                                          */
#define TIMER0_SWEVG_CH0G_Msk             (0x2UL)                   /*!< CH0G (Bitfield-Mask: 0x01)                            */
#define TIMER0_SWEVG_UPG_Pos              (0UL)                     /*!< UPG (Bit 0)                                           */
#define TIMER0_SWEVG_UPG_Msk              (0x1UL)                   /*!< UPG (Bitfield-Mask: 0x01)                             */
/* =====================================================  CHCTL0_Output  ===================================================== */
#define TIMER0_CHCTL0_Output_CH1COMCEN_Pos (15UL)                   /*!< CH1COMCEN (Bit 15)                                    */
#define TIMER0_CHCTL0_Output_CH1COMCEN_Msk (0x8000UL)               /*!< CH1COMCEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL0_Output_CH1COMCTL_Pos (12UL)                   /*!< CH1COMCTL (Bit 12)                                    */
#define TIMER0_CHCTL0_Output_CH1COMCTL_Msk (0x7000UL)               /*!< CH1COMCTL (Bitfield-Mask: 0x07)                       */
#define TIMER0_CHCTL0_Output_CH1COMSEN_Pos (11UL)                   /*!< CH1COMSEN (Bit 11)                                    */
#define TIMER0_CHCTL0_Output_CH1COMSEN_Msk (0x800UL)                /*!< CH1COMSEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL0_Output_CH1COMFEN_Pos (10UL)                   /*!< CH1COMFEN (Bit 10)                                    */
#define TIMER0_CHCTL0_Output_CH1COMFEN_Msk (0x400UL)                /*!< CH1COMFEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL0_Output_CH1MS_Pos    (8UL)                     /*!< CH1MS (Bit 8)                                         */
#define TIMER0_CHCTL0_Output_CH1MS_Msk    (0x300UL)                 /*!< CH1MS (Bitfield-Mask: 0x03)                           */
#define TIMER0_CHCTL0_Output_CH0COMCEN_Pos (7UL)                    /*!< CH0COMCEN (Bit 7)                                     */
#define TIMER0_CHCTL0_Output_CH0COMCEN_Msk (0x80UL)                 /*!< CH0COMCEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL0_Output_CH0COMCTL_Pos (4UL)                    /*!< CH0COMCTL (Bit 4)                                     */
#define TIMER0_CHCTL0_Output_CH0COMCTL_Msk (0x70UL)                 /*!< CH0COMCTL (Bitfield-Mask: 0x07)                       */
#define TIMER0_CHCTL0_Output_CH0COMSEN_Pos (3UL)                    /*!< CH0COMSEN (Bit 3)                                     */
#define TIMER0_CHCTL0_Output_CH0COMSEN_Msk (0x8UL)                  /*!< CH0COMSEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL0_Output_CH0COMFEN_Pos (2UL)                    /*!< CH0COMFEN (Bit 2)                                     */
#define TIMER0_CHCTL0_Output_CH0COMFEN_Msk (0x4UL)                  /*!< CH0COMFEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL0_Output_CH0MS_Pos    (0UL)                     /*!< CH0MS (Bit 0)                                         */
#define TIMER0_CHCTL0_Output_CH0MS_Msk    (0x3UL)                   /*!< CH0MS (Bitfield-Mask: 0x03)                           */
/* =====================================================  CHCTL0_Input  ====================================================== */
#define TIMER0_CHCTL0_Input_CH1CAPFLT_Pos (12UL)                    /*!< CH1CAPFLT (Bit 12)                                    */
#define TIMER0_CHCTL0_Input_CH1CAPFLT_Msk (0xf000UL)                /*!< CH1CAPFLT (Bitfield-Mask: 0x0f)                       */
#define TIMER0_CHCTL0_Input_CH1CAPPSC_Pos (10UL)                    /*!< CH1CAPPSC (Bit 10)                                    */
#define TIMER0_CHCTL0_Input_CH1CAPPSC_Msk (0xc00UL)                 /*!< CH1CAPPSC (Bitfield-Mask: 0x03)                       */
#define TIMER0_CHCTL0_Input_CH1MS_Pos     (8UL)                     /*!< CH1MS (Bit 8)                                         */
#define TIMER0_CHCTL0_Input_CH1MS_Msk     (0x300UL)                 /*!< CH1MS (Bitfield-Mask: 0x03)                           */
#define TIMER0_CHCTL0_Input_CH0CAPFLT_Pos (4UL)                     /*!< CH0CAPFLT (Bit 4)                                     */
#define TIMER0_CHCTL0_Input_CH0CAPFLT_Msk (0xf0UL)                  /*!< CH0CAPFLT (Bitfield-Mask: 0x0f)                       */
#define TIMER0_CHCTL0_Input_CH0CAPPSC_Pos (2UL)                     /*!< CH0CAPPSC (Bit 2)                                     */
#define TIMER0_CHCTL0_Input_CH0CAPPSC_Msk (0xcUL)                   /*!< CH0CAPPSC (Bitfield-Mask: 0x03)                       */
#define TIMER0_CHCTL0_Input_CH0MS_Pos     (0UL)                     /*!< CH0MS (Bit 0)                                         */
#define TIMER0_CHCTL0_Input_CH0MS_Msk     (0x3UL)                   /*!< CH0MS (Bitfield-Mask: 0x03)                           */
/* =====================================================  CHCTL1_Output  ===================================================== */
#define TIMER0_CHCTL1_Output_CH3COMCEN_Pos (15UL)                   /*!< CH3COMCEN (Bit 15)                                    */
#define TIMER0_CHCTL1_Output_CH3COMCEN_Msk (0x8000UL)               /*!< CH3COMCEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL1_Output_CH3COMCTL_Pos (12UL)                   /*!< CH3COMCTL (Bit 12)                                    */
#define TIMER0_CHCTL1_Output_CH3COMCTL_Msk (0x7000UL)               /*!< CH3COMCTL (Bitfield-Mask: 0x07)                       */
#define TIMER0_CHCTL1_Output_CH3COMSEN_Pos (11UL)                   /*!< CH3COMSEN (Bit 11)                                    */
#define TIMER0_CHCTL1_Output_CH3COMSEN_Msk (0x800UL)                /*!< CH3COMSEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL1_Output_CH3COMFEN_Pos (10UL)                   /*!< CH3COMFEN (Bit 10)                                    */
#define TIMER0_CHCTL1_Output_CH3COMFEN_Msk (0x400UL)                /*!< CH3COMFEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL1_Output_CH3MS_Pos    (8UL)                     /*!< CH3MS (Bit 8)                                         */
#define TIMER0_CHCTL1_Output_CH3MS_Msk    (0x300UL)                 /*!< CH3MS (Bitfield-Mask: 0x03)                           */
#define TIMER0_CHCTL1_Output_CH2COMCEN_Pos (7UL)                    /*!< CH2COMCEN (Bit 7)                                     */
#define TIMER0_CHCTL1_Output_CH2COMCEN_Msk (0x80UL)                 /*!< CH2COMCEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL1_Output_CH2COMCTL_Pos (4UL)                    /*!< CH2COMCTL (Bit 4)                                     */
#define TIMER0_CHCTL1_Output_CH2COMCTL_Msk (0x70UL)                 /*!< CH2COMCTL (Bitfield-Mask: 0x07)                       */
#define TIMER0_CHCTL1_Output_CH2COMSEN_Pos (3UL)                    /*!< CH2COMSEN (Bit 3)                                     */
#define TIMER0_CHCTL1_Output_CH2COMSEN_Msk (0x8UL)                  /*!< CH2COMSEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL1_Output_CH2COMFEN_Pos (2UL)                    /*!< CH2COMFEN (Bit 2)                                     */
#define TIMER0_CHCTL1_Output_CH2COMFEN_Msk (0x4UL)                  /*!< CH2COMFEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL1_Output_CH2MS_Pos    (0UL)                     /*!< CH2MS (Bit 0)                                         */
