RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define TIMER1_CNT_CNT_Pos                (0UL)                     /*!< CNT (Bit 0)                                           */
#define TIMER1_CNT_CNT_Msk                (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define TIMER1_PSC_PSC_Pos                (0UL)                     /*!< PSC (Bit 0)                                           */
#define TIMER1_PSC_PSC_Msk                (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CAR  ========================================================== */
#define TIMER1_CAR_CARL_Pos               (0UL)                     /*!< CARL (Bit 0)                                          */
#define TIMER1_CAR_CARL_Msk               (0xffffUL)                /*!< CARL (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CH0CV  ========================================================= */
#define TIMER1_CH0CV_CH0VAL_Pos           (0UL)                     /*!< CH0VAL (Bit 0)                                        */
#define TIMER1_CH0CV_CH0VAL_Msk           (0xffffUL)                /*!< CH0VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CH1CV  ========================================================= */
#define TIMER1_CH1CV_CH1VAL_Pos           (0UL)                     /*!< CH1VAL (Bit 0)                                        */
#define TIMER1_CH1CV_CH1VAL_Msk           (0xffffUL)                /*!< CH1VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CH2CV  ========================================================= */
#define TIMER1_CH2CV_CH2VAL_Pos           (0UL)                     /*!< CH2VAL (Bit 0)                                        */
#define TIMER1_CH2CV_CH2VAL_Msk           (0xffffUL)                /*!< CH2VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CH3CV  ========================================================= */
#define TIMER1_CH3CV_CH3VAL_Pos           (0UL)                     /*!< CH3VAL (Bit 0)                                        */
#define TIMER1_CH3CV_CH3VAL_Msk           (0xffffUL)                /*!< CH3VAL (Bitfield-Mask: 0xffff)                        */
/* ========================================================  DMACFG  ========================================================= */
#define TIMER1_DMACFG_DMATC_Pos           (8UL)                     /*!< DMATC (Bit 8)                                         */
#define TIMER1_DMACFG_DMATC_Msk           (0x1f00UL)                /*!< DMATC (Bitfield-Mask: 0x1f)                           */
#define TIMER1_DMACFG_DMATA_Pos           (0UL)                     /*!< DMATA (Bit 0)                                         */
#define TIMER1_DMACFG_DMATA_Msk           (0x1fUL)                  /*!< DMATA (Bitfield-Mask: 0x1f)                           */
/* =========================================================  DMATB  ========================================================= */
#define TIMER1_DMATB_DMATB_Pos            (0UL)                     /*!< DMATB (Bit 0)                                         */
#define TIMER1_DMATB_DMATB_Msk            (0xffffUL)                /*!< DMATB (Bitfield-Mask: 0xffff)                         */


/* =========================================================================================================================== */
/* ================                                          TIMER5                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  CTL0  ========================================================== */
#define TIMER5_CTL0_ARSE_Pos              (7UL)                     /*!< ARSE (Bit 7)                                          */
#define TIMER5_CTL0_ARSE_Msk              (0x80UL)                  /*!< ARSE (Bitfield-Mask: 0x01)                            */
#define TIMER5_CTL0_SPM_Pos               (3UL)                     /*!< SPM (Bit 3)                                           */
#define TIMER5_CTL0_SPM_Msk               (0x8UL)                   /*!< SPM (Bitfield-Mask: 0x01)                             */
#define TIMER5_CTL0_UPS_Pos               (2UL)                     /*!< UPS (Bit 2)                                           */
#define TIMER5_CTL0_UPS_Msk               (0x4UL)                   /*!< UPS (Bitfield-Mask: 0x01)                             */
#define TIMER5_CTL0_UPDIS_Pos             (1UL)                     /*!< UPDIS (Bit 1)                                         */
#define TIMER5_CTL0_UPDIS_Msk             (0x2UL)                   /*!< UPDIS (Bitfield-Mask: 0x01)                           */
#define TIMER5_CTL0_CEN_Pos               (0UL)                     /*!< CEN (Bit 0)                                           */
#define TIMER5_CTL0_CEN_Msk               (0x1UL)                   /*!< CEN (Bitfield-Mask: 0x01)                             */
/* =========================================================  CTL1  ========================================================== */
#define TIMER5_CTL1_MMC_Pos               (4UL)                     /*!< MMC (Bit 4)                                           */
#define TIMER5_CTL1_MMC_Msk               (0x70UL)                  /*!< MMC (Bitfield-Mask: 0x07)                             */
/* =======================================================  DMAINTEN  ======================================================== */
#define TIMER5_DMAINTEN_UPDEN_Pos         (8UL)                     /*!< UPDEN (Bit 8)                                         */
#define TIMER5_DMAINTEN_UPDEN_Msk         (0x100UL)                 /*!< UPDEN (Bitfield-Mask: 0x01)                           */
#define TIMER5_DMAINTEN_UPIE_Pos          (0UL)                     /*!< UPIE (Bit 0)                                          */
#define TIMER5_DMAINTEN_UPIE_Msk          (0x1UL)                   /*!< UPIE (Bitfield-Mask: 0x01)                            */
/* =========================================================  INTF  ========================================================== */
#define TIMER5_INTF_UPIF_Pos              (0UL)                     /*!< UPIF (Bit 0)                                          */
#define TIMER5_INTF_UPIF_Msk              (0x1UL)                   /*!< UPIF (Bitfield-Mask: 0x01)                            */
/* =========================================================  SWEVG  ========================================================= */
#define TIMER5_SWEVG_UPG_Pos              (0UL)                     /*!< UPG (Bit 0)                                           */
#define TIMER5_SWEVG_UPG_Msk              (0x1UL)                   /*!< UPG (Bitfield-Mask: 0x01)                             */
/* ==========================================================  CNT  ========================================================== */
#define TIMER5_CNT_CNT_Pos                (0UL)                     /*!< CNT (Bit 0)                                           */
#define TIMER5_CNT_CNT_Msk                (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define TIMER5_PSC_PSC_Pos                (0UL)                     /*!< PSC (Bit 0)                                           */
#define TIMER5_PSC_PSC_Msk                (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CAR  ========================================================== */
#define TIMER5_CAR_CARL_Pos               (0UL)                     /*!< CARL (Bit 0)                                          */
#define TIMER5_CAR_CARL_Msk               (0xffffUL)                /*!< CARL (Bitfield-Mask: 0xffff)                          */


/* =========================================================================================================================== */
/* ================                                          USART                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  STAT  ========================================================== */
#define USART_STAT_CTSF_Pos              (9UL)                     /*!< CTSF (Bit 9)                                          */
#define USART_STAT_CTSF_Msk              (0x200UL)                 /*!< CTSF (Bitfield-Mask: 0x01)                            */
#define USART_STAT_LBDF_Pos              (8UL)                     /*!< LBDF (Bit 8)                                          */
#define USART_STAT_LBDF_Msk              (0x100UL)                 /*!< LBDF (Bitfield-Mask: 0x01)                            */
#define USART_STAT_TBE_Pos               (7UL)                     /*!< TBE (Bit 7)                                           */
#define USART_STAT_TBE_Msk               (0x80UL)                  /*!< TBE (Bitfield-Mask: 0x01)                             */
#define USART_STAT_TC_Pos                (6UL)                     /*!< TC (Bit 6)                                            */
#define USART_STAT_TC_Msk                (0x40UL)                  /*!< TC (Bitfield-Mask: 0x01)                              */
#define USART_STAT_RBNE_Pos              (5UL)                     /*!< RBNE (Bit 5)                                          */
#define USART_STAT_RBNE_Msk              (0x20UL)                  /*!< RBNE (Bitfield-Mask: 0x01)                            */
#define USART_STAT_IDLEF_Pos             (4UL)                     /*!< IDLEF (Bit 4)                                         */
#define USART_STAT_IDLEF_Msk             (0x10UL)                  /*!< IDLEF (Bitfield-Mask: 0x01)                           */
#define USART_STAT_ORERR_Pos             (3UL)                     /*!< ORERR (Bit 3)                                         */
#define USART_STAT_ORERR_Msk             (0x8UL)                   /*!< ORERR (Bitfield-Mask: 0x01)                           */
#define USART_STAT_NERR_Pos              (2UL)                     /*!< NERR (Bit 2)                                          */
#define USART_STAT_NERR_Msk              (0x4UL)                   /*!< NERR (Bitfield-Mask: 0x01)                            */
#define USART_STAT_FERR_Pos              (1UL)                     /*!< FERR (Bit 1)                                          */
#define USART_STAT_FERR_Msk              (0x2UL)                   /*!< FERR (Bitfield-Mask: 0x01)                            */
#define USART_STAT_PERR_Pos              (0UL)                     /*!< PERR (Bit 0)                                          */
#define USART_STAT_PERR_Msk              (0x1UL)                   /*!< PERR (Bitfield-Mask: 0x01)                            */
/* =========================================================  DATA  ========================================================== */
#define USART_DATA_DATA_Pos              (0UL)                     /*!< DATA (Bit 0)                                          */
#define USART_DATA_DATA_Msk              (0x1ffUL)                 /*!< DATA (Bitfield-Mask: 0x1ff)                           */
/* =========================================================  BAUD  ========================================================== */
#define USART_BAUD_INTDIV_Pos            (4UL)                     /*!< INTDIV (Bit 4)                                        */
#define USART_BAUD_INTDIV_Msk            (0xfff0UL)                /*!< INTDIV (Bitfield-Mask: 0xfff)                         */
#define USART_BAUD_FRADIV_Pos            (0UL)                     /*!< FRADIV (Bit 0)                                        */
#define USART_BAUD_FRADIV_Msk            (0xfUL)                   /*!< FRADIV (Bitfield-Mask: 0x0f)                          */
/* =========================================================  CTL0  ========================================================== */
#define USART_CTL0_UEN_Pos               (13UL)                    /*!< UEN (Bit 13)                                          */
#define USART_CTL0_UEN_Msk               (0x2000UL)                /*!< UEN (Bitfield-Mask: 0x01)                             */
#define USART_CTL0_WL_Pos                (12UL)                    /*!< WL (Bit 12)                                           */
#define USART_CTL0_WL_Msk                (0x1000UL)                /*!< WL (Bitfield-Mask: 0x01)                              */
#define USART_CTL0_WM_Pos                (11UL)                    /*!< WM (Bit 11)                                           */
#define USART_CTL0_WM_Msk                (0x800UL)                 /*!< WM (Bitfield-Mask: 0x01)                              */
#define USART_CTL0_PCEN_Pos              (10UL)                    /*!< PCEN (Bit 10)                                         */
#define USART_CTL0_PCEN_Msk              (0x400UL)                 /*!< PCEN (Bitfield-Mask: 0x01)                            */
#define USART_CTL0_PM_Pos                (9UL)                     /*!< PM (Bit 9)                                            */
#define USART_CTL0_PM_Msk                (0x200UL)                 /*!< PM (Bitfield-Mask: 0x01)                              */
#define USART_CTL0_PERRIE_Pos            (8UL)                     /*!< PERRIE (Bit 8)                                        */
#define USART_CTL0_PERRIE_Msk            (0x100UL)                 /*!< PERRIE (Bitfield-Mask: 0x01)                          */
#define USART_CTL0_TBEIE_Pos             (7UL)                     /*!< TBEIE (Bit 7)                                         */
#define USART_CTL0_TBEIE_Msk             (0x80UL)                  /*!< TBEIE (Bitfield-Mask: 0x01)                           */
#define USART_CTL0_TCIE_Pos              (6UL)                     /*!< TCIE (Bit 6)                                          */
#define USART_CTL0_TCIE_Msk              (0x40UL)                  /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define USART_CTL0_RBNEIE_Pos            (5UL)                     /*!< RBNEIE (Bit 5)                                        */
#define USART_CTL0_RBNEIE_Msk            (0x20UL)                  /*!< RBNEIE (Bitfield-Mask: 0x01)                          */
#define USART_CTL0_IDLEIE_Pos            (4UL)                     /*!< IDLEIE (Bit 4)                                        */
#define USART_CTL0_IDLEIE_Msk            (0x10UL)                  /*!< IDLEIE (Bitfield-Mask: 0x01)                          */
#define USART_CTL0_TEN_Pos               (3UL)                     /*!< TEN (Bit 3)                                           */
#define USART_CTL0_TEN_Msk               (0x8UL)                   /*!< TEN (Bitfield-Mask: 0x01)                             */
#define USART_CTL0_REN_Pos               (2UL)                     /*!< REN (Bit 2)                                           */
#define USART_CTL0_REN_Msk               (0x4UL)                   /*!< REN (Bitfield-Mask: 0x01)                             */
#define USART_CTL0_RWU_Pos               (1UL)                     /*!< RWU (Bit 1)                                           */
#define USART_CTL0_RWU_Msk               (0x2UL)                   /*!< RWU (Bitfield-Mask: 0x01)                             */
#define USART_CTL0_SBKCMD_Pos            (0UL)                     /*!< SBKCMD (Bit 0)                                        */
#define USART_CTL0_SBKCMD_Msk            (0x1UL)                   /*!< SBKCMD (Bitfield-Mask: 0x01)                          */
/* =========================================================  CTL1  ========================================================== */
#define USART_CTL1_LMEN_Pos              (14UL)                    /*!< LMEN (Bit 14)                                         */
#define USART_CTL1_LMEN_Msk              (0x4000UL)                /*!< LMEN (Bitfield-Mask: 0x01)                            */
#define USART_CTL1_STB_Pos               (12UL)                    /*!< STB (Bit 12)                                          */
#define USART_CTL1_STB_Msk               (0x3000UL)                /*!< STB (Bitfield-Mask: 0x03)                             */
#define USART_CTL1_CKEN_Pos              (11UL)                    /*!< CKEN (Bit 11)                                         */
#define USART_CTL1_CKEN_Msk              (0x800UL)                 /*!< CKEN (Bitfield-Mask: 0x01)                            */
#define USART_CTL1_CPL_Pos               (10UL)                    /*!< CPL (Bit 10)                                          */
#define USART_CTL1_CPL_Msk               (0x400UL)                 /*!< CPL (Bitfield-Mask: 0x01)                             */
#define USART_CTL1_CPH_Pos               (9UL)                     /*!< CPH (Bit 9)                                           */
#define USART_CTL1_CPH_Msk               (0x200UL)                 /*!< CPH (Bitfield-Mask: 0x01)                             */
#define USART_CTL1_CLEN_Pos              (8UL)                     /*!< CLEN (Bit 8)                                          */
#define USART_CTL1_CLEN_Msk              (0x100UL)                 /*!< CLEN (Bitfield-Mask: 0x01)                            */
#define USART_CTL1_LBDIE_Pos             (6UL)                     /*!< LBDIE (Bit 6)                                         */
#define USART_CTL1_LBDIE_Msk             (0x40UL)                  /*!< LBDIE (Bitfield-Mask: 0x01)                           */
#define USART_CTL1_LBLEN_Pos             (5UL)                     /*!< LBLEN (Bit 5)                                         */
#define USART_CTL1_LBLEN_Msk             (0x20UL)                  /*!< LBLEN (Bitfield-Mask: 0x01)                           */
#define USART_CTL1_ADDR_Pos              (0UL)                     /*!< ADDR (Bit 0)                                          */
#define USART_CTL1_ADDR_Msk              (0xfUL)                   /*!< ADDR (Bitfield-Mask: 0x0f)                            */
/* =========================================================  CTL2  ========================================================== */
#define USART_CTL2_CTSIE_Pos             (10UL)                    /*!< CTSIE (Bit 10)                                        */
#define USART_CTL2_CTSIE_Msk             (0x400UL)                 /*!< CTSIE (Bitfield-Mask: 0x01)                           */
#define USART_CTL2_CTSEN_Pos             (9UL)                     /*!< CTSEN (Bit 9)                                         */
#define USART_CTL2_CTSEN_Msk             (0x200UL)                 /*!< CTSEN (Bitfield-Mask: 0x01)                           */
#define USART_CTL2_RTSEN_Pos             (8UL)                     /*!< RTSEN (Bit 8)                                         */
#define USART_CTL2_RTSEN_Msk             (0x100UL)                 /*!< RTSEN (Bitfield-Mask: 0x01)                           */
#define USART_CTL2_DENT_Pos              (7UL)                     /*!< DENT (Bit 7)                                          */
#define USART_CTL2_DENT_Msk              (0x80UL)                  /*!< DENT (Bitfield-Mask: 0x01)                            */
#define USART_CTL2_DENR_Pos              (6UL)                     /*!< DENR (Bit 6)                                          */
#define USART_CTL2_DENR_Msk              (0x40UL)                  /*!< DENR (Bitfield-Mask: 0x01)                            */
#define USART_CTL2_SCEN_Pos              (5UL)                     /*!< SCEN (Bit 5)                                          */
#define USART_CTL2_SCEN_Msk              (0x20UL)                  /*!< SCEN (Bitfield-Mask: 0x01)                            */
#define USART_CTL2_NKEN_Pos              (4UL)                     /*!< NKEN (Bit 4)                                          */
#define USART_CTL2_NKEN_Msk              (0x10UL)                  /*!< NKEN (Bitfield-Mask: 0x01)                            */
#define USART_CTL2_HDEN_Pos              (3UL)                     /*!< HDEN (Bit 3)                                          */
#define USART_CTL2_HDEN_Msk              (0x8UL)                   /*!< HDEN (Bitfield-Mask: 0x01)                            */
#define USART_CTL2_IRLP_Pos              (2UL)                     /*!< IRLP (Bit 2)                                          */
#define USART_CTL2_IRLP_Msk              (0x4UL)                   /*!< IRLP (Bitfield-Mask: 0x01)                            */
#define USART_CTL2_IREN_Pos              (1UL)                     /*!< IREN (Bit 1)                                          */
#define USART_CTL2_IREN_Msk              (0x2UL)                   /*!< IREN (Bitfield-Mask: 0x01)                            */
#define USART_CTL2_ERRIE_Pos             (0UL)                     /*!< ERRIE (Bit 0)                                         */
#define USART_CTL2_ERRIE_Msk             (0x1UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
/* ==========================================================  GP  =========================================================== */
#define USART_GP_GUAT_Pos                (8UL)                     /*!< GUAT (Bit 8)                                          */
#define USART_GP_GUAT_Msk                (0xff00UL)                /*!< GUAT (Bitfield-Mask: 0xff)                            */
#define USART_GP_PSC_Pos                 (0UL)                     /*!< PSC (Bit 0)                                           */
#define USART_GP_PSC_Msk                 (0xffUL)                  /*!< PSC (Bitfield-Mask: 0xff)                             */


/* =========================================================================================================================== */
/* ================                                           UART                                           ================ */
/* =========================================================================================================================== */

