RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* =========================================================  STAT  ========================================================== */
#define UART_STAT_LBDF_Pos               (8UL)                     /*!< LBDF (Bit 8)                                          */
#define UART_STAT_LBDF_Msk               (0x100UL)                 /*!< LBDF (Bitfield-Mask: 0x01)                            */
#define UART_STAT_TBE_Pos                (7UL)                     /*!< TBE (Bit 7)                                           */
#define UART_STAT_TBE_Msk                (0x80UL)                  /*!< TBE (Bitfield-Mask: 0x01)                             */
#define UART_STAT_TC_Pos                 (6UL)                     /*!< TC (Bit 6)                                            */
#define UART_STAT_TC_Msk                 (0x40UL)                  /*!< TC (Bitfield-Mask: 0x01)                              */
#define UART_STAT_RBNE_Pos               (5UL)                     /*!< RBNE (Bit 5)                                          */
#define UART_STAT_RBNE_Msk               (0x20UL)                  /*!< RBNE (Bitfield-Mask: 0x01)                            */
#define UART_STAT_IDLEF_Pos              (4UL)                     /*!< IDLEF (Bit 4)                                         */
#define UART_STAT_IDLEF_Msk              (0x10UL)                  /*!< IDLEF (Bitfield-Mask: 0x01)                           */
#define UART_STAT_ORERR_Pos              (3UL)                     /*!< ORERR (Bit 3)                                         */
#define UART_STAT_ORERR_Msk              (0x8UL)                   /*!< ORERR (Bitfield-Mask: 0x01)                           */
#define UART_STAT_NERR_Pos               (2UL)                     /*!< NERR (Bit 2)                                          */
#define UART_STAT_NERR_Msk               (0x4UL)                   /*!< NERR (Bitfield-Mask: 0x01)                            */
#define UART_STAT_FERR_Pos               (1UL)                     /*!< FERR (Bit 1)                                          */
#define UART_STAT_FERR_Msk               (0x2UL)                   /*!< FERR (Bitfield-Mask: 0x01)                            */
#define UART_STAT_PERR_Pos               (0UL)                     /*!< PERR (Bit 0)                                          */
#define UART_STAT_PERR_Msk               (0x1UL)                   /*!< PERR (Bitfield-Mask: 0x01)                            */
/* =========================================================  DATA  ========================================================== */
#define UART_DATA_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define UART_DATA_DATA_Msk               (0x1ffUL)                 /*!< DATA (Bitfield-Mask: 0x1ff)                           */
/* =========================================================  BAUD  ========================================================== */
#define UART_BAUD_INTDIV_Pos             (4UL)                     /*!< INTDIV (Bit 4)                                        */
#define UART_BAUD_INTDIV_Msk             (0xfff0UL)                /*!< INTDIV (Bitfield-Mask: 0xfff)                         */
#define UART_BAUD_FRADIV_Pos             (0UL)                     /*!< FRADIV (Bit 0)                                        */
#define UART_BAUD_FRADIV_Msk             (0xfUL)                   /*!< FRADIV (Bitfield-Mask: 0x0f)                          */
/* =========================================================  CTL0  ========================================================== */
#define UART_CTL0_UEN_Pos                (13UL)                    /*!< UEN (Bit 13)                                          */
#define UART_CTL0_UEN_Msk                (0x2000UL)                /*!< UEN (Bitfield-Mask: 0x01)                             */
#define UART_CTL0_WL_Pos                 (12UL)                    /*!< WL (Bit 12)                                           */
#define UART_CTL0_WL_Msk                 (0x1000UL)                /*!< WL (Bitfield-Mask: 0x01)                              */
#define UART_CTL0_WM_Pos                 (11UL)                    /*!< WM (Bit 11)                                           */
#define UART_CTL0_WM_Msk                 (0x800UL)                 /*!< WM (Bitfield-Mask: 0x01)                              */
#define UART_CTL0_PCEN_Pos               (10UL)                    /*!< PCEN (Bit 10)                                         */
#define UART_CTL0_PCEN_Msk               (0x400UL)                 /*!< PCEN (Bitfield-Mask: 0x01)                            */
#define UART_CTL0_PM_Pos                 (9UL)                     /*!< PM (Bit 9)                                            */
#define UART_CTL0_PM_Msk                 (0x200UL)                 /*!< PM (Bitfield-Mask: 0x01)                              */
#define UART_CTL0_PERRIE_Pos             (8UL)                     /*!< PERRIE (Bit 8)                                        */
#define UART_CTL0_PERRIE_Msk             (0x100UL)                 /*!< PERRIE (Bitfield-Mask: 0x01)                          */
#define UART_CTL0_TBEIE_Pos              (7UL)                     /*!< TBEIE (Bit 7)                                         */
#define UART_CTL0_TBEIE_Msk              (0x80UL)                  /*!< TBEIE (Bitfield-Mask: 0x01)                           */
#define UART_CTL0_TCIE_Pos               (6UL)                     /*!< TCIE (Bit 6)                                          */
#define UART_CTL0_TCIE_Msk               (0x40UL)                  /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define UART_CTL0_RBNEIE_Pos             (5UL)                     /*!< RBNEIE (Bit 5)                                        */
#define UART_CTL0_RBNEIE_Msk             (0x20UL)                  /*!< RBNEIE (Bitfield-Mask: 0x01)                          */
#define UART_CTL0_IDLEIE_Pos             (4UL)                     /*!< IDLEIE (Bit 4)                                        */
#define UART_CTL0_IDLEIE_Msk             (0x10UL)                  /*!< IDLEIE (Bitfield-Mask: 0x01)                          */
#define UART_CTL0_TEN_Pos                (3UL)                     /*!< TEN (Bit 3)                                           */
#define UART_CTL0_TEN_Msk                (0x8UL)                   /*!< TEN (Bitfield-Mask: 0x01)                             */
#define UART_CTL0_REN_Pos                (2UL)                     /*!< REN (Bit 2)                                           */
#define UART_CTL0_REN_Msk                (0x4UL)                   /*!< REN (Bitfield-Mask: 0x01)                             */
#define UART_CTL0_RWU_Pos                (1UL)                     /*!< RWU (Bit 1)                                           */
#define UART_CTL0_RWU_Msk                (0x2UL)                   /*!< RWU (Bitfield-Mask: 0x01)                             */
#define UART_CTL0_SBKCMD_Pos             (0UL)                     /*!< SBKCMD (Bit 0)                                        */
#define UART_CTL0_SBKCMD_Msk             (0x1UL)                   /*!< SBKCMD (Bitfield-Mask: 0x01)                          */
/* =========================================================  CTL1  ========================================================== */
#define UART_CTL1_LMEN_Pos               (14UL)                    /*!< LMEN (Bit 14)                                         */
#define UART_CTL1_LMEN_Msk               (0x4000UL)                /*!< LMEN (Bitfield-Mask: 0x01)                            */
#define UART_CTL1_STB_Pos                (12UL)                    /*!< STB (Bit 12)                                          */
#define UART_CTL1_STB_Msk                (0x3000UL)                /*!< STB (Bitfield-Mask: 0x03)                             */
#define UART_CTL1_LBDIE_Pos              (6UL)                     /*!< LBDIE (Bit 6)                                         */
#define UART_CTL1_LBDIE_Msk              (0x40UL)                  /*!< LBDIE (Bitfield-Mask: 0x01)                           */
#define UART_CTL1_LBLEN_Pos              (5UL)                     /*!< LBLEN (Bit 5)                                         */
#define UART_CTL1_LBLEN_Msk              (0x20UL)                  /*!< LBLEN (Bitfield-Mask: 0x01)                           */
#define UART_CTL1_ADDR_Pos               (0UL)                     /*!< ADDR (Bit 0)                                          */
#define UART_CTL1_ADDR_Msk               (0xfUL)                   /*!< ADDR (Bitfield-Mask: 0x0f)                            */
/* =========================================================  CTL2  ========================================================== */
#define UART_CTL2_DENT_Pos               (7UL)                     /*!< DENT (Bit 7)                                          */
#define UART_CTL2_DENT_Msk               (0x80UL)                  /*!< DENT (Bitfield-Mask: 0x01)                            */
#define UART_CTL2_DENR_Pos               (6UL)                     /*!< DENR (Bit 6)                                          */
#define UART_CTL2_DENR_Msk               (0x40UL)                  /*!< DENR (Bitfield-Mask: 0x01)                            */
#define UART_CTL2_HDEN_Pos               (3UL)                     /*!< HDEN (Bit 3)                                          */
#define UART_CTL2_HDEN_Msk               (0x8UL)                   /*!< HDEN (Bitfield-Mask: 0x01)                            */
#define UART_CTL2_IRLP_Pos               (2UL)                     /*!< IRLP (Bit 2)                                          */
#define UART_CTL2_IRLP_Msk               (0x4UL)                   /*!< IRLP (Bitfield-Mask: 0x01)                            */
#define UART_CTL2_IREN_Pos               (1UL)                     /*!< IREN (Bit 1)                                          */
#define UART_CTL2_IREN_Msk               (0x2UL)                   /*!< IREN (Bitfield-Mask: 0x01)                            */
#define UART_CTL2_ERRIE_Pos              (0UL)                     /*!< ERRIE (Bit 0)                                         */
#define UART_CTL2_ERRIE_Msk              (0x1UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
/* ==========================================================  GP  =========================================================== */
#define UART_GP_PSC_Pos                  (0UL)                     /*!< PSC (Bit 0)                                           */
#define UART_GP_PSC_Msk                  (0xffUL)                  /*!< PSC (Bitfield-Mask: 0xff)                             */


/* =========================================================================================================================== */
/* ================                                       USBFS_GLOBAL                                        ================ */
/* =========================================================================================================================== */

