RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* ========================================================  GOTGCS  ========================================================= */
#define USBFS_GLOBAL_GOTGCS_SRPS_Pos      (0UL)                     /*!< SRPS (Bit 0)                                          */
#define USBFS_GLOBAL_GOTGCS_SRPS_Msk      (0x1UL)                   /*!< SRPS (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GOTGCS_SRPREQ_Pos    (1UL)                     /*!< SRPREQ (Bit 1)                                        */
#define USBFS_GLOBAL_GOTGCS_SRPREQ_Msk    (0x2UL)                   /*!< SRPREQ (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GOTGCS_HNPS_Pos      (8UL)                     /*!< HNPS (Bit 8)                                          */
#define USBFS_GLOBAL_GOTGCS_HNPS_Msk      (0x100UL)                 /*!< HNPS (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GOTGCS_HNPREQ_Pos    (9UL)                     /*!< HNPREQ (Bit 9)                                        */
#define USBFS_GLOBAL_GOTGCS_HNPREQ_Msk    (0x200UL)                 /*!< HNPREQ (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GOTGCS_HHNPEN_Pos    (10UL)                    /*!< HHNPEN (Bit 10)                                       */
#define USBFS_GLOBAL_GOTGCS_HHNPEN_Msk    (0x400UL)                 /*!< HHNPEN (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GOTGCS_DHNPEN_Pos    (11UL)                    /*!< DHNPEN (Bit 11)                                       */
#define USBFS_GLOBAL_GOTGCS_DHNPEN_Msk    (0x800UL)                 /*!< DHNPEN (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GOTGCS_IDPS_Pos      (16UL)                    /*!< IDPS (Bit 16)                                         */
#define USBFS_GLOBAL_GOTGCS_IDPS_Msk      (0x10000UL)               /*!< IDPS (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GOTGCS_DI_Pos        (17UL)                    /*!< DI (Bit 17)                                           */
#define USBFS_GLOBAL_GOTGCS_DI_Msk        (0x20000UL)               /*!< DI (Bitfield-Mask: 0x01)                              */
#define USBFS_GLOBAL_GOTGCS_ASV_Pos       (18UL)                    /*!< ASV (Bit 18)                                          */
#define USBFS_GLOBAL_GOTGCS_ASV_Msk       (0x40000UL)               /*!< ASV (Bitfield-Mask: 0x01)                             */
#define USBFS_GLOBAL_GOTGCS_BSV_Pos       (19UL)                    /*!< BSV (Bit 19)                                          */
#define USBFS_GLOBAL_GOTGCS_BSV_Msk       (0x80000UL)               /*!< BSV (Bitfield-Mask: 0x01)                             */
/* =======================================================  GOTGINTF  ======================================================== */
#define USBFS_GLOBAL_GOTGINTF_SESEND_Pos  (2UL)                     /*!< SESEND (Bit 2)                                        */
#define USBFS_GLOBAL_GOTGINTF_SESEND_Msk  (0x4UL)                   /*!< SESEND (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GOTGINTF_SRPEND_Pos  (8UL)                     /*!< SRPEND (Bit 8)                                        */
#define USBFS_GLOBAL_GOTGINTF_SRPEND_Msk  (0x100UL)                 /*!< SRPEND (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GOTGINTF_HNPEND_Pos  (9UL)                     /*!< HNPEND (Bit 9)                                        */
#define USBFS_GLOBAL_GOTGINTF_HNPEND_Msk  (0x200UL)                 /*!< HNPEND (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GOTGINTF_HNPDET_Pos  (17UL)                    /*!< HNPDET (Bit 17)                                       */
#define USBFS_GLOBAL_GOTGINTF_HNPDET_Msk  (0x20000UL)               /*!< HNPDET (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GOTGINTF_ADTO_Pos    (18UL)                    /*!< ADTO (Bit 18)                                         */
#define USBFS_GLOBAL_GOTGINTF_ADTO_Msk    (0x40000UL)               /*!< ADTO (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GOTGINTF_DF_Pos      (19UL)                    /*!< DF (Bit 19)                                           */
#define USBFS_GLOBAL_GOTGINTF_DF_Msk      (0x80000UL)               /*!< DF (Bitfield-Mask: 0x01)                              */
/* ========================================================  GAHBCS  ========================================================= */
#define USBFS_GLOBAL_GAHBCS_GINTEN_Pos    (0UL)                     /*!< GINTEN (Bit 0)                                        */
#define USBFS_GLOBAL_GAHBCS_GINTEN_Msk    (0x1UL)                   /*!< GINTEN (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GAHBCS_TXFTH_Pos     (7UL)                     /*!< TXFTH (Bit 7)                                         */
#define USBFS_GLOBAL_GAHBCS_TXFTH_Msk     (0x80UL)                  /*!< TXFTH (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GAHBCS_PTXFTH_Pos    (8UL)                     /*!< PTXFTH (Bit 8)                                        */
#define USBFS_GLOBAL_GAHBCS_PTXFTH_Msk    (0x100UL)                 /*!< PTXFTH (Bitfield-Mask: 0x01)                          */
/* ========================================================  GUSBCS  ========================================================= */
#define USBFS_GLOBAL_GUSBCS_TOC_Pos       (0UL)                     /*!< TOC (Bit 0)                                           */
#define USBFS_GLOBAL_GUSBCS_TOC_Msk       (0x7UL)                   /*!< TOC (Bitfield-Mask: 0x07)                             */
#define USBFS_GLOBAL_GUSBCS_SRPCEN_Pos    (8UL)                     /*!< SRPCEN (Bit 8)                                        */
#define USBFS_GLOBAL_GUSBCS_SRPCEN_Msk    (0x100UL)                 /*!< SRPCEN (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GUSBCS_HNPCEN_Pos    (9UL)                     /*!< HNPCEN (Bit 9)                                        */
#define USBFS_GLOBAL_GUSBCS_HNPCEN_Msk    (0x200UL)                 /*!< HNPCEN (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GUSBCS_UTT_Pos       (10UL)                    /*!< UTT (Bit 10)                                          */
#define USBFS_GLOBAL_GUSBCS_UTT_Msk       (0x3c00UL)                /*!< UTT (Bitfield-Mask: 0x0f)                             */
#define USBFS_GLOBAL_GUSBCS_FHM_Pos       (29UL)                    /*!< FHM (Bit 29)                                          */
#define USBFS_GLOBAL_GUSBCS_FHM_Msk       (0x20000000UL)            /*!< FHM (Bitfield-Mask: 0x01)                             */
#define USBFS_GLOBAL_GUSBCS_FDM_Pos       (30UL)                    /*!< FDM (Bit 30)                                          */
#define USBFS_GLOBAL_GUSBCS_FDM_Msk       (0x40000000UL)            /*!< FDM (Bitfield-Mask: 0x01)                             */
/* ========================================================  GRSTCTL  ======================================================== */
#define USBFS_GLOBAL_GRSTCTL_CSRST_Pos    (0UL)                     /*!< CSRST (Bit 0)                                         */
#define USBFS_GLOBAL_GRSTCTL_CSRST_Msk    (0x1UL)                   /*!< CSRST (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GRSTCTL_HCSRST_Pos   (1UL)                     /*!< HCSRST (Bit 1)                                        */
#define USBFS_GLOBAL_GRSTCTL_HCSRST_Msk   (0x2UL)                   /*!< HCSRST (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GRSTCTL_HFCRST_Pos   (2UL)                     /*!< HFCRST (Bit 2)                                        */
#define USBFS_GLOBAL_GRSTCTL_HFCRST_Msk   (0x4UL)                   /*!< HFCRST (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GRSTCTL_RXFF_Pos     (4UL)                     /*!< RXFF (Bit 4)                                          */
#define USBFS_GLOBAL_GRSTCTL_RXFF_Msk     (0x10UL)                  /*!< RXFF (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GRSTCTL_TXFF_Pos     (5UL)                     /*!< TXFF (Bit 5)                                          */
#define USBFS_GLOBAL_GRSTCTL_TXFF_Msk     (0x20UL)                  /*!< TXFF (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GRSTCTL_TXFNUM_Pos   (6UL)                     /*!< TXFNUM (Bit 6)                                        */
#define USBFS_GLOBAL_GRSTCTL_TXFNUM_Msk   (0x7c0UL)                 /*!< TXFNUM (Bitfield-Mask: 0x1f)                          */
/* =========================================================  GINTF  ========================================================= */
#define USBFS_GLOBAL_GINTF_COPM_Pos       (0UL)                     /*!< COPM (Bit 0)                                          */
#define USBFS_GLOBAL_GINTF_COPM_Msk       (0x1UL)                   /*!< COPM (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GINTF_MFIF_Pos       (1UL)                     /*!< MFIF (Bit 1)                                          */
#define USBFS_GLOBAL_GINTF_MFIF_Msk       (0x2UL)                   /*!< MFIF (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GINTF_OTGIF_Pos      (2UL)                     /*!< OTGIF (Bit 2)                                         */
#define USBFS_GLOBAL_GINTF_OTGIF_Msk      (0x4UL)                   /*!< OTGIF (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTF_SOF_Pos        (3UL)                     /*!< SOF (Bit 3)                                           */
#define USBFS_GLOBAL_GINTF_SOF_Msk        (0x8UL)                   /*!< SOF (Bitfield-Mask: 0x01)                             */
#define USBFS_GLOBAL_GINTF_RXFNEIF_Pos    (4UL)                     /*!< RXFNEIF (Bit 4)                                       */
#define USBFS_GLOBAL_GINTF_RXFNEIF_Msk    (0x10UL)                  /*!< RXFNEIF (Bitfield-Mask: 0x01)                         */
#define USBFS_GLOBAL_GINTF_NPTXFEIF_Pos   (5UL)                     /*!< NPTXFEIF (Bit 5)                                      */
#define USBFS_GLOBAL_GINTF_NPTXFEIF_Msk   (0x20UL)                  /*!< NPTXFEIF (Bitfield-Mask: 0x01)                        */
#define USBFS_GLOBAL_GINTF_GNPINAK_Pos    (6UL)                     /*!< GNPINAK (Bit 6)                                       */
#define USBFS_GLOBAL_GINTF_GNPINAK_Msk    (0x40UL)                  /*!< GNPINAK (Bitfield-Mask: 0x01)                         */
#define USBFS_GLOBAL_GINTF_GONAK_Pos      (7UL)                     /*!< GONAK (Bit 7)                                         */
#define USBFS_GLOBAL_GINTF_GONAK_Msk      (0x80UL)                  /*!< GONAK (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTF_ESP_Pos        (10UL)                    /*!< ESP (Bit 10)                                          */
#define USBFS_GLOBAL_GINTF_ESP_Msk        (0x400UL)                 /*!< ESP (Bitfield-Mask: 0x01)                             */
#define USBFS_GLOBAL_GINTF_SP_Pos         (11UL)                    /*!< SP (Bit 11)                                           */
#define USBFS_GLOBAL_GINTF_SP_Msk         (0x800UL)                 /*!< SP (Bitfield-Mask: 0x01)                              */
#define USBFS_GLOBAL_GINTF_RST_Pos        (12UL)                    /*!< RST (Bit 12)                                          */
#define USBFS_GLOBAL_GINTF_RST_Msk        (0x1000UL)                /*!< RST (Bitfield-Mask: 0x01)                             */
#define USBFS_GLOBAL_GINTF_ENUMF_Pos      (13UL)                    /*!< ENUMF (Bit 13)                                        */
#define USBFS_GLOBAL_GINTF_ENUMF_Msk      (0x2000UL)                /*!< ENUMF (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTF_ISOOPDIF_Pos   (14UL)                    /*!< ISOOPDIF (Bit 14)                                     */
#define USBFS_GLOBAL_GINTF_ISOOPDIF_Msk   (0x4000UL)                /*!< ISOOPDIF (Bitfield-Mask: 0x01)                        */
#define USBFS_GLOBAL_GINTF_EOPFIF_Pos     (15UL)                    /*!< EOPFIF (Bit 15)                                       */
#define USBFS_GLOBAL_GINTF_EOPFIF_Msk     (0x8000UL)                /*!< EOPFIF (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GINTF_IEPIF_Pos      (18UL)                    /*!< IEPIF (Bit 18)                                        */
#define USBFS_GLOBAL_GINTF_IEPIF_Msk      (0x40000UL)               /*!< IEPIF (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTF_OEPIF_Pos      (19UL)                    /*!< OEPIF (Bit 19)                                        */
#define USBFS_GLOBAL_GINTF_OEPIF_Msk      (0x80000UL)               /*!< OEPIF (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTF_ISOINCIF_Pos   (20UL)                    /*!< ISOINCIF (Bit 20)                                     */
#define USBFS_GLOBAL_GINTF_ISOINCIF_Msk   (0x100000UL)              /*!< ISOINCIF (Bitfield-Mask: 0x01)                        */
#define USBFS_GLOBAL_GINTF_PXNCIF_ISOONCIF_Pos (21UL)               /*!< PXNCIF_ISOONCIF (Bit 21)                              */
#define USBFS_GLOBAL_GINTF_PXNCIF_ISOONCIF_Msk (0x200000UL)         /*!< PXNCIF_ISOONCIF (Bitfield-Mask: 0x01)                 */
#define USBFS_GLOBAL_GINTF_HPIF_Pos       (24UL)                    /*!< HPIF (Bit 24)                                         */
#define USBFS_GLOBAL_GINTF_HPIF_Msk       (0x1000000UL)             /*!< HPIF (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GINTF_HCIF_Pos       (25UL)                    /*!< HCIF (Bit 25)                                         */
#define USBFS_GLOBAL_GINTF_HCIF_Msk       (0x2000000UL)             /*!< HCIF (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GINTF_PTXFEIF_Pos    (26UL)                    /*!< PTXFEIF (Bit 26)                                      */
#define USBFS_GLOBAL_GINTF_PTXFEIF_Msk    (0x4000000UL)             /*!< PTXFEIF (Bitfield-Mask: 0x01)                         */
#define USBFS_GLOBAL_GINTF_IDPSC_Pos      (28UL)                    /*!< IDPSC (Bit 28)                                        */
#define USBFS_GLOBAL_GINTF_IDPSC_Msk      (0x10000000UL)            /*!< IDPSC (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTF_DISCIF_Pos     (29UL)                    /*!< DISCIF (Bit 29)                                       */
#define USBFS_GLOBAL_GINTF_DISCIF_Msk     (0x20000000UL)            /*!< DISCIF (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GINTF_SESIF_Pos      (30UL)                    /*!< SESIF (Bit 30)                                        */
#define USBFS_GLOBAL_GINTF_SESIF_Msk      (0x40000000UL)            /*!< SESIF (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTF_WKUPIF_Pos     (31UL)                    /*!< WKUPIF (Bit 31)                                       */
#define USBFS_GLOBAL_GINTF_WKUPIF_Msk     (0x80000000UL)            /*!< WKUPIF (Bitfield-Mask: 0x01)                          */
/* ========================================================  GINTEN  ========================================================= */
#define USBFS_GLOBAL_GINTEN_MFIE_Pos      (1UL)                     /*!< MFIE (Bit 1)                                          */
#define USBFS_GLOBAL_GINTEN_MFIE_Msk      (0x2UL)                   /*!< MFIE (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GINTEN_OTGIE_Pos     (2UL)                     /*!< OTGIE (Bit 2)                                         */
#define USBFS_GLOBAL_GINTEN_OTGIE_Msk     (0x4UL)                   /*!< OTGIE (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTEN_SOFIE_Pos     (3UL)                     /*!< SOFIE (Bit 3)                                         */
#define USBFS_GLOBAL_GINTEN_SOFIE_Msk     (0x8UL)                   /*!< SOFIE (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTEN_RXFNEIE_Pos   (4UL)                     /*!< RXFNEIE (Bit 4)                                       */
#define USBFS_GLOBAL_GINTEN_RXFNEIE_Msk   (0x10UL)                  /*!< RXFNEIE (Bitfield-Mask: 0x01)                         */
#define USBFS_GLOBAL_GINTEN_NPTXFEIE_Pos  (5UL)                     /*!< NPTXFEIE (Bit 5)                                      */
#define USBFS_GLOBAL_GINTEN_NPTXFEIE_Msk  (0x20UL)                  /*!< NPTXFEIE (Bitfield-Mask: 0x01)                        */
#define USBFS_GLOBAL_GINTEN_GNPINAKIE_Pos (6UL)                     /*!< GNPINAKIE (Bit 6)                                     */
#define USBFS_GLOBAL_GINTEN_GNPINAKIE_Msk (0x40UL)                  /*!< GNPINAKIE (Bitfield-Mask: 0x01)                       */
#define USBFS_GLOBAL_GINTEN_GONAKIE_Pos   (7UL)                     /*!< GONAKIE (Bit 7)                                       */
#define USBFS_GLOBAL_GINTEN_GONAKIE_Msk   (0x80UL)                  /*!< GONAKIE (Bitfield-Mask: 0x01)                         */
#define USBFS_GLOBAL_GINTEN_ESPIE_Pos     (10UL)                    /*!< ESPIE (Bit 10)                                        */
#define USBFS_GLOBAL_GINTEN_ESPIE_Msk     (0x400UL)                 /*!< ESPIE (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTEN_SPIE_Pos      (11UL)                    /*!< SPIE (Bit 11)                                         */
#define USBFS_GLOBAL_GINTEN_SPIE_Msk      (0x800UL)                 /*!< SPIE (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GINTEN_RSTIE_Pos     (12UL)                    /*!< RSTIE (Bit 12)                                        */
#define USBFS_GLOBAL_GINTEN_RSTIE_Msk     (0x1000UL)                /*!< RSTIE (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTEN_ENUMFIE_Pos   (13UL)                    /*!< ENUMFIE (Bit 13)                                      */
#define USBFS_GLOBAL_GINTEN_ENUMFIE_Msk   (0x2000UL)                /*!< ENUMFIE (Bitfield-Mask: 0x01)                         */
#define USBFS_GLOBAL_GINTEN_ISOOPDIE_Pos  (14UL)                    /*!< ISOOPDIE (Bit 14)                                     */
#define USBFS_GLOBAL_GINTEN_ISOOPDIE_Msk  (0x4000UL)                /*!< ISOOPDIE (Bitfield-Mask: 0x01)                        */
#define USBFS_GLOBAL_GINTEN_EOPFIE_Pos    (15UL)                    /*!< EOPFIE (Bit 15)                                       */
#define USBFS_GLOBAL_GINTEN_EOPFIE_Msk    (0x8000UL)                /*!< EOPFIE (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GINTEN_IEPIE_Pos     (18UL)                    /*!< IEPIE (Bit 18)                                        */
#define USBFS_GLOBAL_GINTEN_IEPIE_Msk     (0x40000UL)               /*!< IEPIE (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTEN_OEPIE_Pos     (19UL)                    /*!< OEPIE (Bit 19)                                        */
#define USBFS_GLOBAL_GINTEN_OEPIE_Msk     (0x80000UL)               /*!< OEPIE (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTEN_ISOINCIE_Pos  (20UL)                    /*!< ISOINCIE (Bit 20)                                     */
#define USBFS_GLOBAL_GINTEN_ISOINCIE_Msk  (0x100000UL)              /*!< ISOINCIE (Bitfield-Mask: 0x01)                        */
#define USBFS_GLOBAL_GINTEN_PXNCIE_ISOONCIE_Pos (21UL)              /*!< PXNCIE_ISOONCIE (Bit 21)                              */
#define USBFS_GLOBAL_GINTEN_PXNCIE_ISOONCIE_Msk (0x200000UL)        /*!< PXNCIE_ISOONCIE (Bitfield-Mask: 0x01)                 */
#define USBFS_GLOBAL_GINTEN_HPIE_Pos      (24UL)                    /*!< HPIE (Bit 24)                                         */
#define USBFS_GLOBAL_GINTEN_HPIE_Msk      (0x1000000UL)             /*!< HPIE (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GINTEN_HCIE_Pos      (25UL)                    /*!< HCIE (Bit 25)                                         */
#define USBFS_GLOBAL_GINTEN_HCIE_Msk      (0x2000000UL)             /*!< HCIE (Bitfield-Mask: 0x01)                            */
#define USBFS_GLOBAL_GINTEN_PTXFEIE_Pos   (26UL)                    /*!< PTXFEIE (Bit 26)                                      */
#define USBFS_GLOBAL_GINTEN_PTXFEIE_Msk   (0x4000000UL)             /*!< PTXFEIE (Bitfield-Mask: 0x01)                         */
#define USBFS_GLOBAL_GINTEN_IDPSCIE_Pos   (28UL)                    /*!< IDPSCIE (Bit 28)                                      */
#define USBFS_GLOBAL_GINTEN_IDPSCIE_Msk   (0x10000000UL)            /*!< IDPSCIE (Bitfield-Mask: 0x01)                         */
#define USBFS_GLOBAL_GINTEN_DISCIE_Pos    (29UL)                    /*!< DISCIE (Bit 29)                                       */
#define USBFS_GLOBAL_GINTEN_DISCIE_Msk    (0x20000000UL)            /*!< DISCIE (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GINTEN_SESIE_Pos     (30UL)                    /*!< SESIE (Bit 30)                                        */
#define USBFS_GLOBAL_GINTEN_SESIE_Msk     (0x40000000UL)            /*!< SESIE (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GINTEN_WKUPIE_Pos    (31UL)                    /*!< WKUPIE (Bit 31)                                       */
#define USBFS_GLOBAL_GINTEN_WKUPIE_Msk    (0x80000000UL)            /*!< WKUPIE (Bitfield-Mask: 0x01)                          */
/* ====================================================  GRSTATR_Device  ===================================================== */
#define USBFS_GLOBAL_GRSTATR_Device_EPNUM_Pos (0UL)                 /*!< EPNUM (Bit 0)                                         */
#define USBFS_GLOBAL_GRSTATR_Device_EPNUM_Msk (0xfUL)               /*!< EPNUM (Bitfield-Mask: 0x0f)                           */
#define USBFS_GLOBAL_GRSTATR_Device_BCOUNT_Pos (4UL)                /*!< BCOUNT (Bit 4)                                        */
#define USBFS_GLOBAL_GRSTATR_Device_BCOUNT_Msk (0x7ff0UL)           /*!< BCOUNT (Bitfield-Mask: 0x7ff)                         */
#define USBFS_GLOBAL_GRSTATR_Device_DPID_Pos (15UL)                 /*!< DPID (Bit 15)                                         */
#define USBFS_GLOBAL_GRSTATR_Device_DPID_Msk (0x18000UL)            /*!< DPID (Bitfield-Mask: 0x03)                            */
#define USBFS_GLOBAL_GRSTATR_Device_RPCKST_Pos (17UL)               /*!< RPCKST (Bit 17)                                       */
#define USBFS_GLOBAL_GRSTATR_Device_RPCKST_Msk (0x1e0000UL)         /*!< RPCKST (Bitfield-Mask: 0x0f)                          */
/* =====================================================  GRSTATR_Host  ====================================================== */
#define USBFS_GLOBAL_GRSTATR_Host_CNUM_Pos (0UL)                    /*!< CNUM (Bit 0)                                          */
#define USBFS_GLOBAL_GRSTATR_Host_CNUM_Msk (0xfUL)                  /*!< CNUM (Bitfield-Mask: 0x0f)                            */
#define USBFS_GLOBAL_GRSTATR_Host_BCOUNT_Pos (4UL)                  /*!< BCOUNT (Bit 4)                                        */
#define USBFS_GLOBAL_GRSTATR_Host_BCOUNT_Msk (0x7ff0UL)             /*!< BCOUNT (Bitfield-Mask: 0x7ff)                         */
#define USBFS_GLOBAL_GRSTATR_Host_DPID_Pos (15UL)                   /*!< DPID (Bit 15)                                         */
#define USBFS_GLOBAL_GRSTATR_Host_DPID_Msk (0x18000UL)              /*!< DPID (Bitfield-Mask: 0x03)                            */
#define USBFS_GLOBAL_GRSTATR_Host_RPCKST_Pos (17UL)                 /*!< RPCKST (Bit 17)                                       */
