RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define USBFS_GLOBAL_GRSTATR_Host_RPCKST_Msk (0x1e0000UL)           /*!< RPCKST (Bitfield-Mask: 0x0f)                          */
/* ====================================================  GRSTATP_Device  ===================================================== */
#define USBFS_GLOBAL_GRSTATP_Device_EPNUM_Pos (0UL)                 /*!< EPNUM (Bit 0)                                         */
#define USBFS_GLOBAL_GRSTATP_Device_EPNUM_Msk (0xfUL)               /*!< EPNUM (Bitfield-Mask: 0x0f)                           */
#define USBFS_GLOBAL_GRSTATP_Device_BCOUNT_Pos (4UL)                /*!< BCOUNT (Bit 4)                                        */
#define USBFS_GLOBAL_GRSTATP_Device_BCOUNT_Msk (0x7ff0UL)           /*!< BCOUNT (Bitfield-Mask: 0x7ff)                         */
#define USBFS_GLOBAL_GRSTATP_Device_DPID_Pos (15UL)                 /*!< DPID (Bit 15)                                         */
#define USBFS_GLOBAL_GRSTATP_Device_DPID_Msk (0x18000UL)            /*!< DPID (Bitfield-Mask: 0x03)                            */
#define USBFS_GLOBAL_GRSTATP_Device_RPCKST_Pos (17UL)               /*!< RPCKST (Bit 17)                                       */
#define USBFS_GLOBAL_GRSTATP_Device_RPCKST_Msk (0x1e0000UL)         /*!< RPCKST (Bitfield-Mask: 0x0f)                          */
/* =====================================================  GRSTATP_Host  ====================================================== */
#define USBFS_GLOBAL_GRSTATP_Host_CNUM_Pos (0UL)                    /*!< CNUM (Bit 0)                                          */
#define USBFS_GLOBAL_GRSTATP_Host_CNUM_Msk (0xfUL)                  /*!< CNUM (Bitfield-Mask: 0x0f)                            */
#define USBFS_GLOBAL_GRSTATP_Host_BCOUNT_Pos (4UL)                  /*!< BCOUNT (Bit 4)                                        */
#define USBFS_GLOBAL_GRSTATP_Host_BCOUNT_Msk (0x7ff0UL)             /*!< BCOUNT (Bitfield-Mask: 0x7ff)                         */
#define USBFS_GLOBAL_GRSTATP_Host_DPID_Pos (15UL)                   /*!< DPID (Bit 15)                                         */
#define USBFS_GLOBAL_GRSTATP_Host_DPID_Msk (0x18000UL)              /*!< DPID (Bitfield-Mask: 0x03)                            */
#define USBFS_GLOBAL_GRSTATP_Host_RPCKST_Pos (17UL)                 /*!< RPCKST (Bit 17)                                       */
#define USBFS_GLOBAL_GRSTATP_Host_RPCKST_Msk (0x1e0000UL)           /*!< RPCKST (Bitfield-Mask: 0x0f)                          */
/* ========================================================  GRFLEN  ========================================================= */
#define USBFS_GLOBAL_GRFLEN_RXFD_Pos      (0UL)                     /*!< RXFD (Bit 0)                                          */
#define USBFS_GLOBAL_GRFLEN_RXFD_Msk      (0xffffUL)                /*!< RXFD (Bitfield-Mask: 0xffff)                          */
/* =======================================================  HNPTFLEN  ======================================================== */
#define USBFS_GLOBAL_HNPTFLEN_HNPTXRSAR_Pos (0UL)                   /*!< HNPTXRSAR (Bit 0)                                     */
#define USBFS_GLOBAL_HNPTFLEN_HNPTXRSAR_Msk (0xffffUL)              /*!< HNPTXRSAR (Bitfield-Mask: 0xffff)                     */
#define USBFS_GLOBAL_HNPTFLEN_HNPTXFD_Pos (16UL)                    /*!< HNPTXFD (Bit 16)                                      */
#define USBFS_GLOBAL_HNPTFLEN_HNPTXFD_Msk (0xffff0000UL)            /*!< HNPTXFD (Bitfield-Mask: 0xffff)                       */
/* ======================================================  DIEP0TFLEN  ======================================================= */
#define USBFS_GLOBAL_DIEP0TFLEN_IEP0TXFD_Pos (16UL)                 /*!< IEP0TXFD (Bit 16)                                     */
#define USBFS_GLOBAL_DIEP0TFLEN_IEP0TXFD_Msk (0xffff0000UL)         /*!< IEP0TXFD (Bitfield-Mask: 0xffff)                      */
#define USBFS_GLOBAL_DIEP0TFLEN_IEP0TXRSAR_Pos (0UL)                /*!< IEP0TXRSAR (Bit 0)                                    */
#define USBFS_GLOBAL_DIEP0TFLEN_IEP0TXRSAR_Msk (0xffffUL)           /*!< IEP0TXRSAR (Bitfield-Mask: 0xffff)                    */
/* ======================================================  HNPTFQSTAT  ======================================================= */
#define USBFS_GLOBAL_HNPTFQSTAT_NPTXFS_Pos (0UL)                    /*!< NPTXFS (Bit 0)                                        */
#define USBFS_GLOBAL_HNPTFQSTAT_NPTXFS_Msk (0xffffUL)               /*!< NPTXFS (Bitfield-Mask: 0xffff)                        */
#define USBFS_GLOBAL_HNPTFQSTAT_NPTXRQS_Pos (16UL)                  /*!< NPTXRQS (Bit 16)                                      */
#define USBFS_GLOBAL_HNPTFQSTAT_NPTXRQS_Msk (0xff0000UL)            /*!< NPTXRQS (Bitfield-Mask: 0xff)                         */
#define USBFS_GLOBAL_HNPTFQSTAT_NPTXRQTOP_Pos (24UL)                /*!< NPTXRQTOP (Bit 24)                                    */
#define USBFS_GLOBAL_HNPTFQSTAT_NPTXRQTOP_Msk (0x7f000000UL)        /*!< NPTXRQTOP (Bitfield-Mask: 0x7f)                       */
/* =========================================================  GCCFG  ========================================================= */
#define USBFS_GLOBAL_GCCFG_PWRON_Pos      (16UL)                    /*!< PWRON (Bit 16)                                        */
#define USBFS_GLOBAL_GCCFG_PWRON_Msk      (0x10000UL)               /*!< PWRON (Bitfield-Mask: 0x01)                           */
#define USBFS_GLOBAL_GCCFG_VBUSACEN_Pos   (18UL)                    /*!< VBUSACEN (Bit 18)                                     */
#define USBFS_GLOBAL_GCCFG_VBUSACEN_Msk   (0x40000UL)               /*!< VBUSACEN (Bitfield-Mask: 0x01)                        */
#define USBFS_GLOBAL_GCCFG_VBUSBCEN_Pos   (19UL)                    /*!< VBUSBCEN (Bit 19)                                     */
#define USBFS_GLOBAL_GCCFG_VBUSBCEN_Msk   (0x80000UL)               /*!< VBUSBCEN (Bitfield-Mask: 0x01)                        */
#define USBFS_GLOBAL_GCCFG_SOFOEN_Pos     (20UL)                    /*!< SOFOEN (Bit 20)                                       */
#define USBFS_GLOBAL_GCCFG_SOFOEN_Msk     (0x100000UL)              /*!< SOFOEN (Bitfield-Mask: 0x01)                          */
#define USBFS_GLOBAL_GCCFG_VBUSIG_Pos     (21UL)                    /*!< VBUSIG (Bit 21)                                       */
#define USBFS_GLOBAL_GCCFG_VBUSIG_Msk     (0x200000UL)              /*!< VBUSIG (Bitfield-Mask: 0x01)                          */
/* ==========================================================  CID  ========================================================== */
#define USBFS_GLOBAL_CID_CID_Pos          (0UL)                     /*!< CID (Bit 0)                                           */
#define USBFS_GLOBAL_CID_CID_Msk          (0xffffffffUL)            /*!< CID (Bitfield-Mask: 0xffffffff)                       */
/* ========================================================  HPTFLEN  ======================================================== */
#define USBFS_GLOBAL_HPTFLEN_HPTXFSAR_Pos (0UL)                     /*!< HPTXFSAR (Bit 0)                                      */
#define USBFS_GLOBAL_HPTFLEN_HPTXFSAR_Msk (0xffffUL)                /*!< HPTXFSAR (Bitfield-Mask: 0xffff)                      */
#define USBFS_GLOBAL_HPTFLEN_HPTXFD_Pos   (16UL)                    /*!< HPTXFD (Bit 16)                                       */
#define USBFS_GLOBAL_HPTFLEN_HPTXFD_Msk   (0xffff0000UL)            /*!< HPTXFD (Bitfield-Mask: 0xffff)                        */
/* ======================================================  DIEP1TFLEN  ======================================================= */
#define USBFS_GLOBAL_DIEP1TFLEN_IEPTXRSAR_Pos (0UL)                 /*!< IEPTXRSAR (Bit 0)                                     */
#define USBFS_GLOBAL_DIEP1TFLEN_IEPTXRSAR_Msk (0xffffUL)            /*!< IEPTXRSAR (Bitfield-Mask: 0xffff)                     */
#define USBFS_GLOBAL_DIEP1TFLEN_IEPTXFD_Pos (16UL)                  /*!< IEPTXFD (Bit 16)                                      */
#define USBFS_GLOBAL_DIEP1TFLEN_IEPTXFD_Msk (0xffff0000UL)          /*!< IEPTXFD (Bitfield-Mask: 0xffff)                       */
/* ======================================================  DIEP2TFLEN  ======================================================= */
#define USBFS_GLOBAL_DIEP2TFLEN_IEPTXRSAR_Pos (0UL)                 /*!< IEPTXRSAR (Bit 0)                                     */
#define USBFS_GLOBAL_DIEP2TFLEN_IEPTXRSAR_Msk (0xffffUL)            /*!< IEPTXRSAR (Bitfield-Mask: 0xffff)                     */
#define USBFS_GLOBAL_DIEP2TFLEN_IEPTXFD_Pos (16UL)                  /*!< IEPTXFD (Bit 16)                                      */
#define USBFS_GLOBAL_DIEP2TFLEN_IEPTXFD_Msk (0xffff0000UL)          /*!< IEPTXFD (Bitfield-Mask: 0xffff)                       */
/* ======================================================  DIEP3TFLEN  ======================================================= */
#define USBFS_GLOBAL_DIEP3TFLEN_IEPTXRSAR_Pos (0UL)                 /*!< IEPTXRSAR (Bit 0)                                     */
#define USBFS_GLOBAL_DIEP3TFLEN_IEPTXRSAR_Msk (0xffffUL)            /*!< IEPTXRSAR (Bitfield-Mask: 0xffff)                     */
#define USBFS_GLOBAL_DIEP3TFLEN_IEPTXFD_Pos (16UL)                  /*!< IEPTXFD (Bit 16)                                      */
#define USBFS_GLOBAL_DIEP3TFLEN_IEPTXFD_Msk (0xffff0000UL)          /*!< IEPTXFD (Bitfield-Mask: 0xffff)                       */


/* =========================================================================================================================== */
/* ================                                        USBFS_HOST                                         ================ */
/* =========================================================================================================================== */

