RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
/* =========================================================  HCTL  ========================================================== */
#define USBFS_HOST_HCTL_CLKSEL_Pos        (0UL)                     /*!< CLKSEL (Bit 0)                                        */
#define USBFS_HOST_HCTL_CLKSEL_Msk        (0x3UL)                   /*!< CLKSEL (Bitfield-Mask: 0x03)                          */
/* ==========================================================  HFT  ========================================================== */
#define USBFS_HOST_HFT_FRI_Pos            (0UL)                     /*!< FRI (Bit 0)                                           */
#define USBFS_HOST_HFT_FRI_Msk            (0xffffUL)                /*!< FRI (Bitfield-Mask: 0xffff)                           */
/* ========================================================  HFINFR  ========================================================= */
#define USBFS_HOST_HFINFR_FRNUM_Pos       (0UL)                     /*!< FRNUM (Bit 0)                                         */
#define USBFS_HOST_HFINFR_FRNUM_Msk       (0xffffUL)                /*!< FRNUM (Bitfield-Mask: 0xffff)                         */
#define USBFS_HOST_HFINFR_FRT_Pos         (16UL)                    /*!< FRT (Bit 16)                                          */
#define USBFS_HOST_HFINFR_FRT_Msk         (0xffff0000UL)            /*!< FRT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  HPTFQSTAT  ======================================================= */
#define USBFS_HOST_HPTFQSTAT_PTXFS_Pos    (0UL)                     /*!< PTXFS (Bit 0)                                         */
#define USBFS_HOST_HPTFQSTAT_PTXFS_Msk    (0xffffUL)                /*!< PTXFS (Bitfield-Mask: 0xffff)                         */
#define USBFS_HOST_HPTFQSTAT_PTXREQS_Pos  (16UL)                    /*!< PTXREQS (Bit 16)                                      */
#define USBFS_HOST_HPTFQSTAT_PTXREQS_Msk  (0xff0000UL)              /*!< PTXREQS (Bitfield-Mask: 0xff)                         */
#define USBFS_HOST_HPTFQSTAT_PTXREQT_Pos  (24UL)                    /*!< PTXREQT (Bit 24)                                      */
#define USBFS_HOST_HPTFQSTAT_PTXREQT_Msk  (0xff000000UL)            /*!< PTXREQT (Bitfield-Mask: 0xff)                         */
/* ========================================================  HACHINT  ======================================================== */
#define USBFS_HOST_HACHINT_HACHINT_Pos    (0UL)                     /*!< HACHINT (Bit 0)                                       */
#define USBFS_HOST_HACHINT_HACHINT_Msk    (0xffUL)                  /*!< HACHINT (Bitfield-Mask: 0xff)                         */
/* =======================================================  HACHINTEN  ======================================================= */
#define USBFS_HOST_HACHINTEN_CINTEN_Pos   (0UL)                     /*!< CINTEN (Bit 0)                                        */
#define USBFS_HOST_HACHINTEN_CINTEN_Msk   (0xffUL)                  /*!< CINTEN (Bitfield-Mask: 0xff)                          */
/* =========================================================  HPCS  ========================================================== */
#define USBFS_HOST_HPCS_PCST_Pos          (0UL)                     /*!< PCST (Bit 0)                                          */
#define USBFS_HOST_HPCS_PCST_Msk          (0x1UL)                   /*!< PCST (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HPCS_PCD_Pos           (1UL)                     /*!< PCD (Bit 1)                                           */
#define USBFS_HOST_HPCS_PCD_Msk           (0x2UL)                   /*!< PCD (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HPCS_PE_Pos            (2UL)                     /*!< PE (Bit 2)                                            */
#define USBFS_HOST_HPCS_PE_Msk            (0x4UL)                   /*!< PE (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HPCS_PEDC_Pos          (3UL)                     /*!< PEDC (Bit 3)                                          */
#define USBFS_HOST_HPCS_PEDC_Msk          (0x8UL)                   /*!< PEDC (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HPCS_PREM_Pos          (6UL)                     /*!< PREM (Bit 6)                                          */
#define USBFS_HOST_HPCS_PREM_Msk          (0x40UL)                  /*!< PREM (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HPCS_PSP_Pos           (7UL)                     /*!< PSP (Bit 7)                                           */
#define USBFS_HOST_HPCS_PSP_Msk           (0x80UL)                  /*!< PSP (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HPCS_PRST_Pos          (8UL)                     /*!< PRST (Bit 8)                                          */
#define USBFS_HOST_HPCS_PRST_Msk          (0x100UL)                 /*!< PRST (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HPCS_PLST_Pos          (10UL)                    /*!< PLST (Bit 10)                                         */
#define USBFS_HOST_HPCS_PLST_Msk          (0xc00UL)                 /*!< PLST (Bitfield-Mask: 0x03)                            */
#define USBFS_HOST_HPCS_PP_Pos            (12UL)                    /*!< PP (Bit 12)                                           */
#define USBFS_HOST_HPCS_PP_Msk            (0x1000UL)                /*!< PP (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HPCS_PS_Pos            (17UL)                    /*!< PS (Bit 17)                                           */
#define USBFS_HOST_HPCS_PS_Msk            (0x60000UL)               /*!< PS (Bitfield-Mask: 0x03)                              */
/* ========================================================  HCH0CTL  ======================================================== */
#define USBFS_HOST_HCH0CTL_MPL_Pos        (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_HOST_HCH0CTL_MPL_Msk        (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
#define USBFS_HOST_HCH0CTL_EPNUM_Pos      (11UL)                    /*!< EPNUM (Bit 11)                                        */
#define USBFS_HOST_HCH0CTL_EPNUM_Msk      (0x7800UL)                /*!< EPNUM (Bitfield-Mask: 0x0f)                           */
#define USBFS_HOST_HCH0CTL_EPDIR_Pos      (15UL)                    /*!< EPDIR (Bit 15)                                        */
#define USBFS_HOST_HCH0CTL_EPDIR_Msk      (0x8000UL)                /*!< EPDIR (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH0CTL_LSD_Pos        (17UL)                    /*!< LSD (Bit 17)                                          */
#define USBFS_HOST_HCH0CTL_LSD_Msk        (0x20000UL)               /*!< LSD (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH0CTL_EPTYPE_Pos     (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_HOST_HCH0CTL_EPTYPE_Msk     (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_HOST_HCH0CTL_DAR_Pos        (22UL)                    /*!< DAR (Bit 22)                                          */
#define USBFS_HOST_HCH0CTL_DAR_Msk        (0x1fc00000UL)            /*!< DAR (Bitfield-Mask: 0x7f)                             */
#define USBFS_HOST_HCH0CTL_ODDFRM_Pos     (29UL)                    /*!< ODDFRM (Bit 29)                                       */
#define USBFS_HOST_HCH0CTL_ODDFRM_Msk     (0x20000000UL)            /*!< ODDFRM (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH0CTL_CDIS_Pos       (30UL)                    /*!< CDIS (Bit 30)                                         */
#define USBFS_HOST_HCH0CTL_CDIS_Msk       (0x40000000UL)            /*!< CDIS (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH0CTL_CEN_Pos        (31UL)                    /*!< CEN (Bit 31)                                          */
#define USBFS_HOST_HCH0CTL_CEN_Msk        (0x80000000UL)            /*!< CEN (Bitfield-Mask: 0x01)                             */
/* ========================================================  HCH1CTL  ======================================================== */
#define USBFS_HOST_HCH1CTL_MPL_Pos        (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_HOST_HCH1CTL_MPL_Msk        (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
#define USBFS_HOST_HCH1CTL_EPNUM_Pos      (11UL)                    /*!< EPNUM (Bit 11)                                        */
#define USBFS_HOST_HCH1CTL_EPNUM_Msk      (0x7800UL)                /*!< EPNUM (Bitfield-Mask: 0x0f)                           */
#define USBFS_HOST_HCH1CTL_EPDIR_Pos      (15UL)                    /*!< EPDIR (Bit 15)                                        */
#define USBFS_HOST_HCH1CTL_EPDIR_Msk      (0x8000UL)                /*!< EPDIR (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH1CTL_LSD_Pos        (17UL)                    /*!< LSD (Bit 17)                                          */
#define USBFS_HOST_HCH1CTL_LSD_Msk        (0x20000UL)               /*!< LSD (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH1CTL_EPTYPE_Pos     (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_HOST_HCH1CTL_EPTYPE_Msk     (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_HOST_HCH1CTL_DAR_Pos        (22UL)                    /*!< DAR (Bit 22)                                          */
#define USBFS_HOST_HCH1CTL_DAR_Msk        (0x1fc00000UL)            /*!< DAR (Bitfield-Mask: 0x7f)                             */
#define USBFS_HOST_HCH1CTL_ODDFRM_Pos     (29UL)                    /*!< ODDFRM (Bit 29)                                       */
#define USBFS_HOST_HCH1CTL_ODDFRM_Msk     (0x20000000UL)            /*!< ODDFRM (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH1CTL_CDIS_Pos       (30UL)                    /*!< CDIS (Bit 30)                                         */
#define USBFS_HOST_HCH1CTL_CDIS_Msk       (0x40000000UL)            /*!< CDIS (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH1CTL_CEN_Pos        (31UL)                    /*!< CEN (Bit 31)                                          */
#define USBFS_HOST_HCH1CTL_CEN_Msk        (0x80000000UL)            /*!< CEN (Bitfield-Mask: 0x01)                             */
/* ========================================================  HCH2CTL  ======================================================== */
#define USBFS_HOST_HCH2CTL_MPL_Pos        (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_HOST_HCH2CTL_MPL_Msk        (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
#define USBFS_HOST_HCH2CTL_EPNUM_Pos      (11UL)                    /*!< EPNUM (Bit 11)                                        */
#define USBFS_HOST_HCH2CTL_EPNUM_Msk      (0x7800UL)                /*!< EPNUM (Bitfield-Mask: 0x0f)                           */
#define USBFS_HOST_HCH2CTL_EPDIR_Pos      (15UL)                    /*!< EPDIR (Bit 15)                                        */
#define USBFS_HOST_HCH2CTL_EPDIR_Msk      (0x8000UL)                /*!< EPDIR (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH2CTL_LSD_Pos        (17UL)                    /*!< LSD (Bit 17)                                          */
#define USBFS_HOST_HCH2CTL_LSD_Msk        (0x20000UL)               /*!< LSD (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH2CTL_EPTYPE_Pos     (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_HOST_HCH2CTL_EPTYPE_Msk     (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_HOST_HCH2CTL_DAR_Pos        (22UL)                    /*!< DAR (Bit 22)                                          */
#define USBFS_HOST_HCH2CTL_DAR_Msk        (0x1fc00000UL)            /*!< DAR (Bitfield-Mask: 0x7f)                             */
#define USBFS_HOST_HCH2CTL_ODDFRM_Pos     (29UL)                    /*!< ODDFRM (Bit 29)                                       */
#define USBFS_HOST_HCH2CTL_ODDFRM_Msk     (0x20000000UL)            /*!< ODDFRM (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH2CTL_CDIS_Pos       (30UL)                    /*!< CDIS (Bit 30)                                         */
#define USBFS_HOST_HCH2CTL_CDIS_Msk       (0x40000000UL)            /*!< CDIS (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH2CTL_CEN_Pos        (31UL)                    /*!< CEN (Bit 31)                                          */
#define USBFS_HOST_HCH2CTL_CEN_Msk        (0x80000000UL)            /*!< CEN (Bitfield-Mask: 0x01)                             */
/* ========================================================  HCH3CTL  ======================================================== */
#define USBFS_HOST_HCH3CTL_MPL_Pos        (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_HOST_HCH3CTL_MPL_Msk        (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
#define USBFS_HOST_HCH3CTL_EPNUM_Pos      (11UL)                    /*!< EPNUM (Bit 11)                                        */
#define USBFS_HOST_HCH3CTL_EPNUM_Msk      (0x7800UL)                /*!< EPNUM (Bitfield-Mask: 0x0f)                           */
#define USBFS_HOST_HCH3CTL_EPDIR_Pos      (15UL)                    /*!< EPDIR (Bit 15)                                        */
#define USBFS_HOST_HCH3CTL_EPDIR_Msk      (0x8000UL)                /*!< EPDIR (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH3CTL_LSD_Pos        (17UL)                    /*!< LSD (Bit 17)                                          */
#define USBFS_HOST_HCH3CTL_LSD_Msk        (0x20000UL)               /*!< LSD (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH3CTL_EPTYPE_Pos     (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_HOST_HCH3CTL_EPTYPE_Msk     (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_HOST_HCH3CTL_DAR_Pos        (22UL)                    /*!< DAR (Bit 22)                                          */
#define USBFS_HOST_HCH3CTL_DAR_Msk        (0x1fc00000UL)            /*!< DAR (Bitfield-Mask: 0x7f)                             */
#define USBFS_HOST_HCH3CTL_ODDFRM_Pos     (29UL)                    /*!< ODDFRM (Bit 29)                                       */
#define USBFS_HOST_HCH3CTL_ODDFRM_Msk     (0x20000000UL)            /*!< ODDFRM (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH3CTL_CDIS_Pos       (30UL)                    /*!< CDIS (Bit 30)                                         */
#define USBFS_HOST_HCH3CTL_CDIS_Msk       (0x40000000UL)            /*!< CDIS (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH3CTL_CEN_Pos        (31UL)                    /*!< CEN (Bit 31)                                          */
#define USBFS_HOST_HCH3CTL_CEN_Msk        (0x80000000UL)            /*!< CEN (Bitfield-Mask: 0x01)                             */
/* ========================================================  HCH4CTL  ======================================================== */
#define USBFS_HOST_HCH4CTL_MPL_Pos        (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_HOST_HCH4CTL_MPL_Msk        (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
#define USBFS_HOST_HCH4CTL_EPNUM_Pos      (11UL)                    /*!< EPNUM (Bit 11)                                        */
#define USBFS_HOST_HCH4CTL_EPNUM_Msk      (0x7800UL)                /*!< EPNUM (Bitfield-Mask: 0x0f)                           */
#define USBFS_HOST_HCH4CTL_EPDIR_Pos      (15UL)                    /*!< EPDIR (Bit 15)                                        */
#define USBFS_HOST_HCH4CTL_EPDIR_Msk      (0x8000UL)                /*!< EPDIR (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH4CTL_LSD_Pos        (17UL)                    /*!< LSD (Bit 17)                                          */
#define USBFS_HOST_HCH4CTL_LSD_Msk        (0x20000UL)               /*!< LSD (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH4CTL_EPTYPE_Pos     (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_HOST_HCH4CTL_EPTYPE_Msk     (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_HOST_HCH4CTL_DAR_Pos        (22UL)                    /*!< DAR (Bit 22)                                          */
#define USBFS_HOST_HCH4CTL_DAR_Msk        (0x1fc00000UL)            /*!< DAR (Bitfield-Mask: 0x7f)                             */
#define USBFS_HOST_HCH4CTL_ODDFRM_Pos     (29UL)                    /*!< ODDFRM (Bit 29)                                       */
#define USBFS_HOST_HCH4CTL_ODDFRM_Msk     (0x20000000UL)            /*!< ODDFRM (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH4CTL_CDIS_Pos       (30UL)                    /*!< CDIS (Bit 30)                                         */
#define USBFS_HOST_HCH4CTL_CDIS_Msk       (0x40000000UL)            /*!< CDIS (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH4CTL_CEN_Pos        (31UL)                    /*!< CEN (Bit 31)                                          */
#define USBFS_HOST_HCH4CTL_CEN_Msk        (0x80000000UL)            /*!< CEN (Bitfield-Mask: 0x01)                             */
/* ========================================================  HCH5CTL  ======================================================== */
#define USBFS_HOST_HCH5CTL_MPL_Pos        (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_HOST_HCH5CTL_MPL_Msk        (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
#define USBFS_HOST_HCH5CTL_EPNUM_Pos      (11UL)                    /*!< EPNUM (Bit 11)                                        */
#define USBFS_HOST_HCH5CTL_EPNUM_Msk      (0x7800UL)                /*!< EPNUM (Bitfield-Mask: 0x0f)                           */
#define USBFS_HOST_HCH5CTL_EPDIR_Pos      (15UL)                    /*!< EPDIR (Bit 15)                                        */
#define USBFS_HOST_HCH5CTL_EPDIR_Msk      (0x8000UL)                /*!< EPDIR (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH5CTL_LSD_Pos        (17UL)                    /*!< LSD (Bit 17)                                          */
#define USBFS_HOST_HCH5CTL_LSD_Msk        (0x20000UL)               /*!< LSD (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH5CTL_EPTYPE_Pos     (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_HOST_HCH5CTL_EPTYPE_Msk     (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_HOST_HCH5CTL_DAR_Pos        (22UL)                    /*!< DAR (Bit 22)                                          */
#define USBFS_HOST_HCH5CTL_DAR_Msk        (0x1fc00000UL)            /*!< DAR (Bitfield-Mask: 0x7f)                             */
#define USBFS_HOST_HCH5CTL_ODDFRM_Pos     (29UL)                    /*!< ODDFRM (Bit 29)                                       */
#define USBFS_HOST_HCH5CTL_ODDFRM_Msk     (0x20000000UL)            /*!< ODDFRM (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH5CTL_CDIS_Pos       (30UL)                    /*!< CDIS (Bit 30)                                         */
#define USBFS_HOST_HCH5CTL_CDIS_Msk       (0x40000000UL)            /*!< CDIS (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH5CTL_CEN_Pos        (31UL)                    /*!< CEN (Bit 31)                                          */
#define USBFS_HOST_HCH5CTL_CEN_Msk        (0x80000000UL)            /*!< CEN (Bitfield-Mask: 0x01)                             */
/* ========================================================  HCH6CTL  ======================================================== */
#define USBFS_HOST_HCH6CTL_MPL_Pos        (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_HOST_HCH6CTL_MPL_Msk        (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
#define USBFS_HOST_HCH6CTL_EPNUM_Pos      (11UL)                    /*!< EPNUM (Bit 11)                                        */
#define USBFS_HOST_HCH6CTL_EPNUM_Msk      (0x7800UL)                /*!< EPNUM (Bitfield-Mask: 0x0f)                           */
#define USBFS_HOST_HCH6CTL_EPDIR_Pos      (15UL)                    /*!< EPDIR (Bit 15)                                        */
#define USBFS_HOST_HCH6CTL_EPDIR_Msk      (0x8000UL)                /*!< EPDIR (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH6CTL_LSD_Pos        (17UL)                    /*!< LSD (Bit 17)                                          */
#define USBFS_HOST_HCH6CTL_LSD_Msk        (0x20000UL)               /*!< LSD (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH6CTL_EPTYPE_Pos     (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_HOST_HCH6CTL_EPTYPE_Msk     (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_HOST_HCH6CTL_DAR_Pos        (22UL)                    /*!< DAR (Bit 22)                                          */
#define USBFS_HOST_HCH6CTL_DAR_Msk        (0x1fc00000UL)            /*!< DAR (Bitfield-Mask: 0x7f)                             */
#define USBFS_HOST_HCH6CTL_ODDFRM_Pos     (29UL)                    /*!< ODDFRM (Bit 29)                                       */
#define USBFS_HOST_HCH6CTL_ODDFRM_Msk     (0x20000000UL)            /*!< ODDFRM (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH6CTL_CDIS_Pos       (30UL)                    /*!< CDIS (Bit 30)                                         */
#define USBFS_HOST_HCH6CTL_CDIS_Msk       (0x40000000UL)            /*!< CDIS (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH6CTL_CEN_Pos        (31UL)                    /*!< CEN (Bit 31)                                          */
#define USBFS_HOST_HCH6CTL_CEN_Msk        (0x80000000UL)            /*!< CEN (Bitfield-Mask: 0x01)                             */
/* ========================================================  HCH7CTL  ======================================================== */
#define USBFS_HOST_HCH7CTL_MPL_Pos        (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_HOST_HCH7CTL_MPL_Msk        (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
#define USBFS_HOST_HCH7CTL_EPNUM_Pos      (11UL)                    /*!< EPNUM (Bit 11)                                        */
#define USBFS_HOST_HCH7CTL_EPNUM_Msk      (0x7800UL)                /*!< EPNUM (Bitfield-Mask: 0x0f)                           */
#define USBFS_HOST_HCH7CTL_EPDIR_Pos      (15UL)                    /*!< EPDIR (Bit 15)                                        */
