RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define USBFS_HOST_HCH7CTL_EPDIR_Msk      (0x8000UL)                /*!< EPDIR (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH7CTL_LSD_Pos        (17UL)                    /*!< LSD (Bit 17)                                          */
#define USBFS_HOST_HCH7CTL_LSD_Msk        (0x20000UL)               /*!< LSD (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH7CTL_EPTYPE_Pos     (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_HOST_HCH7CTL_EPTYPE_Msk     (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_HOST_HCH7CTL_DAR_Pos        (22UL)                    /*!< DAR (Bit 22)                                          */
#define USBFS_HOST_HCH7CTL_DAR_Msk        (0x1fc00000UL)            /*!< DAR (Bitfield-Mask: 0x7f)                             */
#define USBFS_HOST_HCH7CTL_ODDFRM_Pos     (29UL)                    /*!< ODDFRM (Bit 29)                                       */
#define USBFS_HOST_HCH7CTL_ODDFRM_Msk     (0x20000000UL)            /*!< ODDFRM (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH7CTL_CDIS_Pos       (30UL)                    /*!< CDIS (Bit 30)                                         */
#define USBFS_HOST_HCH7CTL_CDIS_Msk       (0x40000000UL)            /*!< CDIS (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH7CTL_CEN_Pos        (31UL)                    /*!< CEN (Bit 31)                                          */
#define USBFS_HOST_HCH7CTL_CEN_Msk        (0x80000000UL)            /*!< CEN (Bitfield-Mask: 0x01)                             */
/* =======================================================  HCH0INTF  ======================================================== */
#define USBFS_HOST_HCH0INTF_TF_Pos        (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_HOST_HCH0INTF_TF_Msk        (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH0INTF_CH_Pos        (1UL)                     /*!< CH (Bit 1)                                            */
#define USBFS_HOST_HCH0INTF_CH_Msk        (0x2UL)                   /*!< CH (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH0INTF_STALL_Pos     (3UL)                     /*!< STALL (Bit 3)                                         */
#define USBFS_HOST_HCH0INTF_STALL_Msk     (0x8UL)                   /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH0INTF_NAK_Pos       (4UL)                     /*!< NAK (Bit 4)                                           */
#define USBFS_HOST_HCH0INTF_NAK_Msk       (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH0INTF_ACK_Pos       (5UL)                     /*!< ACK (Bit 5)                                           */
#define USBFS_HOST_HCH0INTF_ACK_Msk       (0x20UL)                  /*!< ACK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH0INTF_USBER_Pos     (7UL)                     /*!< USBER (Bit 7)                                         */
#define USBFS_HOST_HCH0INTF_USBER_Msk     (0x80UL)                  /*!< USBER (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH0INTF_BBER_Pos      (8UL)                     /*!< BBER (Bit 8)                                          */
#define USBFS_HOST_HCH0INTF_BBER_Msk      (0x100UL)                 /*!< BBER (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH0INTF_REQOVR_Pos    (9UL)                     /*!< REQOVR (Bit 9)                                        */
#define USBFS_HOST_HCH0INTF_REQOVR_Msk    (0x200UL)                 /*!< REQOVR (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH0INTF_DTER_Pos      (10UL)                    /*!< DTER (Bit 10)                                         */
#define USBFS_HOST_HCH0INTF_DTER_Msk      (0x400UL)                 /*!< DTER (Bitfield-Mask: 0x01)                            */
/* =======================================================  HCH1INTF  ======================================================== */
#define USBFS_HOST_HCH1INTF_TF_Pos        (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_HOST_HCH1INTF_TF_Msk        (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH1INTF_CH_Pos        (1UL)                     /*!< CH (Bit 1)                                            */
#define USBFS_HOST_HCH1INTF_CH_Msk        (0x2UL)                   /*!< CH (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH1INTF_STALL_Pos     (3UL)                     /*!< STALL (Bit 3)                                         */
#define USBFS_HOST_HCH1INTF_STALL_Msk     (0x8UL)                   /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH1INTF_NAK_Pos       (4UL)                     /*!< NAK (Bit 4)                                           */
#define USBFS_HOST_HCH1INTF_NAK_Msk       (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH1INTF_ACK_Pos       (5UL)                     /*!< ACK (Bit 5)                                           */
#define USBFS_HOST_HCH1INTF_ACK_Msk       (0x20UL)                  /*!< ACK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH1INTF_USBER_Pos     (7UL)                     /*!< USBER (Bit 7)                                         */
#define USBFS_HOST_HCH1INTF_USBER_Msk     (0x80UL)                  /*!< USBER (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH1INTF_BBER_Pos      (8UL)                     /*!< BBER (Bit 8)                                          */
#define USBFS_HOST_HCH1INTF_BBER_Msk      (0x100UL)                 /*!< BBER (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH1INTF_REQOVR_Pos    (9UL)                     /*!< REQOVR (Bit 9)                                        */
#define USBFS_HOST_HCH1INTF_REQOVR_Msk    (0x200UL)                 /*!< REQOVR (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH1INTF_DTER_Pos      (10UL)                    /*!< DTER (Bit 10)                                         */
#define USBFS_HOST_HCH1INTF_DTER_Msk      (0x400UL)                 /*!< DTER (Bitfield-Mask: 0x01)                            */
/* =======================================================  HCH2INTF  ======================================================== */
#define USBFS_HOST_HCH2INTF_TF_Pos        (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_HOST_HCH2INTF_TF_Msk        (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH2INTF_CH_Pos        (1UL)                     /*!< CH (Bit 1)                                            */
#define USBFS_HOST_HCH2INTF_CH_Msk        (0x2UL)                   /*!< CH (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH2INTF_STALL_Pos     (3UL)                     /*!< STALL (Bit 3)                                         */
#define USBFS_HOST_HCH2INTF_STALL_Msk     (0x8UL)                   /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH2INTF_NAK_Pos       (4UL)                     /*!< NAK (Bit 4)                                           */
#define USBFS_HOST_HCH2INTF_NAK_Msk       (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH2INTF_ACK_Pos       (5UL)                     /*!< ACK (Bit 5)                                           */
#define USBFS_HOST_HCH2INTF_ACK_Msk       (0x20UL)                  /*!< ACK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH2INTF_USBER_Pos     (7UL)                     /*!< USBER (Bit 7)                                         */
#define USBFS_HOST_HCH2INTF_USBER_Msk     (0x80UL)                  /*!< USBER (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH2INTF_BBER_Pos      (8UL)                     /*!< BBER (Bit 8)                                          */
#define USBFS_HOST_HCH2INTF_BBER_Msk      (0x100UL)                 /*!< BBER (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH2INTF_REQOVR_Pos    (9UL)                     /*!< REQOVR (Bit 9)                                        */
#define USBFS_HOST_HCH2INTF_REQOVR_Msk    (0x200UL)                 /*!< REQOVR (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH2INTF_DTER_Pos      (10UL)                    /*!< DTER (Bit 10)                                         */
#define USBFS_HOST_HCH2INTF_DTER_Msk      (0x400UL)                 /*!< DTER (Bitfield-Mask: 0x01)                            */
/* =======================================================  HCH3INTF  ======================================================== */
#define USBFS_HOST_HCH3INTF_TF_Pos        (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_HOST_HCH3INTF_TF_Msk        (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH3INTF_CH_Pos        (1UL)                     /*!< CH (Bit 1)                                            */
#define USBFS_HOST_HCH3INTF_CH_Msk        (0x2UL)                   /*!< CH (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH3INTF_STALL_Pos     (3UL)                     /*!< STALL (Bit 3)                                         */
#define USBFS_HOST_HCH3INTF_STALL_Msk     (0x8UL)                   /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH3INTF_NAK_Pos       (4UL)                     /*!< NAK (Bit 4)                                           */
#define USBFS_HOST_HCH3INTF_NAK_Msk       (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH3INTF_ACK_Pos       (5UL)                     /*!< ACK (Bit 5)                                           */
#define USBFS_HOST_HCH3INTF_ACK_Msk       (0x20UL)                  /*!< ACK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH3INTF_USBER_Pos     (7UL)                     /*!< USBER (Bit 7)                                         */
#define USBFS_HOST_HCH3INTF_USBER_Msk     (0x80UL)                  /*!< USBER (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH3INTF_BBER_Pos      (8UL)                     /*!< BBER (Bit 8)                                          */
#define USBFS_HOST_HCH3INTF_BBER_Msk      (0x100UL)                 /*!< BBER (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH3INTF_REQOVR_Pos    (9UL)                     /*!< REQOVR (Bit 9)                                        */
#define USBFS_HOST_HCH3INTF_REQOVR_Msk    (0x200UL)                 /*!< REQOVR (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH3INTF_DTER_Pos      (10UL)                    /*!< DTER (Bit 10)                                         */
#define USBFS_HOST_HCH3INTF_DTER_Msk      (0x400UL)                 /*!< DTER (Bitfield-Mask: 0x01)                            */
/* =======================================================  HCH4INTF  ======================================================== */
#define USBFS_HOST_HCH4INTF_TF_Pos        (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_HOST_HCH4INTF_TF_Msk        (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH4INTF_CH_Pos        (1UL)                     /*!< CH (Bit 1)                                            */
#define USBFS_HOST_HCH4INTF_CH_Msk        (0x2UL)                   /*!< CH (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH4INTF_STALL_Pos     (3UL)                     /*!< STALL (Bit 3)                                         */
#define USBFS_HOST_HCH4INTF_STALL_Msk     (0x8UL)                   /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH4INTF_NAK_Pos       (4UL)                     /*!< NAK (Bit 4)                                           */
#define USBFS_HOST_HCH4INTF_NAK_Msk       (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH4INTF_ACK_Pos       (5UL)                     /*!< ACK (Bit 5)                                           */
#define USBFS_HOST_HCH4INTF_ACK_Msk       (0x20UL)                  /*!< ACK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH4INTF_USBER_Pos     (7UL)                     /*!< USBER (Bit 7)                                         */
#define USBFS_HOST_HCH4INTF_USBER_Msk     (0x80UL)                  /*!< USBER (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH4INTF_BBER_Pos      (8UL)                     /*!< BBER (Bit 8)                                          */
#define USBFS_HOST_HCH4INTF_BBER_Msk      (0x100UL)                 /*!< BBER (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH4INTF_REQOVR_Pos    (9UL)                     /*!< REQOVR (Bit 9)                                        */
#define USBFS_HOST_HCH4INTF_REQOVR_Msk    (0x200UL)                 /*!< REQOVR (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH4INTF_DTER_Pos      (10UL)                    /*!< DTER (Bit 10)                                         */
#define USBFS_HOST_HCH4INTF_DTER_Msk      (0x400UL)                 /*!< DTER (Bitfield-Mask: 0x01)                            */
/* =======================================================  HCH5INTF  ======================================================== */
#define USBFS_HOST_HCH5INTF_TF_Pos        (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_HOST_HCH5INTF_TF_Msk        (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH5INTF_CH_Pos        (1UL)                     /*!< CH (Bit 1)                                            */
#define USBFS_HOST_HCH5INTF_CH_Msk        (0x2UL)                   /*!< CH (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH5INTF_STALL_Pos     (3UL)                     /*!< STALL (Bit 3)                                         */
#define USBFS_HOST_HCH5INTF_STALL_Msk     (0x8UL)                   /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH5INTF_NAK_Pos       (4UL)                     /*!< NAK (Bit 4)                                           */
#define USBFS_HOST_HCH5INTF_NAK_Msk       (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH5INTF_ACK_Pos       (5UL)                     /*!< ACK (Bit 5)                                           */
#define USBFS_HOST_HCH5INTF_ACK_Msk       (0x20UL)                  /*!< ACK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH5INTF_USBER_Pos     (7UL)                     /*!< USBER (Bit 7)                                         */
#define USBFS_HOST_HCH5INTF_USBER_Msk     (0x80UL)                  /*!< USBER (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH5INTF_BBER_Pos      (8UL)                     /*!< BBER (Bit 8)                                          */
#define USBFS_HOST_HCH5INTF_BBER_Msk      (0x100UL)                 /*!< BBER (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH5INTF_REQOVR_Pos    (9UL)                     /*!< REQOVR (Bit 9)                                        */
#define USBFS_HOST_HCH5INTF_REQOVR_Msk    (0x200UL)                 /*!< REQOVR (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH5INTF_DTER_Pos      (10UL)                    /*!< DTER (Bit 10)                                         */
#define USBFS_HOST_HCH5INTF_DTER_Msk      (0x400UL)                 /*!< DTER (Bitfield-Mask: 0x01)                            */
/* =======================================================  HCH6INTF  ======================================================== */
#define USBFS_HOST_HCH6INTF_TF_Pos        (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_HOST_HCH6INTF_TF_Msk        (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH6INTF_CH_Pos        (1UL)                     /*!< CH (Bit 1)                                            */
#define USBFS_HOST_HCH6INTF_CH_Msk        (0x2UL)                   /*!< CH (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH6INTF_STALL_Pos     (3UL)                     /*!< STALL (Bit 3)                                         */
#define USBFS_HOST_HCH6INTF_STALL_Msk     (0x8UL)                   /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH6INTF_NAK_Pos       (4UL)                     /*!< NAK (Bit 4)                                           */
#define USBFS_HOST_HCH6INTF_NAK_Msk       (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH6INTF_ACK_Pos       (5UL)                     /*!< ACK (Bit 5)                                           */
#define USBFS_HOST_HCH6INTF_ACK_Msk       (0x20UL)                  /*!< ACK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH6INTF_USBER_Pos     (7UL)                     /*!< USBER (Bit 7)                                         */
#define USBFS_HOST_HCH6INTF_USBER_Msk     (0x80UL)                  /*!< USBER (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH6INTF_BBER_Pos      (8UL)                     /*!< BBER (Bit 8)                                          */
#define USBFS_HOST_HCH6INTF_BBER_Msk      (0x100UL)                 /*!< BBER (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH6INTF_REQOVR_Pos    (9UL)                     /*!< REQOVR (Bit 9)                                        */
#define USBFS_HOST_HCH6INTF_REQOVR_Msk    (0x200UL)                 /*!< REQOVR (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH6INTF_DTER_Pos      (10UL)                    /*!< DTER (Bit 10)                                         */
#define USBFS_HOST_HCH6INTF_DTER_Msk      (0x400UL)                 /*!< DTER (Bitfield-Mask: 0x01)                            */
/* =======================================================  HCH7INTF  ======================================================== */
#define USBFS_HOST_HCH7INTF_TF_Pos        (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_HOST_HCH7INTF_TF_Msk        (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH7INTF_CH_Pos        (1UL)                     /*!< CH (Bit 1)                                            */
#define USBFS_HOST_HCH7INTF_CH_Msk        (0x2UL)                   /*!< CH (Bitfield-Mask: 0x01)                              */
#define USBFS_HOST_HCH7INTF_STALL_Pos     (3UL)                     /*!< STALL (Bit 3)                                         */
#define USBFS_HOST_HCH7INTF_STALL_Msk     (0x8UL)                   /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH7INTF_NAK_Pos       (4UL)                     /*!< NAK (Bit 4)                                           */
#define USBFS_HOST_HCH7INTF_NAK_Msk       (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH7INTF_ACK_Pos       (5UL)                     /*!< ACK (Bit 5)                                           */
#define USBFS_HOST_HCH7INTF_ACK_Msk       (0x20UL)                  /*!< ACK (Bitfield-Mask: 0x01)                             */
#define USBFS_HOST_HCH7INTF_USBER_Pos     (7UL)                     /*!< USBER (Bit 7)                                         */
#define USBFS_HOST_HCH7INTF_USBER_Msk     (0x80UL)                  /*!< USBER (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH7INTF_BBER_Pos      (8UL)                     /*!< BBER (Bit 8)                                          */
#define USBFS_HOST_HCH7INTF_BBER_Msk      (0x100UL)                 /*!< BBER (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH7INTF_REQOVR_Pos    (9UL)                     /*!< REQOVR (Bit 9)                                        */
#define USBFS_HOST_HCH7INTF_REQOVR_Msk    (0x200UL)                 /*!< REQOVR (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH7INTF_DTER_Pos      (10UL)                    /*!< DTER (Bit 10)                                         */
#define USBFS_HOST_HCH7INTF_DTER_Msk      (0x400UL)                 /*!< DTER (Bitfield-Mask: 0x01)                            */
/* =======================================================  HCH0INTEN  ======================================================= */
#define USBFS_HOST_HCH0INTEN_TFIE_Pos     (0UL)                     /*!< TFIE (Bit 0)                                          */
#define USBFS_HOST_HCH0INTEN_TFIE_Msk     (0x1UL)                   /*!< TFIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH0INTEN_CHIE_Pos     (1UL)                     /*!< CHIE (Bit 1)                                          */
#define USBFS_HOST_HCH0INTEN_CHIE_Msk     (0x2UL)                   /*!< CHIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH0INTEN_STALLIE_Pos  (3UL)                     /*!< STALLIE (Bit 3)                                       */
#define USBFS_HOST_HCH0INTEN_STALLIE_Msk  (0x8UL)                   /*!< STALLIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH0INTEN_NAKIE_Pos    (4UL)                     /*!< NAKIE (Bit 4)                                         */
#define USBFS_HOST_HCH0INTEN_NAKIE_Msk    (0x10UL)                  /*!< NAKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH0INTEN_ACKIE_Pos    (5UL)                     /*!< ACKIE (Bit 5)                                         */
#define USBFS_HOST_HCH0INTEN_ACKIE_Msk    (0x20UL)                  /*!< ACKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH0INTEN_USBERIE_Pos  (7UL)                     /*!< USBERIE (Bit 7)                                       */
#define USBFS_HOST_HCH0INTEN_USBERIE_Msk  (0x80UL)                  /*!< USBERIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH0INTEN_BBERIE_Pos   (8UL)                     /*!< BBERIE (Bit 8)                                        */
#define USBFS_HOST_HCH0INTEN_BBERIE_Msk   (0x100UL)                 /*!< BBERIE (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH0INTEN_REQOVRIE_Pos (9UL)                     /*!< REQOVRIE (Bit 9)                                      */
#define USBFS_HOST_HCH0INTEN_REQOVRIE_Msk (0x200UL)                 /*!< REQOVRIE (Bitfield-Mask: 0x01)                        */
#define USBFS_HOST_HCH0INTEN_DTERIE_Pos   (10UL)                    /*!< DTERIE (Bit 10)                                       */
#define USBFS_HOST_HCH0INTEN_DTERIE_Msk   (0x400UL)                 /*!< DTERIE (Bitfield-Mask: 0x01)                          */
