RIOT-OS/RIOT/cpu/gd32v/include/vendor/gd32vf103_periph.h
#define USBFS_HOST_HCH7LEN_TLEN_Msk       (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
#define USBFS_HOST_HCH7LEN_PCNT_Pos       (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_HOST_HCH7LEN_PCNT_Msk       (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_HOST_HCH7LEN_DPID_Pos       (29UL)                    /*!< DPID (Bit 29)                                         */
#define USBFS_HOST_HCH7LEN_DPID_Msk       (0x60000000UL)            /*!< DPID (Bitfield-Mask: 0x03)                            */


/* =========================================================================================================================== */
/* ================                                       USBFS_DEVICE                                        ================ */
/* =========================================================================================================================== */

/* =========================================================  DCFG  ========================================================== */
#define USBFS_DEVICE_DCFG_DS_Pos          (0UL)                     /*!< DS (Bit 0)                                            */
#define USBFS_DEVICE_DCFG_DS_Msk          (0x3UL)                   /*!< DS (Bitfield-Mask: 0x03)                              */
#define USBFS_DEVICE_DCFG_NZLSOH_Pos      (2UL)                     /*!< NZLSOH (Bit 2)                                        */
#define USBFS_DEVICE_DCFG_NZLSOH_Msk      (0x4UL)                   /*!< NZLSOH (Bitfield-Mask: 0x01)                          */
#define USBFS_DEVICE_DCFG_DAR_Pos         (4UL)                     /*!< DAR (Bit 4)                                           */
#define USBFS_DEVICE_DCFG_DAR_Msk         (0x7f0UL)                 /*!< DAR (Bitfield-Mask: 0x7f)                             */
#define USBFS_DEVICE_DCFG_EOPFT_Pos       (11UL)                    /*!< EOPFT (Bit 11)                                        */
#define USBFS_DEVICE_DCFG_EOPFT_Msk       (0x1800UL)                /*!< EOPFT (Bitfield-Mask: 0x03)                           */
/* =========================================================  DCTL  ========================================================== */
#define USBFS_DEVICE_DCTL_RWKUP_Pos       (0UL)                     /*!< RWKUP (Bit 0)                                         */
#define USBFS_DEVICE_DCTL_RWKUP_Msk       (0x1UL)                   /*!< RWKUP (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DCTL_SD_Pos          (1UL)                     /*!< SD (Bit 1)                                            */
#define USBFS_DEVICE_DCTL_SD_Msk          (0x2UL)                   /*!< SD (Bitfield-Mask: 0x01)                              */
#define USBFS_DEVICE_DCTL_GINS_Pos        (2UL)                     /*!< GINS (Bit 2)                                          */
#define USBFS_DEVICE_DCTL_GINS_Msk        (0x4UL)                   /*!< GINS (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DCTL_GONS_Pos        (3UL)                     /*!< GONS (Bit 3)                                          */
#define USBFS_DEVICE_DCTL_GONS_Msk        (0x8UL)                   /*!< GONS (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DCTL_SGINAK_Pos      (7UL)                     /*!< SGINAK (Bit 7)                                        */
#define USBFS_DEVICE_DCTL_SGINAK_Msk      (0x80UL)                  /*!< SGINAK (Bitfield-Mask: 0x01)                          */
#define USBFS_DEVICE_DCTL_CGINAK_Pos      (8UL)                     /*!< CGINAK (Bit 8)                                        */
#define USBFS_DEVICE_DCTL_CGINAK_Msk      (0x100UL)                 /*!< CGINAK (Bitfield-Mask: 0x01)                          */
#define USBFS_DEVICE_DCTL_SGONAK_Pos      (9UL)                     /*!< SGONAK (Bit 9)                                        */
#define USBFS_DEVICE_DCTL_SGONAK_Msk      (0x200UL)                 /*!< SGONAK (Bitfield-Mask: 0x01)                          */
#define USBFS_DEVICE_DCTL_CGONAK_Pos      (10UL)                    /*!< CGONAK (Bit 10)                                       */
#define USBFS_DEVICE_DCTL_CGONAK_Msk      (0x400UL)                 /*!< CGONAK (Bitfield-Mask: 0x01)                          */
#define USBFS_DEVICE_DCTL_POIF_Pos        (11UL)                    /*!< POIF (Bit 11)                                         */
#define USBFS_DEVICE_DCTL_POIF_Msk        (0x800UL)                 /*!< POIF (Bitfield-Mask: 0x01)                            */
/* =========================================================  DSTAT  ========================================================= */
#define USBFS_DEVICE_DSTAT_SPST_Pos       (0UL)                     /*!< SPST (Bit 0)                                          */
#define USBFS_DEVICE_DSTAT_SPST_Msk       (0x1UL)                   /*!< SPST (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DSTAT_ES_Pos         (1UL)                     /*!< ES (Bit 1)                                            */
#define USBFS_DEVICE_DSTAT_ES_Msk         (0x6UL)                   /*!< ES (Bitfield-Mask: 0x03)                              */
#define USBFS_DEVICE_DSTAT_FNRSOF_Pos     (8UL)                     /*!< FNRSOF (Bit 8)                                        */
#define USBFS_DEVICE_DSTAT_FNRSOF_Msk     (0x3fff00UL)              /*!< FNRSOF (Bitfield-Mask: 0x3fff)                        */
/* =======================================================  DIEPINTEN  ======================================================= */
#define USBFS_DEVICE_DIEPINTEN_TFEN_Pos   (0UL)                     /*!< TFEN (Bit 0)                                          */
#define USBFS_DEVICE_DIEPINTEN_TFEN_Msk   (0x1UL)                   /*!< TFEN (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEPINTEN_EPDISEN_Pos (1UL)                    /*!< EPDISEN (Bit 1)                                       */
#define USBFS_DEVICE_DIEPINTEN_EPDISEN_Msk (0x2UL)                  /*!< EPDISEN (Bitfield-Mask: 0x01)                         */
#define USBFS_DEVICE_DIEPINTEN_CITOEN_Pos (3UL)                     /*!< CITOEN (Bit 3)                                        */
#define USBFS_DEVICE_DIEPINTEN_CITOEN_Msk (0x8UL)                   /*!< CITOEN (Bitfield-Mask: 0x01)                          */
#define USBFS_DEVICE_DIEPINTEN_EPTXFUDEN_Pos (4UL)                  /*!< EPTXFUDEN (Bit 4)                                     */
#define USBFS_DEVICE_DIEPINTEN_EPTXFUDEN_Msk (0x10UL)               /*!< EPTXFUDEN (Bitfield-Mask: 0x01)                       */
#define USBFS_DEVICE_DIEPINTEN_IEPNEEN_Pos (6UL)                    /*!< IEPNEEN (Bit 6)                                       */
#define USBFS_DEVICE_DIEPINTEN_IEPNEEN_Msk (0x40UL)                 /*!< IEPNEEN (Bitfield-Mask: 0x01)                         */
/* =======================================================  DOEPINTEN  ======================================================= */
#define USBFS_DEVICE_DOEPINTEN_TFEN_Pos   (0UL)                     /*!< TFEN (Bit 0)                                          */
#define USBFS_DEVICE_DOEPINTEN_TFEN_Msk   (0x1UL)                   /*!< TFEN (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEPINTEN_EPDISEN_Pos (1UL)                    /*!< EPDISEN (Bit 1)                                       */
#define USBFS_DEVICE_DOEPINTEN_EPDISEN_Msk (0x2UL)                  /*!< EPDISEN (Bitfield-Mask: 0x01)                         */
#define USBFS_DEVICE_DOEPINTEN_STPFEN_Pos (3UL)                     /*!< STPFEN (Bit 3)                                        */
#define USBFS_DEVICE_DOEPINTEN_STPFEN_Msk (0x8UL)                   /*!< STPFEN (Bitfield-Mask: 0x01)                          */
#define USBFS_DEVICE_DOEPINTEN_EPRXFOVREN_Pos (4UL)                 /*!< EPRXFOVREN (Bit 4)                                    */
#define USBFS_DEVICE_DOEPINTEN_EPRXFOVREN_Msk (0x10UL)              /*!< EPRXFOVREN (Bitfield-Mask: 0x01)                      */
#define USBFS_DEVICE_DOEPINTEN_BTBSTPEN_Pos (6UL)                   /*!< BTBSTPEN (Bit 6)                                      */
#define USBFS_DEVICE_DOEPINTEN_BTBSTPEN_Msk (0x40UL)                /*!< BTBSTPEN (Bitfield-Mask: 0x01)                        */
/* ========================================================  DAEPINT  ======================================================== */
#define USBFS_DEVICE_DAEPINT_IEPITB_Pos   (0UL)                     /*!< IEPITB (Bit 0)                                        */
#define USBFS_DEVICE_DAEPINT_IEPITB_Msk   (0xfUL)                   /*!< IEPITB (Bitfield-Mask: 0x0f)                          */
#define USBFS_DEVICE_DAEPINT_OEPITB_Pos   (16UL)                    /*!< OEPITB (Bit 16)                                       */
#define USBFS_DEVICE_DAEPINT_OEPITB_Msk   (0xf0000UL)               /*!< OEPITB (Bitfield-Mask: 0x0f)                          */
/* =======================================================  DAEPINTEN  ======================================================= */
#define USBFS_DEVICE_DAEPINTEN_IEPIE_Pos  (0UL)                     /*!< IEPIE (Bit 0)                                         */
#define USBFS_DEVICE_DAEPINTEN_IEPIE_Msk  (0xfUL)                   /*!< IEPIE (Bitfield-Mask: 0x0f)                           */
#define USBFS_DEVICE_DAEPINTEN_OEPIE_Pos  (16UL)                    /*!< OEPIE (Bit 16)                                        */
#define USBFS_DEVICE_DAEPINTEN_OEPIE_Msk  (0xf0000UL)               /*!< OEPIE (Bitfield-Mask: 0x0f)                           */
/* ========================================================  DVBUSDT  ======================================================== */
#define USBFS_DEVICE_DVBUSDT_DVBUSDT_Pos  (0UL)                     /*!< DVBUSDT (Bit 0)                                       */
#define USBFS_DEVICE_DVBUSDT_DVBUSDT_Msk  (0xffffUL)                /*!< DVBUSDT (Bitfield-Mask: 0xffff)                       */
/* ========================================================  DVBUSPT  ======================================================== */
#define USBFS_DEVICE_DVBUSPT_DVBUSPT_Pos  (0UL)                     /*!< DVBUSPT (Bit 0)                                       */
#define USBFS_DEVICE_DVBUSPT_DVBUSPT_Msk  (0xfffUL)                 /*!< DVBUSPT (Bitfield-Mask: 0xfff)                        */
/* ======================================================  DIEPFEINTEN  ====================================================== */
#define USBFS_DEVICE_DIEPFEINTEN_IEPTXFEIE_Pos (0UL)                /*!< IEPTXFEIE (Bit 0)                                     */
#define USBFS_DEVICE_DIEPFEINTEN_IEPTXFEIE_Msk (0xfUL)              /*!< IEPTXFEIE (Bitfield-Mask: 0x0f)                       */
/* =======================================================  DIEP0CTL  ======================================================== */
#define USBFS_DEVICE_DIEP0CTL_MPL_Pos     (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_DEVICE_DIEP0CTL_MPL_Msk     (0x3UL)                   /*!< MPL (Bitfield-Mask: 0x03)                             */
#define USBFS_DEVICE_DIEP0CTL_EPACT_Pos   (15UL)                    /*!< EPACT (Bit 15)                                        */
#define USBFS_DEVICE_DIEP0CTL_EPACT_Msk   (0x8000UL)                /*!< EPACT (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP0CTL_NAKS_Pos    (17UL)                    /*!< NAKS (Bit 17)                                         */
#define USBFS_DEVICE_DIEP0CTL_NAKS_Msk    (0x20000UL)               /*!< NAKS (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP0CTL_EPTYPE_Pos  (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_DEVICE_DIEP0CTL_EPTYPE_Msk  (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_DEVICE_DIEP0CTL_STALL_Pos   (21UL)                    /*!< STALL (Bit 21)                                        */
#define USBFS_DEVICE_DIEP0CTL_STALL_Msk   (0x200000UL)              /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP0CTL_TXFNUM_Pos  (22UL)                    /*!< TXFNUM (Bit 22)                                       */
#define USBFS_DEVICE_DIEP0CTL_TXFNUM_Msk  (0x3c00000UL)             /*!< TXFNUM (Bitfield-Mask: 0x0f)                          */
#define USBFS_DEVICE_DIEP0CTL_CNAK_Pos    (26UL)                    /*!< CNAK (Bit 26)                                         */
#define USBFS_DEVICE_DIEP0CTL_CNAK_Msk    (0x4000000UL)             /*!< CNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP0CTL_SNAK_Pos    (27UL)                    /*!< SNAK (Bit 27)                                         */
#define USBFS_DEVICE_DIEP0CTL_SNAK_Msk    (0x8000000UL)             /*!< SNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP0CTL_EPD_Pos     (30UL)                    /*!< EPD (Bit 30)                                          */
#define USBFS_DEVICE_DIEP0CTL_EPD_Msk     (0x40000000UL)            /*!< EPD (Bitfield-Mask: 0x01)                             */
#define USBFS_DEVICE_DIEP0CTL_EPEN_Pos    (31UL)                    /*!< EPEN (Bit 31)                                         */
#define USBFS_DEVICE_DIEP0CTL_EPEN_Msk    (0x80000000UL)            /*!< EPEN (Bitfield-Mask: 0x01)                            */
/* =======================================================  DIEP1CTL  ======================================================== */
#define USBFS_DEVICE_DIEP1CTL_EPEN_Pos    (31UL)                    /*!< EPEN (Bit 31)                                         */
#define USBFS_DEVICE_DIEP1CTL_EPEN_Msk    (0x80000000UL)            /*!< EPEN (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP1CTL_EPD_Pos     (30UL)                    /*!< EPD (Bit 30)                                          */
#define USBFS_DEVICE_DIEP1CTL_EPD_Msk     (0x40000000UL)            /*!< EPD (Bitfield-Mask: 0x01)                             */
#define USBFS_DEVICE_DIEP1CTL_SD1PID_SODDFRM_Pos (29UL)             /*!< SD1PID_SODDFRM (Bit 29)                               */
#define USBFS_DEVICE_DIEP1CTL_SD1PID_SODDFRM_Msk (0x20000000UL)     /*!< SD1PID_SODDFRM (Bitfield-Mask: 0x01)                  */
#define USBFS_DEVICE_DIEP1CTL_SD0PID_SEVENFRM_Pos (28UL)            /*!< SD0PID_SEVENFRM (Bit 28)                              */
#define USBFS_DEVICE_DIEP1CTL_SD0PID_SEVENFRM_Msk (0x10000000UL)    /*!< SD0PID_SEVENFRM (Bitfield-Mask: 0x01)                 */
#define USBFS_DEVICE_DIEP1CTL_SNAK_Pos    (27UL)                    /*!< SNAK (Bit 27)                                         */
#define USBFS_DEVICE_DIEP1CTL_SNAK_Msk    (0x8000000UL)             /*!< SNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP1CTL_CNAK_Pos    (26UL)                    /*!< CNAK (Bit 26)                                         */
#define USBFS_DEVICE_DIEP1CTL_CNAK_Msk    (0x4000000UL)             /*!< CNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP1CTL_TXFNUM_Pos  (22UL)                    /*!< TXFNUM (Bit 22)                                       */
#define USBFS_DEVICE_DIEP1CTL_TXFNUM_Msk  (0x3c00000UL)             /*!< TXFNUM (Bitfield-Mask: 0x0f)                          */
#define USBFS_DEVICE_DIEP1CTL_STALL_Pos   (21UL)                    /*!< STALL (Bit 21)                                        */
#define USBFS_DEVICE_DIEP1CTL_STALL_Msk   (0x200000UL)              /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP1CTL_EPTYPE_Pos  (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_DEVICE_DIEP1CTL_EPTYPE_Msk  (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_DEVICE_DIEP1CTL_NAKS_Pos    (17UL)                    /*!< NAKS (Bit 17)                                         */
#define USBFS_DEVICE_DIEP1CTL_NAKS_Msk    (0x20000UL)               /*!< NAKS (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP1CTL_EOFRM_DPID_Pos (16UL)                 /*!< EOFRM_DPID (Bit 16)                                   */
#define USBFS_DEVICE_DIEP1CTL_EOFRM_DPID_Msk (0x10000UL)            /*!< EOFRM_DPID (Bitfield-Mask: 0x01)                      */
#define USBFS_DEVICE_DIEP1CTL_EPACT_Pos   (15UL)                    /*!< EPACT (Bit 15)                                        */
#define USBFS_DEVICE_DIEP1CTL_EPACT_Msk   (0x8000UL)                /*!< EPACT (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP1CTL_MPL_Pos     (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_DEVICE_DIEP1CTL_MPL_Msk     (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
/* =======================================================  DIEP2CTL  ======================================================== */
#define USBFS_DEVICE_DIEP2CTL_EPEN_Pos    (31UL)                    /*!< EPEN (Bit 31)                                         */
#define USBFS_DEVICE_DIEP2CTL_EPEN_Msk    (0x80000000UL)            /*!< EPEN (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP2CTL_EPD_Pos     (30UL)                    /*!< EPD (Bit 30)                                          */
#define USBFS_DEVICE_DIEP2CTL_EPD_Msk     (0x40000000UL)            /*!< EPD (Bitfield-Mask: 0x01)                             */
#define USBFS_DEVICE_DIEP2CTL_SD1PID_SODDFRM_Pos (29UL)             /*!< SD1PID_SODDFRM (Bit 29)                               */
#define USBFS_DEVICE_DIEP2CTL_SD1PID_SODDFRM_Msk (0x20000000UL)     /*!< SD1PID_SODDFRM (Bitfield-Mask: 0x01)                  */
#define USBFS_DEVICE_DIEP2CTL_SD0PID_SEVENFRM_Pos (28UL)            /*!< SD0PID_SEVENFRM (Bit 28)                              */
#define USBFS_DEVICE_DIEP2CTL_SD0PID_SEVENFRM_Msk (0x10000000UL)    /*!< SD0PID_SEVENFRM (Bitfield-Mask: 0x01)                 */
#define USBFS_DEVICE_DIEP2CTL_SNAK_Pos    (27UL)                    /*!< SNAK (Bit 27)                                         */
#define USBFS_DEVICE_DIEP2CTL_SNAK_Msk    (0x8000000UL)             /*!< SNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP2CTL_CNAK_Pos    (26UL)                    /*!< CNAK (Bit 26)                                         */
#define USBFS_DEVICE_DIEP2CTL_CNAK_Msk    (0x4000000UL)             /*!< CNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP2CTL_TXFNUM_Pos  (22UL)                    /*!< TXFNUM (Bit 22)                                       */
#define USBFS_DEVICE_DIEP2CTL_TXFNUM_Msk  (0x3c00000UL)             /*!< TXFNUM (Bitfield-Mask: 0x0f)                          */
#define USBFS_DEVICE_DIEP2CTL_STALL_Pos   (21UL)                    /*!< STALL (Bit 21)                                        */
#define USBFS_DEVICE_DIEP2CTL_STALL_Msk   (0x200000UL)              /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP2CTL_EPTYPE_Pos  (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_DEVICE_DIEP2CTL_EPTYPE_Msk  (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_DEVICE_DIEP2CTL_NAKS_Pos    (17UL)                    /*!< NAKS (Bit 17)                                         */
#define USBFS_DEVICE_DIEP2CTL_NAKS_Msk    (0x20000UL)               /*!< NAKS (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP2CTL_EOFRM_DPID_Pos (16UL)                 /*!< EOFRM_DPID (Bit 16)                                   */
#define USBFS_DEVICE_DIEP2CTL_EOFRM_DPID_Msk (0x10000UL)            /*!< EOFRM_DPID (Bitfield-Mask: 0x01)                      */
#define USBFS_DEVICE_DIEP2CTL_EPACT_Pos   (15UL)                    /*!< EPACT (Bit 15)                                        */
#define USBFS_DEVICE_DIEP2CTL_EPACT_Msk   (0x8000UL)                /*!< EPACT (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP2CTL_MPL_Pos     (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_DEVICE_DIEP2CTL_MPL_Msk     (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
/* =======================================================  DIEP3CTL  ======================================================== */
#define USBFS_DEVICE_DIEP3CTL_EPEN_Pos    (31UL)                    /*!< EPEN (Bit 31)                                         */
#define USBFS_DEVICE_DIEP3CTL_EPEN_Msk    (0x80000000UL)            /*!< EPEN (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP3CTL_EPD_Pos     (30UL)                    /*!< EPD (Bit 30)                                          */
#define USBFS_DEVICE_DIEP3CTL_EPD_Msk     (0x40000000UL)            /*!< EPD (Bitfield-Mask: 0x01)                             */
#define USBFS_DEVICE_DIEP3CTL_SD1PID_SODDFRM_Pos (29UL)             /*!< SD1PID_SODDFRM (Bit 29)                               */
#define USBFS_DEVICE_DIEP3CTL_SD1PID_SODDFRM_Msk (0x20000000UL)     /*!< SD1PID_SODDFRM (Bitfield-Mask: 0x01)                  */
#define USBFS_DEVICE_DIEP3CTL_SD0PID_SEVENFRM_Pos (28UL)            /*!< SD0PID_SEVENFRM (Bit 28)                              */
#define USBFS_DEVICE_DIEP3CTL_SD0PID_SEVENFRM_Msk (0x10000000UL)    /*!< SD0PID_SEVENFRM (Bitfield-Mask: 0x01)                 */
#define USBFS_DEVICE_DIEP3CTL_SNAK_Pos    (27UL)                    /*!< SNAK (Bit 27)                                         */
#define USBFS_DEVICE_DIEP3CTL_SNAK_Msk    (0x8000000UL)             /*!< SNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP3CTL_CNAK_Pos    (26UL)                    /*!< CNAK (Bit 26)                                         */
#define USBFS_DEVICE_DIEP3CTL_CNAK_Msk    (0x4000000UL)             /*!< CNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP3CTL_TXFNUM_Pos  (22UL)                    /*!< TXFNUM (Bit 22)                                       */
#define USBFS_DEVICE_DIEP3CTL_TXFNUM_Msk  (0x3c00000UL)             /*!< TXFNUM (Bitfield-Mask: 0x0f)                          */
#define USBFS_DEVICE_DIEP3CTL_STALL_Pos   (21UL)                    /*!< STALL (Bit 21)                                        */
#define USBFS_DEVICE_DIEP3CTL_STALL_Msk   (0x200000UL)              /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP3CTL_EPTYPE_Pos  (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_DEVICE_DIEP3CTL_EPTYPE_Msk  (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_DEVICE_DIEP3CTL_NAKS_Pos    (17UL)                    /*!< NAKS (Bit 17)                                         */
#define USBFS_DEVICE_DIEP3CTL_NAKS_Msk    (0x20000UL)               /*!< NAKS (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP3CTL_EOFRM_DPID_Pos (16UL)                 /*!< EOFRM_DPID (Bit 16)                                   */
#define USBFS_DEVICE_DIEP3CTL_EOFRM_DPID_Msk (0x10000UL)            /*!< EOFRM_DPID (Bitfield-Mask: 0x01)                      */
#define USBFS_DEVICE_DIEP3CTL_EPACT_Pos   (15UL)                    /*!< EPACT (Bit 15)                                        */
#define USBFS_DEVICE_DIEP3CTL_EPACT_Msk   (0x8000UL)                /*!< EPACT (Bitfield-Mask: 0x01)                           */
